-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Nov 30, 2023 at 09:58 AM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.0.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `stock-admin`
--

-- --------------------------------------------------------

--
-- Table structure for table `activity_log`
--

CREATE TABLE `activity_log` (
  `id` int(11) NOT NULL,
  `log_time` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `log_msg` varchar(255) NOT NULL,
  `log_user` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `admin_login`
--

CREATE TABLE `admin_login` (
  `id` int(11) NOT NULL,
  `prefix` varchar(10) NOT NULL,
  `firstname` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `lastname` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `username` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `tel` varchar(10) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `user_level` varchar(1) NOT NULL,
  `position` varchar(255) NOT NULL,
  `division` varchar(100) NOT NULL,
  `part` varchar(100) NOT NULL,
  `subdivision` varchar(100) NOT NULL,
  `section` varchar(10) NOT NULL,
  `img` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `admin_login`
--

INSERT INTO `admin_login` (`id`, `prefix`, `firstname`, `lastname`, `username`, `password`, `email`, `tel`, `user_level`, `position`, `division`, `part`, `subdivision`, `section`, `img`) VALUES
(1, 'นาย', 'ทนงค์', 'บุญเติม', 'admin', 'engineer', 'thanongb42@gmail.com', '0910109174', 'a', 'Administrator', '', '', '', '', 'thanong.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `doc_acceptance`
--

CREATE TABLE `doc_acceptance` (
  `id` int(11) NOT NULL,
  `contract_no` varchar(50) NOT NULL,
  `user_upload` varchar(100) NOT NULL,
  `date_upload` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `file_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `doc_acceptance`
--

INSERT INTO `doc_acceptance` (`id`, `contract_no`, `user_upload`, `date_upload`, `file_name`) VALUES
(1, 'CNTR-0056/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0056_64.pdf'),
(2, 'CNTR-0071/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0071_64.pdf'),
(3, 'CNTR-0095/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0095_64.pdf'),
(4, 'CNTR-0106/62', 'admin', '2021-07-16 09:00:47', 'CNTR-0106_62.pdf'),
(5, 'CNTR-0122/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0122_63.pdf'),
(6, 'CNTR-0215/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0215_64.pdf'),
(7, 'CNTR-0216/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0216_64.pdf'),
(8, 'CNTR-0223/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0223_64.pdf'),
(9, 'CNTR-0234/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0234_64.pdf'),
(10, 'CNTR-0283/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0283_64.pdf'),
(11, 'CNTR-0302/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0302_64.pdf'),
(12, 'CNTR-0303/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0303_64.pdf'),
(13, 'CNTR-0341/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0341_64.pdf'),
(14, 'CNTR-0404/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0404_64.pdf'),
(15, 'CNTR-0407/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0407_63.pdf'),
(16, 'CNTR-0409/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0409_63.pdf'),
(17, 'CNTR-0416/62', 'admin', '2021-07-16 09:00:47', 'CNTR-0416_62.pdf'),
(18, 'CNTR-0454/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0454_64.pdf'),
(19, 'CNTR-0477/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0477_64.pdf'),
(20, 'CNTR-0504/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0504_63.pdf'),
(21, 'CNTR-0508/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0508_64.pdf'),
(22, 'CNTR-0527/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0527_63.pdf'),
(23, 'CNTR-0527/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0527_64.pdf'),
(24, 'CNTR-0550/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0550_63.pdf'),
(25, 'CNTR-0564/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0564_64.pdf'),
(26, 'CNTR-0569/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0569_63.pdf'),
(27, 'CNTR-0576/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0576_64.pdf'),
(28, 'CNTR-0583/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0583_64.pdf'),
(29, 'CNTR-0593/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0593_63.pdf'),
(30, 'CNTR-0597/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0597_64.pdf'),
(31, 'CNTR-0607/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0607_64.pdf'),
(32, 'CNTR-0610/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0610_64.pdf'),
(33, 'CNTR-0628/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0628_63.pdf'),
(34, 'CNTR-0638/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0638_64.pdf'),
(35, 'CNTR-0639/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0639_64.pdf'),
(36, 'CNTR-0641/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0641_64.pdf'),
(37, 'CNTR-0649/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0649_64.pdf'),
(38, 'CNTR-0659/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0659_64.pdf'),
(39, 'CNTR-0663/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0663_64.pdf'),
(40, 'CNTR-0680/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0680_64.pdf'),
(41, 'CNTR-0692/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0692_64.pdf'),
(42, 'CNTR-0696/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0696_64.pdf'),
(43, 'CNTR-0697/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0697_64.pdf'),
(44, 'CNTR-0699/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0699_64.pdf'),
(45, 'CNTR-0702/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0702_64.pdf'),
(46, 'CNTR-0738/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0738_64.pdf'),
(47, 'CNTR-0743/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0743_64.pdf'),
(48, 'CNTR-0744/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0744_63.pdf'),
(49, 'CNTR-0745/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0745_64.pdf'),
(50, 'CNTR-0746/60', 'admin', '2021-07-16 09:00:47', 'CNTR-0746_60.pdf'),
(51, 'CNTR-0755/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0755_64.pdf'),
(52, 'CNTR-0757/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0757_64.pdf'),
(53, 'CNTR-0759/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0759_63.pdf'),
(54, 'CNTR-0763/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0763_64.pdf'),
(55, 'CNTR-0771/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0771_64.pdf'),
(56, 'CNTR-0775/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0775_63.pdf'),
(57, 'CNTR-0798/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0798_63.pdf'),
(58, 'CNTR-0818/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0818_64.pdf'),
(59, 'CNTR-0847/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0847_63.pdf'),
(60, 'CNTR-0853/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0853_63.pdf'),
(61, 'CNTR-0856/64', 'admin', '2021-07-16 09:00:47', 'CNTR-0856_64.pdf'),
(62, 'CNTR-0874/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0874_63.pdf'),
(63, 'CNTR-0889/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0889_63.pdf'),
(64, 'CNTR-0890/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0890_63.pdf'),
(65, 'CNTR-0913/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0913_63.pdf'),
(66, 'CNTR-0939/62', 'admin', '2021-07-16 09:00:47', 'CNTR-0939_62.pdf'),
(67, 'CNTR-0942/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0942_63.pdf'),
(68, 'CNTR-0946/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0946_63.pdf'),
(69, 'CNTR-0961/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0961_63.pdf'),
(70, 'CNTR-0966/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0966_63.pdf'),
(71, 'CNTR-0967/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0967_63.pdf'),
(72, 'CNTR-0969/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0969_63.pdf'),
(73, 'CNTR-0974/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0974_63.pdf'),
(74, 'CNTR-0976/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0976_63.pdf'),
(75, 'CNTR-0977/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0977_63.pdf'),
(76, 'CNTR-0987/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0987_63.pdf'),
(77, 'CNTR-0988/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0988_63.pdf'),
(78, 'CNTR-0989/63', 'admin', '2021-07-16 09:00:47', 'CNTR-0989_63.pdf'),
(79, 'CNTR-1009/62', 'admin', '2021-07-16 09:00:47', 'CNTR-1009_62.pdf'),
(80, 'CNTR-1022/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1022_63.pdf'),
(81, 'CNTR-1036/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1036_63.pdf'),
(82, 'CNTR-1042/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1042_63.pdf'),
(83, 'CNTR-1043/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1043_63.pdf'),
(84, 'CNTR-1044/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1044_63.pdf'),
(85, 'CNTR-1045/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1045_63.pdf'),
(86, 'CNTR-1083/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1083_63.pdf'),
(87, 'CNTR-1086/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1086_63.pdf'),
(88, 'CNTR-1087/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1087_63.pdf'),
(89, 'CNTR-1097/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1097_63.pdf'),
(90, 'CNTR-1106/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1106_63.pdf'),
(91, 'CNTR-1140/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1140_63.pdf'),
(92, 'CNTR-1142/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1142_63.pdf'),
(93, 'CNTR-1143/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1143_63.pdf'),
(94, 'CNTR-1144/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1144_63.pdf'),
(95, 'CNTR-1156/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1156_63.pdf'),
(96, 'CNTR-1161/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1161_63.pdf'),
(97, 'CNTR-1162/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1162_63.pdf'),
(98, 'CNTR-1164/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1164_63.pdf'),
(99, 'CNTR-1183/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1183_63.pdf'),
(100, 'CNTR-1186/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1186_63.pdf'),
(101, 'CNTR-1246/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1246_63.pdf'),
(102, 'CNTR-1261/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1261_63.pdf'),
(103, 'CNTR-1267/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1267_63.pdf'),
(104, 'CNTR-1268/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1268_63.pdf'),
(105, 'CNTR-1273/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1273_63.pdf'),
(106, 'CNTR-1276/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1276_63.pdf'),
(107, 'CNTR-1284/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1284_63.pdf'),
(108, 'CNTR-1285/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1285_63.pdf'),
(109, 'CNTR-1287/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1287_63.pdf'),
(110, 'CNTR-1288/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1288_63.pdf'),
(111, 'CNTR-1289/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1289_63.pdf'),
(112, 'CNTR-1294/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1294_63.pdf'),
(113, 'CNTR-1316/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1316_63.pdf'),
(114, 'CNTR-1326/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1326_63.pdf'),
(115, 'CNTR-1339/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1339_63.pdf'),
(116, 'CNTR-1374/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1374_63.pdf'),
(117, 'CNTR-1377/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1377_63.pdf'),
(118, 'CNTR-1382/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1382_63.pdf'),
(119, 'CNTR-1383/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1383_63.pdf'),
(120, 'CNTR-1391/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1391_63.pdf'),
(121, 'CNTR-1392/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1392_63.pdf'),
(122, 'CNTR-1444/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1444_63.pdf'),
(123, 'CNTR-1452/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1452_63.pdf'),
(124, 'CNTR-1460/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1460_63.pdf'),
(125, 'CNTR-1476/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1476_63.pdf'),
(126, 'CNTR-1479/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1479_63.pdf'),
(127, 'CNTR-1483/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1483_63.pdf'),
(128, 'CNTR-1487/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1487_63.pdf'),
(129, 'CNTR-1513/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1513_63.pdf'),
(130, 'CNTR-1515/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1515_63.pdf'),
(131, 'CNTR-1570/63', 'admin', '2021-07-16 09:00:47', 'CNTR-1570_63.pdf'),
(132, 'CNTR-1732/61', 'admin', '2021-07-16 09:00:47', 'CNTR-1732_61.pdf'),
(133, 'CNTR-1742/62', 'admin', '2021-07-16 09:00:47', 'CNTR-1742_62.pdf'),
(134, 'CNTR-1748/62', 'admin', '2021-07-16 09:00:47', 'CNTR-1748_62.pdf'),
(135, 'CNTR-1876/62', 'admin', '2021-07-16 09:00:47', 'CNTR-1876_62.pdf'),
(136, 'CNTR-1888/62', 'admin', '2021-07-16 09:00:47', 'CNTR-1888_62.pdf');

-- --------------------------------------------------------

--
-- Table structure for table `doc_mgr_command`
--

CREATE TABLE `doc_mgr_command` (
  `id` int(11) NOT NULL,
  `doc_id` varchar(255) NOT NULL,
  `doc_date` date NOT NULL,
  `doc_topic` varchar(255) NOT NULL,
  `mgr` varchar(255) NOT NULL,
  `user_upload` varchar(255) NOT NULL,
  `time_upload` datetime NOT NULL,
  `file_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `doc_mgr_command`
--

INSERT INTO `doc_mgr_command` (`id`, `doc_id`, `doc_date`, `doc_topic`, `mgr`, `user_upload`, `time_upload`, `file_name`) VALUES
(1, '199999', '2020-12-15', 'จบเกม', 'นายกเทศมนตรี', 'สุกัญญา รอดเมือง', '2021-12-30 14:12:16', 'สช_53603_4985.pdf'),
(2, 'TEST1', '2020-12-01', 'นานโน', 'thanong boonterm', 'สุกัญญา รอดเมือง', '2021-12-30 14:13:02', 'สช_53603_4981.pdf'),
(3, 'COVID command', '2020-12-07', 'ทีมฉีดพ่นยา Coron 2019', 'nayok', 'Thanong Boonterm', '2020-12-15 11:21:31', 'COVID_TEAM_5.pdf'),
(5, '3106', '2564-02-12', 'มาตรฐานกำหนดตำแหน่ง วิชาทางคอมพิวเตอร์', 'นายกเทศมนตรี', 'Thanong Boonterm', '2021-02-24 20:26:55', '3106 นักวิชาการคอมพิวเตอร์(ปฏิบัติการ-เชี่ยว.pdf'),
(8, 'N .011', '2564-05-04', 'test', 'nayok', 'Thanong Boonterm', '2021-05-03 11:55:41', '9 x 13 cm.pdf');

-- --------------------------------------------------------

--
-- Table structure for table `doc_recheck`
--

CREATE TABLE `doc_recheck` (
  `id` int(11) NOT NULL,
  `doc_year` varchar(12) NOT NULL,
  `doc_id` varchar(255) NOT NULL,
  `contract_id` varchar(255) NOT NULL,
  `file_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `doc_recheck`
--

INSERT INTO `doc_recheck` (`id`, `doc_year`, `doc_id`, `contract_id`, `file_name`) VALUES
(1, '2020', '586', 'CNTR-0586/63', '2020_0586_CNTR-0586_63.pdf'),
(2, '2020', '887', 'CNTR-0215/64', '2020_0887_CNTR-0215_64.pdf'),
(3, '2020', '888', 'CNTR-0216/64', '2020_0888_CNTR-0216_64.pdf'),
(4, '2020', '1419', 'CNTR-0234/64', '2020_1419_CNTR-0234_64.pdf'),
(5, '2020', '1713', 'CNTR-0409/63', '2020_1713_CNTR-0409_63.pdf'),
(6, '2020', '3532', 'CNTR-0967/63', '2020_3532_CNTR-0967_63.pdf'),
(7, '2020', '3733', 'CNTR-0946/63', '2020_3733_CNTR-0946_63.pdf'),
(8, '2020', '3734', 'CNTR-1022/63', '2020_3734_CNTR-1022_63.pdf'),
(9, '2020', '3735', 'CNTR-1036/63', '2020_3735_CNTR-1036_63.pdf'),
(10, '2020', '3736', 'CNTR-1042/63', '2020_3736_CNTR-1042_63.pdf'),
(11, '2020', '3737', 'CNTR-1045/63', '2020_3737_CNTR-1045_63.pdf'),
(12, '2020', '4177', 'CNTR-1106/63', '2020_4177_CNTR-1106_63.pdf'),
(13, '2020', '4178', 'CNTR-1140/63', '2020_4178_CNTR-1140_63.pdf'),
(14, '2020', '4179', 'CNTR-1142/63', '2020_4179_CNTR-1142_63.pdf'),
(15, '2020', '4180', 'CNTR-1143/63', '2020_4180_CNTR-1143_63.pdf'),
(16, '2020', '4181', 'CNTR-1144/63', '2020_4181_CNTR-1144_63.pdf'),
(17, '2020', '4182', 'CNTR-1156/63', '2020_4182_CNTR-1156_63.pdf'),
(18, '2020', '4183', 'CNTR-1161/63', '2020_4183_CNTR-1161_63.pdf'),
(19, '2020', '4184', 'CNTR-1162/63', '2020_4184_CNTR-1162_63.pdf'),
(20, '2020', '4278', 'CNTR-1254/61', '2020_4278_CNTR-1254_61.pdf'),
(21, '2020', '4279', 'CNTR-1168/61', '2020_4279_CNTR-1168_61.pdf'),
(22, '2020', '4280', 'CNTR-0191/63', '2020_4280_CNTR-0191_63.pdf'),
(23, '2020', '4281', 'CNTR-0189/63', '2020_4281_CNTR-0189_63.pdf'),
(24, '2020', '4282', 'CNTR-0354/63', '2020_4282_CNTR-0354_63.pdf'),
(25, '2020', '4283', 'CNTR-0521/63', '2020_4283_CNTR-0521_63.pdf'),
(26, '2020', '4284', 'CNTR-0355/63', '2020_4284_CNTR-0355_63.pdf'),
(27, '2020', '4313', 'CNTR-0352/63', '2020_4313_CNTR-0352_63.pdf'),
(28, '2020', '4314', 'CNTR-0528/63', '2020_4314_CNTR-0528_63.pdf'),
(29, '2020', '4315', 'CNTR-0529/63', '2020_4315_CNTR-0529_63.pdf'),
(30, '2020', '4316', 'CNTR-0531/63', '2020_4316_CNTR-0531_63.pdf'),
(31, '2020', '4317', 'CNTR-0585/63', '2020_4317_CNTR-0585_63.pdf'),
(32, '2020', '4319', 'CNTR-0610/63', '2020_4319_CNTR-0610_63.pdf'),
(33, '2020', '4320', 'CNTR-0572/63', '2020_4320_CNTR-0572_63.pdf'),
(34, '2020', '4321', 'CNTR-0598/63', '2020_4321_CNTR-0598_63.pdf'),
(35, '2020', '4420', 'CNTR-0776/63', '2020_4420_CNTR-0776_63.pdf'),
(36, '2020', '4421', 'CNTR-0778/63', '2020_4421_CNTR-0778_63.pdf'),
(37, '2020', '4422', 'CNTR-0777/63', '2020_4422_CNTR-0777_63.pdf'),
(38, '2020', '4423', 'CNTR-0772/63', '2020_4423_CNTR-0772_63.pdf'),
(39, '2020', '4424', 'CNTR-1254/63', '2020_4424_CNTR-1254_63.pdf'),
(40, '2020', '4425', 'CNTR-1253/63', '2020_4425_CNTR-1253_63.pdf'),
(41, '2020', '4426', 'CNTR-1458/63', '2020_4426_CNTR-1458_63.pdf'),
(42, '2020', '4427', 'CNTR-0573/62', '2020_4427_CNTR-0573_62.pdf'),
(43, '2020', '4429', 'CNTR-1526/62', '2020_4429_CNTR-1526_62.pdf'),
(44, '2020', '4430', 'CNTR-1579/61', '2020_4430_CNTR-1579_61.pdf'),
(45, '2020', '4494', 'CNTR-0839/63', '2020_4494_CNTR-0839_63.pdf'),
(46, '2020', '4495', 'CNTR-0842/63', '2020_4495_CNTR-0842_63.pdf'),
(47, '2020', '4496', 'CNTR-0843/63', '2020_4496_CNTR-0843_63.pdf'),
(48, '2020', '4497', 'CNTR-0841/63', '2020_4497_CNTR-0841_63.pdf'),
(49, '2020', '4498', 'CNTR-0924/63', '2020_4498_CNTR-0924_63.pdf'),
(50, '2020', '4499', 'CNTR-0925/63', '2020_4499_CNTR-0925_63.pdf'),
(51, '2020', '4500', 'CNTR-0923/63', '2020_4500_CNTR-0923_63.pdf'),
(52, '2020', '4501', 'CNTR-0838/63', '2020_4501_CNTR-0838_63.pdf'),
(53, '2020', '4502', 'CNTR-0729/63', '2020_4502_CNTR-0729_63.pdf'),
(54, '2020', '4503', 'CNTR-0557/63', '2020_4503_CNTR-0557_63.pdf'),
(55, '2020', '4504', 'CNTR-0555/63', '2020_4504_CNTR-0555_63.pdf'),
(56, '2020', '4505', 'CNTR-0556/63', '2020_4505_CNTR-0556_63.pdf'),
(57, '2020', '4506', 'CNTR-0358/63', '2020_4506_CNTR-0358_63.pdf'),
(58, '2020', '4507', 'CNTR-0357/63', '2020_4507_CNTR-0357_63.pdf'),
(59, '2020', '4508', 'CNTR-0359/63', '2020_4508_CNTR-0359_63.pdf'),
(60, '2020', '4509', 'CNTR-0986/63', '2020_4509_CNTR-0986_63.pdf'),
(61, '2020', '4510', 'CNTR-0481/63', '2020_4510_CNTR-0481_63.pdf'),
(62, '2020', '4511', 'CNTR-0623/63', '2020_4511_CNTR-0623_63.pdf'),
(63, '2020', '4512', 'CNTR-0624/63', '2020_4512_CNTR-0624_63.pdf'),
(64, '2020', '4514', 'CNTR-1605/62', '2020_4514_CNTR-1605_62.pdf'),
(65, '2020', '4706', 'CNTR-1097/63', '2020_4706_CNTR-1097_63.pdf'),
(66, '2020', '4707', 'CNTR-1183/63', '2020_4707_CNTR-1183_63.pdf'),
(67, '2020', '4708', 'CNTR-1483/63', '2020_4708_CNTR-1483_63.pdf'),
(68, '2020', '4709', 'CNTR-1186/63', '2020_4709_CNTR-1186_63.pdf'),
(69, '2020', '4710', 'CNTR-1748/62', '2020_4710_CNTR-1748_62.pdf'),
(70, '2020', '8216', 'CNTR-1742/62', '2020_8216_CNTR-1742_62.pdf'),
(71, '2020', '8217', 'CNTR-1782/62', '2020_8217_CNTR-1782_62.pdf'),
(72, '2020', '8218', 'CNTR-1845/62', '2020_8218_CNTR-1845_62.pdf'),
(73, '2020', '8219', 'CNTR-1810/62', '2020_8219_CNTR-1810_62.pdf'),
(74, '2020', '8230', 'CNTR-1135/62', '2020_8230_CNTR-1135_62.pdf'),
(75, '2020', '8231', 'CNTR-1949/61', '2020_8231_CNTR-1949_61.pdf'),
(76, '2020', '8232', 'CNTR-1581/62', '2020_8232_CNTR-1581_62.pdf'),
(77, '2020', '8233', 'CNTR-1583/62', '2020_8233_CNTR-1583_62.pdf'),
(78, '2020', '8256', 'CNTR-1517/60', '2020_8256_CNTR-1517_60.pdf'),
(79, '2020', '8257', 'CNTR-1590/61', '2020_8257_CNTR-1590_61.pdf'),
(80, '2020', '8258', 'CNTR-0892/59', '2020_8258_CNTR-0892_59.pdf'),
(81, '2020', '8259', 'CNTR-0105/59', '2020_8259_CNTR-0105_59.pdf'),
(82, '2020', '8260', 'CNTR-1412/59', '2020_8260_CNTR-1412_59.pdf'),
(83, '2020', '8299', 'CNTR-0872/60', '2020_8299_CNTR-0872_60.pdf'),
(84, '2020', '8300', 'CNTR-0883/60', '2020_8300_CNTR-0883_60.pdf'),
(85, '2020', '8301', 'CNTR-1065/60', '2020_8301_CNTR-1065_60.pdf'),
(86, '2020', '8306', 'CNTR-1178/60', '2020_8306_CNTR-1178_60.pdf'),
(87, '2020', '8308', 'CNTR-1446/60', '2020_8308_CNTR-1446_60.pdf'),
(88, '2020', '8353', 'CNTR-0228/61', '2020_8353_CNTR-0228_61.pdf'),
(89, '2020', '8354', 'CNTR-1465/60', '2020_8354_CNTR-1465_60.pdf'),
(90, '2020', '8355', 'CNTR-1467/60', '2020_8355_CNTR-1467_60.pdf'),
(91, '2020', '8356', 'CNTR-1472/60', '2020_8356_CNTR-1472_60.pdf'),
(92, '2020', '8358', 'CNTR-1561/60', '2020_8358_CNTR-1561_60.pdf'),
(93, '2020', '8380', 'CNTR-1168/61', '2020_8380_CNTR-1168_61.pdf'),
(94, '2020', '8381', 'CNTR-1254/61', '2020_8381_CNTR-1254_61.pdf'),
(95, '2020', '8384', 'CNTR-1489/61', '2020_8384_CNTR-1489_61.pdf'),
(96, '2020', '8400', 'CNTR-1690/61', '2020_8400_CNTR-1690_61.pdf'),
(97, '2020', '8401', 'CNTR-1750/61', '2020_8401_CNTR-1750_61.pdf'),
(98, '2020', '8403', 'CNTR-1772/61', '2020_8403_CNTR-1772_61.pdf'),
(99, '2020', '8404', 'CNTR-1819/61', '2020_8404_CNTR-1819_61.pdf'),
(100, '2020', '8405', 'CNTR-1820/61', '2020_8405_CNTR-1820_61.pdf'),
(101, '2020', '8408', 'CNTR-1915/61', '2020_8408_CNTR-1915_61.pdf'),
(102, '2020', '8426', 'CNTR-1949/61', '2020_8426_CNTR-1949_61.pdf'),
(103, '2020', '8427', 'CNTR-1988/61', '2020_8427_CNTR-1988_61.pdf'),
(104, '2020', '8428', 'CNTR-2025/61', '2020_8428_CNTR-2025_61.pdf'),
(105, '2020', '8430', 'CNTR-2037/61', '2020_8430_CNTR-2037_61.pdf'),
(106, '2020', '8431', 'CNTR-2046/61', '2020_8431_CNTR-2046_61.pdf'),
(107, '2020', '8432', 'CNTR-2056/61', '2020_8432_CNTR-2056_61.pdf'),
(108, '2020', '8433', 'CNTR-2064/61', '2020_8433_CNTR-2064_61.pdf'),
(109, '2020', '8434', 'CNTR-0018/62', '2020_8434_CNTR-0018_62.pdf'),
(110, '2020', '8501', 'CNTR-1590/61', '2020_8501_CNTR-1590_61.pdf'),
(111, '2020', '8502', 'CNTR-1424/60', '2020_8502_CNTR-1424_60.pdf'),
(112, '2020', '8752', 'CNTR-1267/63', '2020_8752_CNTR-1267_63.pdf'),
(113, '2020', '8753', 'CNTR-1268/63', '2020_8753_CNTR-1268_63.pdf'),
(114, '2020', '8754', 'CNTR-1287/63', '2020_8754_CNTR-1287_63.pdf'),
(115, '2020', '8755', 'CNTR-1288/63', '2020_8755_CNTR-1288_63.pdf'),
(116, '2020', '8756', 'CNTR-1289/63', '2020_8756_CNTR-1289_63.pdf'),
(117, '2020', '8757', 'CNTR-1284/63', '2020_8757_CNTR-1284_63.pdf'),
(118, '2020', '8758', 'CNTR-1285/63', '2020_8758_CNTR-1285_63.pdf'),
(119, '2020', '8759', 'CNTR-1316/63', '2020_8759_CNTR-1316_63.pdf'),
(120, '2020', '8760', 'CNTR-1276/63', '2020_8760_CNTR-1276_63.pdf'),
(121, '2020', '8761', 'CNTR-1326/63', '2020_8761_CNTR-1326_63.pdf'),
(122, '2020', '8762', 'CNTR-1273/63', '2020_8762_CNTR-1273_63.pdf'),
(123, '2020', '8763', 'CNTR-1374/63', '2020_8763_CNTR-1374_63.pdf'),
(124, '2020', '8764', 'CNTR-1377/63', '2020_8764_CNTR-1377_63.pdf'),
(125, '2020', '8765', 'CNTR-1382/63', '2020_8765_CNTR-1382_63.pdf'),
(126, '2020', '8766', 'CNTR-1383/63', '2020_8766_CNTR-1383_63.pdf'),
(127, '2020', '8767', 'CNTR-1391/63', '2020_8767_CNTR-1391_63.pdf'),
(128, '2020', '8768', 'CNTR-1392/63', '2020_8768_CNTR-1392_63.pdf'),
(129, '2020', '8769', 'CNTR-1444/63', '2020_8769_CNTR-1444_63.pdf'),
(130, '2020', '8770', 'CNTR-1638/63', '2020_8770_CNTR-1638_63.pdf'),
(131, '2020', '8839', 'CNTR-1750/61', '2020_8839_CNTR-1750_61.pdf'),
(132, '2020', '8840', 'CNTR-1819/61', '2020_8840_CNTR-1819_61.pdf'),
(133, '2020', '8841', 'CNTR-1807/62', '2020_8841_CNTR-1807_62.pdf'),
(134, '2020', '8842', 'CNTR-1806/62', '2020_8842_CNTR-1806_62.pdf'),
(135, '2020', '8843', 'CNTR-1276/63', '2020_8843_CNTR-1276_63.pdf'),
(136, '2020', '8844', 'CNTR-1318/62', '2020_8844_CNTR-1318_62.pdf'),
(137, '2020', '8845', 'CNTR-1711/62', '2020_8845_CNTR-1711_62.pdf'),
(138, '2020', '8846', 'CNTR-1876/62', '2020_8846_CNTR-1876_62.pdf'),
(139, '2020', '8847', 'CNTR-0525/62', '2020_8847_CNTR-0525_62.pdf'),
(140, '2020', '8851', 'CNTR-1391/63', '2020_8851_CNTR-1391_63.pdf'),
(141, '2020', '8852', 'CNTR-1385/63', '2020_8852_CNTR-1385_63.pdf'),
(142, '2020', '8886', 'CNTR-1105/63', '2020_8886_CNTR-1105_63.pdf'),
(143, '2020', '8887', 'CNTR-0664/63', '2020_8887_CNTR-0664_63.pdf'),
(144, '2020', '8888', 'CNTR-0786/63', '2020_8888_CNTR-0786_63.pdf'),
(145, '2020', '8889', 'CNTR-0663/63', '2020_8889_CNTR-0663_63.pdf'),
(146, '2020', '8890', 'CNTR-0200/63', '2020_8890_CNTR-0200_63.pdf'),
(147, '2020', '8891', 'CNTR-0520/63', '2020_8891_CNTR-0520_63.pdf'),
(148, '2020', '9143', 'CNTR-0100/63', '2020_9143_CNTR-0100_63.pdf'),
(149, '2020', '9144', 'CNTR-0083/63', '2020_9144_CNTR-0083_63.pdf'),
(150, '2020', '9145', 'CNTR-0272/63', '2020_9145_CNTR-0272_63.pdf'),
(151, '2020', '9146', 'CNTR-0274/63', '2020_9146_CNTR-0274_63.pdf'),
(152, '2020', '9147', 'CNTR-0184/63', '2020_9147_CNTR-0184_63.pdf'),
(153, '2020', '9148', 'CNTR-0122/63', '2020_9148_CNTR-0122_63.pdf'),
(154, '2020', '9181', 'CNTR-1783/61', '2020_9181_CNTR-1783_61.pdf'),
(155, '2020', '9182', 'CNTR-0600/62', '2020_9182_CNTR-0600_62.pdf'),
(156, '2020', '9184', 'CNTR-0573/63', '2020_9184_CNTR-0573_63.pdf'),
(157, '2020', '9186', 'CNTR-1106/63', '2020_9186_CNTR-1106_63.pdf'),
(158, '2020', '9188', 'CNTR-1186/63', '2020_9188_CNTR-1186_63.pdf'),
(159, '2020', '9189', 'CNTR-1571/63', '2020_9189_CNTR-1571_63.pdf'),
(160, '2020', '9190', 'CNTR-1572/63', '2020_9190_CNTR-1572_63.pdf'),
(161, '2020', '9191', 'CNTR-1580/63', '2020_9191_CNTR-1580_63.pdf'),
(162, '2020', '9212', 'CNTR-1460/63', '2020_9212_CNTR-1460_63.pdf'),
(163, '2020', '9213', 'CNTR-1476/63', '2020_9213_CNTR-1476_63.pdf'),
(164, '2020', '9214', 'CNTR-1487/63', '2020_9214_CNTR-1487_63.pdf'),
(165, '2020', '9215', 'CNTR-1494/63', '2020_9215_CNTR-1494_63.pdf'),
(166, '2020', '9216', 'CNTR-1495/63', '2020_9216_CNTR-1495_63.pdf'),
(167, '2020', '9217', 'CNTR-1513/63', '2020_9217_CNTR-1513_63.pdf'),
(168, '2020', '9218', 'CNTR-1514/63', '2020_9218_CNTR-1514_63.pdf'),
(169, '2020', '9219', 'CNTR-1522/63', '2020_9219_CNTR-1522_63.pdf'),
(170, '2020', '9220', 'CNTR-1479/63', '2020_9220_CNTR-1479_63.pdf'),
(171, '2020', '9221', 'CNTR-1579/63', '2020_9221_CNTR-1579_63.pdf'),
(172, '2021', '166', 'CNTR-0200/64', '2021_0166_CNTR-0200_64.pdf'),
(173, '2021', '167', 'CNTR-0319/64', '2021_0167_CNTR-0319_64.pdf'),
(174, '2021', '223', 'CNTR-1901/61', '2021_0223_CNTR-1901_61.pdf'),
(175, '2021', '223', 'CNTR-2045/61', '2021_0223_CNTR-2045_61.pdf'),
(176, '2021', '224', 'CNTR-2048/61', '2021_0224_CNTR-2048_61.pdf'),
(177, '2021', '226', 'CNTR-0083/63', '2021_0226_CNTR-0083_63.pdf'),
(178, '2021', '227', 'CNTR-0100/63', '2021_0227_CNTR-0100_63.pdf'),
(179, '2021', '228', 'CNTR-0122/63', '2021_0228_CNTR-0122_63.pdf'),
(180, '2021', '229', 'CNTR-0209/63', '2021_0229_CNTR-0209_63.pdf'),
(181, '2021', '306', 'CNTR-1039/60', '2021_0306_CNTR-1039_60.pdf'),
(182, '2021', '412', 'CNTR-0069/63', '2021_0412_CNTR-0069_63.pdf'),
(183, '2021', '415', 'CNTR-1742/62', '2021_0415_CNTR-1742_62.pdf'),
(184, '2021', '416', 'CNTR-1568/63', '2021_0416_CNTR-1568_63.pdf'),
(185, '2021', '417', 'CNTR-0060/64', '2021_0417_CNTR-0060_64.pdf'),
(186, '2021', '418', 'CNTR-0061/64', '2021_0418_CNTR-0061_64.pdf'),
(187, '2021', '419', 'CNTR-0086/64', '2021_0419_CNTR-0086_64.pdf'),
(188, '2021', '551', 'CNTR-1681/62', '2021_0551_CNTR-1681_62.pdf'),
(189, '2021', '552', 'CNTR-1809/62', '2021_0552_CNTR-1809_62.pdf'),
(190, '2021', '553', 'CNTR-1817/62', '2021_0553_CNTR-1817_62.pdf'),
(191, '2021', '554', 'CNTR-1818/62', '2021_0554_CNTR-1818_62.pdf'),
(192, '2021', '555', 'CNTR-1844/62', '2021_0555_CNTR-1844_62.pdf'),
(193, '2021', '556', 'CNTR-1888/62', '2021_0556_CNTR-1888_62.pdf'),
(194, '2021', '557', 'CNTR-1889/62', '2021_0557_CNTR-1889_62.pdf'),
(195, '2021', '558', 'CNTR-1892/62', '2021_0558_CNTR-1892_62.pdf'),
(196, '2021', '559', 'CNTR-0232/63', '2021_0559_CNTR-0232_63.pdf'),
(197, '2021', '560', 'CNTR-0264/63', '2021_0560_CNTR-0264_63.pdf'),
(198, '2021', '561', 'CNTR-0397/63', '2021_0561_CNTR-0397_63.pdf'),
(199, '2021', '793', 'CNTR-0072/64', '2021_0793_CNTR-0072_64.pdf'),
(200, '2021', '794', 'CNTR-0360/64', '2021_0794_CNTR-0360_64.pdf'),
(201, '2021', '795', 'CNTR-0147/64', '2021_0795_CNTR-0147_64.pdf'),
(202, '2021', '808', 'CNTR-1932/61', '2021_0808_CNTR-1932_61.pdf'),
(203, '2021', '809', 'CNTR-0276/60', '2021_0809_CNTR-0276_60.pdf'),
(204, '2021', '810', 'CNTR-0274/60', '2021_0810_CNTR-0274_60.pdf'),
(205, '2021', '811', 'CNTR-1728/61', '2021_0811_CNTR-1728_61.pdf'),
(206, '2021', '812', 'CNTR-1163/61', '2021_0812_CNTR-1163_61.pdf'),
(207, '2021', '813', 'CNTR-0782/61', '2021_0813_CNTR-0782_61.pdf'),
(208, '2021', '814', 'CNTR-1611/61', '2021_0814_CNTR-1611_61.pdf'),
(209, '2021', '882', 'CNTR-0939/62', '2021_0882_CNTR-0939_62.pdf'),
(210, '2021', '883', 'CNTR-1161/63', '2021_0883_CNTR-1161_63.pdf'),
(211, '2021', '884', 'CNTR-1515/63', '2021_0884_CNTR-1515_63.pdf'),
(212, '2021', '885', 'CNTR-1569/63', '2021_0885_CNTR-1569_63.pdf'),
(213, '2021', '886', 'CNTR-1570/63', '2021_0886_CNTR-1570_63.pdf'),
(214, '2021', '889', 'CNTR-0223/64', '2021_0889_CNTR-0223_64.pdf'),
(215, '2021', '1112', 'CNTR-1227/63', '2021_1112_CNTR-1227_63.pdf'),
(216, '2021', '1113', 'CNTR-1378/63', '2021_1113_CNTR-1378_63.pdf'),
(217, '2021', '1114', 'CNTR-1445/63', '2021_1114_CNTR-1445_63.pdf'),
(218, '2021', '1115', 'CNTR-1446/63', '2021_1115_CNTR-1446_63.pdf'),
(219, '2021', '1116', 'CNTR-1461/63', '2021_1116_CNTR-1461_63.pdf'),
(220, '2021', '1117', 'CNTR-1463/63', '2021_1117_CNTR-1463_63.pdf'),
(221, '2021', '1118', 'CNTR-1464/63', '2021_1118_CNTR-1464_63.pdf'),
(222, '2021', '1119', 'CNTR-0122/64', '2021_1119_CNTR-0122_64.pdf'),
(223, '2021', '1120', 'CNTR-0123/64', '2021_1120_CNTR-0123_64.pdf'),
(224, '2021', '1121', 'CNTR-0124/64', '2021_1121_CNTR-0124_64.pdf'),
(225, '2021', '1122', 'CNTR-0171/64', '2021_1122_CNTR-0171_64.pdf'),
(226, '2021', '1348', 'CNTR-1888/62', '2021_1348_CNTR-1888_62.pdf'),
(227, '2021', '1349', 'CNTR-0550/63', '2021_1349_CNTR-0550_63.pdf'),
(228, '2021', '1350', 'CNTR-0890/63', '2021_1350_CNTR-0890_63.pdf'),
(229, '2021', '1351', 'CNTR-0744/63', '2021_1351_CNTR-0744_63.pdf'),
(230, '2021', '1352', 'CNTR-0504/63', '2021_1352_CNTR-0504_63.pdf'),
(231, '2021', '1353', 'CNTR-0407/63', '2021_1353_CNTR-0407_63.pdf'),
(232, '2021', '1418', 'CNTR-0056/64', '2021_1418_CNTR-0056_64.pdf'),
(233, '2021', '1419', 'CNTR-0234/64', '2021_1419_CNTR-0234_64.pdf'),
(234, '2021', '1420', 'CNTR-0283/64', '2021_1420_CNTR-0283_64.pdf'),
(235, '2021', '1421', 'CNTR-0302/64', '2021_1421_CNTR-0302_64.pdf'),
(236, '2021', '1422', 'CNTR-0303/64', '2021_1422_CNTR-0303_64.pdf'),
(237, '2021', '1423', 'CNTR-0341/64', '2021_1423_CNTR-0341_64.pdf'),
(238, '2021', '1504', 'CNTR-0775/63', '2021_1504_CNTR-0775_63.pdf'),
(239, '2021', '1636', 'CNTR-0575/64', '2021_1636_CNTR-0575_64.pdf'),
(240, '2021', '1637', 'CNTR-0583/64', '2021_1637_CNTR-0583_64.pdf'),
(241, '2021', '1638', 'CNTR-0591/64', '2021_1638_CNTR-0591_64.pdf'),
(242, '2021', '1639', 'CNTR-0592/64', '2021_1639_CNTR-0592_64.pdf'),
(243, '2021', '1640', 'CNTR-0594/64', '2021_1640_CNTR-0594_64.pdf'),
(244, '2021', '1713', 'CNTR-0409/63', '2021_1713_CNTR-0409_63.pdf'),
(245, '2021', '1750', 'CNTR-0650/64', '2021_1750_CNTR-0650_64.pdf'),
(246, '2021', '1751', 'CNTR-0651/64', '2021_1751_CNTR-0651_64.pdf'),
(247, '2021', '1752', 'CNTR-0652/64', '2021_1752_CNTR-0652_64.pdf'),
(248, '2021', '1753', 'CNTR-0660/64', '2021_1753_CNTR-0660_64.pdf'),
(249, '2021', '1754', 'CNTR-0663/64', '2021_1754_CNTR-0663_64.pdf'),
(250, '2021', '1755', 'CNTR-0675/64', '2021_1755_CNTR-0675_64.pdf'),
(251, '2021', '1756', 'CNTR-0676/64', '2021_1756_CNTR-0676_64.pdf'),
(252, '2021', '1757', 'CNTR-0677/64', '2021_1757_CNTR-0677_64.pdf'),
(253, '2021', '1766', 'CNTR-2048/61', '2021_1766_CNTR-2048_61.pdf'),
(254, '2021', '1767', 'CNTR-2045/61', '2021_1767_CNTR-2045_61.pdf'),
(255, '2021', '1768', 'CNTR-0511/62', '2021_1768_CNTR-0511_62.pdf'),
(256, '2021', '1857', 'CNTR-0590/64', '2021_1857_CNTR-0590_64.pdf'),
(257, '2021', '1858', 'CNTR-0611/64', '2021_1858_CNTR-0611_64.pdf'),
(258, '2021', '1859', 'CNTR-0623/64', '2021_1859_CNTR-0623_64.pdf'),
(259, '2021', '1860', 'CNTR-0638/64', '2021_1860_CNTR-0638_64.pdf'),
(260, '2021', '1861', 'CNTR-0639/64', '2021_1861_CNTR-0639_64.pdf'),
(261, '2021', '1862', 'CNTR-0662/64', '2021_1862_CNTR-0662_64.pdf'),
(262, '2021', '1868', 'CNTR-0702/64', '2021_1868_CNTR-0702_64.pdf'),
(263, '2021', '1869', 'CNTR-0704/64', '2021_1869_CNTR-0704_64.pdf'),
(264, '2021', '1870', 'CNTR-0724/64', '2021_1870_CNTR-0724_64.pdf'),
(265, '2021', '1871', 'CNTR-0736/64', '2021_1871_CNTR-0736_64.pdf'),
(266, '2021', '1873', 'CNTR-0746/64', '2021_1873_CNTR-0746_64.pdf'),
(267, '2021', '1874', 'CNTR-1086/63', '2021_1874_CNTR-1086_63.pdf'),
(268, '2021', '1876', 'CNTR-0738/64', '2021_1876_CNTR-0738_64.pdf'),
(269, '2021', '1943', 'CNTR-0404/64', '2021_1943_CNTR-0404_64.pdf'),
(270, '2021', '1944', 'CNTR-0527/64', '2021_1944_CNTR-0527_64.pdf'),
(271, '2021', '1945', 'CNTR-0576/64', '2021_1945_CNTR-0576_64.pdf'),
(272, '2021', '1946', 'CNTR-0597/64', '2021_1946_CNTR-0597_64.pdf'),
(273, '2021', '1947', 'CNTR-0649/64', '2021_1947_CNTR-0649_64.pdf'),
(274, '2020', '8252', 'CNTR-0970/61', '2020_8252_CNTR-0970_61.pdf');

-- --------------------------------------------------------

--
-- Table structure for table `doc_regulation`
--

CREATE TABLE `doc_regulation` (
  `id` int(11) NOT NULL,
  `doc_id` varchar(255) NOT NULL,
  `doc_topic` varchar(255) NOT NULL,
  `doc_description` varchar(255) NOT NULL,
  `user_upload` varchar(255) NOT NULL,
  `date_upload` datetime NOT NULL,
  `file_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `doc_regulation`
--

INSERT INTO `doc_regulation` (`id`, `doc_id`, `doc_topic`, `doc_description`, `user_upload`, `date_upload`, `file_name`) VALUES
(1, 'สค1234', 'ประสิทธิภาพการใช้หลอด led', 'ตัวอย่างการเขียนบทคัดย่อ', 'Thanong Boonterm', '2020-12-14 15:48:02', '104-330-1-PB.pdf'),
(2, 'NA', 'โครงการนำร่องเพื่อผลิตพลังงานทดแทนจากชีวมวลในระดับชุมชน', 'โครงการนำร่องเพื่อผลิตพลังงานทดแทนจากชีวมวลในระดับชุมชน', 'ทนงค์ บุญเติม', '2020-12-14 16:10:40', '30-File1.pdf'),
(6, '1222', 'ประกาศ สบค', 'การ', 'ทนงค์ บุญเติม', '2021-12-29 16:19:43', 'ประกาศองค์การบริหารส่วนจั.pdf');

-- --------------------------------------------------------

--
-- Table structure for table `engineering_staff`
--

CREATE TABLE `engineering_staff` (
  `id` int(11) NOT NULL,
  `FirstName` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `LastName` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `Position` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `E-mail` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `Organization` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `engineering_staff`
--

INSERT INTO `engineering_staff` (`id`, `FirstName`, `LastName`, `Position`, `E-mail`, `Organization`) VALUES
(1, 'ว่าที่ ร.ต. ชาญวุฒิ', ' บำเทิงเวชช์', 'ผู้อำนวยการสำนักการช่าง', 'publicworks@hotmail.com', 'สำนักการช่าง'),
(2, 'นายวิรัตน์', 'จำเรียง', 'ผอ.ส่วนควบคุมการก่อสร้างฯ', 'wirat.j2507@gmail.com', 'สำนักการช่าง'),
(3, 'นายอนน', 'จันทร์เสม', 'รก.ผอ.ส่วนการโยธาฯ', 'anon8984@gmail.com', 'สำนักการช่าง'),
(4, 'นายอาทิตย์', 'พรหมฤทธิ์', 'รก.หน.ฝ่ายบริหารงานทั่วไป', 'athity5588@gmail.com', 'สำนักการช่าง'),
(5, 'นายโกวิทย์', 'อักขราสา', 'หน.ฝ่ายควบคุมการก่อสร้างฯ', 'koburi.ko.ko@gmail.com', 'สำนักการช่าง'),
(6, 'นายเรืองฤทธิ์', 'ไม้เรือนงาม', 'หน.ฝ่ายควบคุมอาคารฯ', 'surveydivision76@gamail.com', 'สำนักการช่าง'),
(7, 'นายภาณุพงษ์', 'หมีขยัน', 'รก.หน.ฝ่ายสาธารณูปโภค', 'meekayun060119@gmail.com', 'สำนักการช่าง'),
(8, 'นางสุรีรัตน์', 'ชินรัตน์', 'เจ้าพนักงานธุรการชำนาญงาน', '21sureerat@gmail.com', 'สำนักการช่าง'),
(9, 'นายขจร', 'กระจ่าง', 'นายช่างไฟฟ้าอาวุโส', '0840809471.aa@gmail.com', 'สำนักการช่าง'),
(10, 'นายธีรภัทร์', 'นิเวศรัตน์', 'นายช่างเครื่องกลชำนาญงาน', 'pong11102560@gmail.com', 'สำนักการช่าง'),
(11, 'นายเสรี', 'กาญจนพงษ์พร', 'นายช่างไฟฟ้าอาวุโส', 'seree.k2563@gmail.com', 'สำนักการช่าง'),
(12, 'นายไพรัช', 'สินชูวงศ์', 'นักผังเมืองปฏิบัติการ', 'paihaigai@hotmail.com', 'สำนักการช่าง'),
(13, 'นายจรูญ', 'คำมาบุตร', 'นายช่างเครื่องกลปฏิบัติงาน', 'kammabut2521@gmail.com', 'สำนักการช่าง'),
(14, 'นายชัยชาญ', 'โอสถจันทร์', 'นายช่างเครื่องกลชำนาญงาน', 'caichan830@gmail.com', 'สำนักการช่าง'),
(15, 'น.ส.อาภรณ์', 'สนแก้ว', 'นักจัดการงานทั่วไปปฏิบัติการ', 'nokmanu@hotmail.com', 'สำนักการช่าง'),
(16, 'นายสหวัฒน์', 'ศรศักดิ์', 'นายช่างโยธาชำนาญงาน', 'sahavut1965@gmail.com', 'สำนักการช่าง'),
(17, 'นายวงศกร', 'อุดมโภชน์', 'สถาปนิกชำนาญการ', 'wongsakorn1975@icoud.com', 'สำนักการช่าง'),
(18, 'นายปิยวัฒน์', 'พงษ์เขมรัชต์', 'สถาปนิกปฏิบัติการ', 'tata2622@hotmail.com', 'สำนักการช่าง'),
(19, 'นายธนทรัพย์', 'ประสมทรัพย์', 'เจ้าพนักงานธุรการชำนาญงาน', 'thanasup1978@gmail.com', 'สำนักการช่าง'),
(20, 'นายสุระพงษ์', 'รอดชีวะ', 'นักจัดการงานทั่วไป', 'surapong2530@hotmail.com', 'สำนักการช่าง'),
(21, 'นายทนงค์', 'บุญเติม', 'นักวิชาการคอมพิวเตอร์ปฏิบัติการ', 'thanongb42@gmail.com', 'สำนักการช่าง'),
(22, 'นายกิตติพงศ์', 'คำจินดา', 'นายช่างศิลป์ปฏิบัติงาน', 'mooartrangsit@gmail.com', 'สำนักการช่าง'),
(23, 'น.ส.ภวันตรี', 'กันทะปิง', 'ผช.นักจัดการงานทั่วไป', 'r61.form.ann.1790@gmail.com', 'สำนักการช่าง'),
(24, 'น.ส.ปรียาภรณ์', 'เขียวเปี่ยม', 'ผช.นักจัดการงานทั่วไป', 'kukkik153226300@gmail.com', 'สำนักการช่าง'),
(25, 'น.ส.พรจันทร์', 'เอี่ยมพิทักษ์', 'ผช.นักจัดการงานทั่วไป', 'phonchan.2172512@gmail.com', 'สำนักการช่าง'),
(26, 'นายดิเรก', 'ดวงเพ็ชร์', 'ผช.นักวิชาการคอมพิวเตอร์', 'dungphectd@gmail.com', 'สำนักการช่าง'),
(27, 'นายสุเมธ', 'ประวันจะ', 'ผช.ช่างโยธาฯ', 'sumetcon@gmail.com', 'สำนักการช่าง'),
(28, 'น.ส.สุกัญญา', 'รอดเมือง', 'คนงานทั่วไป', 'aumaimaa18@gmail.com', 'สำนักการช่าง'),
(29, 'นายกิตติคุณ', 'เตียยะบุตร', 'คนงานทั่วไป', 'bwwdoc@hotmail.com', 'สำนักการช่าง'),
(30, 'นายปภพ', 'กุลฉันท์วิทย์', 'คนงานทั่วไป', 'papop_za@hotmail.com', 'สำนักการช่าง');

-- --------------------------------------------------------

--
-- Table structure for table `event_log`
--

CREATE TABLE `event_log` (
  `id` int(11) NOT NULL,
  `user_id` varchar(10) NOT NULL,
  `event` varchar(100) NOT NULL,
  `messege` text NOT NULL,
  `event_time` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `event_log`
--

INSERT INTO `event_log` (`id`, `user_id`, `event`, `messege`, `event_time`) VALUES
(1, 'ทนงค์', 'ADD', 'เรื่องร้องเรียน ร้องทุกข์  เรื่อง :[object Object]', '2021-12-29 08:56:06'),
(2, 'ทนงค์', 'ADD', 'เรื่องร้องเรียน ร้องทุกข์  เรื่อง :zsfvzsv', '2021-12-29 08:59:02'),
(3, 'ทนงค์', 'ADD', 'เรื่องร้องเรียน ร้องทุกข์  เรื่อง :ไฟดับ', '2021-12-29 09:02:53'),
(4, 'ทนงค์', 'ADD', 'เรื่องร้องเรียน ร้องทุกข์  เรื่อง :ftyjhrtfyj', '2021-12-29 09:04:56'),
(5, 'ทนงค์', 'DELETE', 'เรื่องร้องเรียน ร้องทุกข์  เรื่อง :ftyjhrtfyj', '2021-12-29 09:05:30'),
(6, 'ทนงค์', 'LOGOUT', '', '2021-12-29 09:07:07'),
(7, 'ทนงค์', 'LOGIN', '', '2021-12-29 09:07:33'),
(8, 'ทนงค์', 'เข้าmenuUserManager', '', '2021-12-29 09:07:56'),
(9, 'ทนงค์', 'เข้า-menu', 'DocAcceptList', '2021-12-29 09:09:35'),
(10, 'ทนงค์', 'เข้า-menu', 'InternalMemoList', '2021-12-29 09:09:38'),
(11, 'ทนงค์', 'เข้า-menu', 'ExpireList', '2021-12-29 09:09:43'),
(12, 'ทนงค์', 'ADD', 'เรื่องร้องเรียน ร้องทุกข์  เรื่อง :undefined', '2021-12-29 09:23:08'),
(13, 'ทนงค์', 'ADD', 'ระเบียบคำสั่ง  เรื่อง :ฟไดำฟไำด', '2021-12-29 09:24:27'),
(14, 'ทนงค์', 'DELETE ระเบียบคำสั่ง ฟไดำฟไำด', '', '2021-12-29 09:25:26'),
(15, 'ทนงค์', 'DELETE', 'ระเบียบคำสั่ง สปร 5', '2021-12-29 09:25:59'),
(16, 'ทนงค์', 'DELETE', 'หนังสือขาออก เรื่อง :TEST', '2021-12-29 09:31:34'),
(17, 'ทนงค์', 'DELETE', 'หนังสือขาเข้า เรื่อง :ระดับน้ำ', '2021-12-29 09:31:59'),
(18, 'ทนงค์', 'LOGOUT', '', '2021-12-29 09:34:20'),
(19, 'สุกัญญา', 'LOGIN', '', '2021-12-29 09:34:34'),
(20, 'สุกัญญา', 'LOGOUT', '', '2021-12-29 09:34:45'),
(21, 'ทนงค์', 'LOGIN', '', '2021-12-30 02:51:23'),
(22, 'ทนงค์', 'เข้า-menu', 'UserManager', '2021-12-30 02:51:43'),
(23, 'ทนงค์', 'เข้า-menu', 'DocumentOfficialOutList', '2021-12-30 02:57:24'),
(24, 'ทนงค์', 'Click-menu', 'DocumentOfficialOutList', '2021-12-30 02:58:28'),
(25, 'ทนงค์', 'Click-menu', 'DocumentOfficialInList', '2021-12-30 02:58:31'),
(26, 'ทนงค์ บุญเ', 'Click-menu', 'DocumentOfficialOutList', '2021-12-30 03:00:48'),
(27, 'ทนงค์ บุญเ', 'Click-menu', 'DocumentOfficialInList', '2021-12-30 03:00:49'),
(28, 'ทนงค์', 'LOGOUT', '', '2021-12-30 03:04:19'),
(29, 'ทนงค์', 'LOGIN', '', '2021-12-30 03:04:21'),
(30, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2021-12-30 03:04:47'),
(31, 'admin', 'Click-menu', 'DocumentOfficialInList', '2021-12-30 03:04:49'),
(32, 'ทนงค์', 'LOGOUT', '', '2021-12-30 03:19:50'),
(33, 'ทนงค์', 'LOGIN', '', '2021-12-30 03:19:57'),
(34, 'admin', 'เข้า-menu', 'UserManager', '2021-12-30 03:20:00'),
(35, 'admin', 'Update', 'เรื่องร้องเรียน ร้องทุกข์  เรื่อง :ท่อระบายน้ำอุดตัน', '2021-12-30 03:25:41'),
(36, 'admin', 'Update', 'เรื่องร้องเรียน ร้องทุกข์  เรื่อง :ท่อระบายน้ำอุดตัน และน้ำเจิ่งนอง', '2021-12-30 03:27:02'),
(37, 'admin', 'Click-menu', 'DocMgrList', '2021-12-30 06:38:06'),
(38, 'admin', 'Click-menu', 'ComplianList', '2021-12-30 06:38:08'),
(39, 'admin', 'Click-menu', 'RegulationList', '2021-12-30 06:38:09'),
(40, 'admin', 'Click-menu', 'Asset-System', '2021-12-30 06:38:10'),
(41, 'admin', 'Click-menu', 'Information', '2021-12-30 06:38:10'),
(42, 'admin', 'Click-menu', 'Search', '2021-12-30 06:41:41'),
(43, 'admin', 'Click-menu', 'Report', '2021-12-30 06:41:41'),
(44, 'ทนงค์', 'LOGOUT', '', '2021-12-30 06:41:44'),
(45, 'สุกัญญา', 'LOGIN', '', '2021-12-30 06:42:01'),
(46, 'aumaim', 'Click-menu', 'ImportContrac', '2021-12-30 06:42:06'),
(47, 'aumaim', 'Click-menu', 'RegulationList', '2021-12-30 06:42:07'),
(48, 'aumaim', 'Click-menu', 'Asset-System', '2021-12-30 06:42:08'),
(49, 'aumaim', 'Click-menu', 'DocMgrList', '2021-12-30 06:42:10'),
(50, 'aumaim', 'Update', 'ระเบียบ คำสั่ง เรื่อง :จบเกม', '2021-12-30 07:12:16'),
(51, 'aumaim', 'Update', 'ระเบียบ คำสั่ง เรื่อง :นานโน', '2021-12-30 07:13:02'),
(52, 'aumaim', 'Click-menu', 'Asset-System', '2021-12-30 07:13:32'),
(53, 'ทนงค์', 'LOGIN', '', '2022-01-04 03:29:54'),
(54, 'admin', 'เข้า-menu', 'UserManager', '2022-01-04 03:37:38'),
(55, 'admin', 'Click-menu', 'DocumentOfficialInList', '2022-01-04 03:38:07'),
(56, 'admin', 'Click-menu', 'DocMgrList', '2022-01-04 03:38:11'),
(57, 'admin', 'Click-menu', 'RegulationList', '2022-01-04 03:38:12'),
(58, 'admin', 'Click-menu', 'Information', '2022-01-04 03:38:20'),
(59, 'admin', 'Click-menu', 'RegulationList', '2022-01-04 03:42:12'),
(60, 'admin', 'Click-menu', 'ImportContrac', '2022-01-04 03:42:14'),
(61, 'admin', 'Click-menu', 'ImportContrac', '2022-01-04 03:42:17'),
(62, 'admin', 'Click-menu', 'ImportAcceptance', '2022-01-04 03:42:20'),
(63, 'admin', 'Click-menu', 'Search', '2022-01-04 03:42:27'),
(64, 'admin', 'Click-menu', 'Report', '2022-01-04 03:42:29'),
(65, 'admin', 'Click-menu', 'map', '2022-01-04 03:42:32'),
(66, 'admin', 'Click-menu', 'Information', '2022-01-04 03:42:36'),
(67, 'ทนงค์', 'LOGOUT', '', '2022-01-04 03:46:40'),
(68, 'ทนงค์', 'LOGIN', '', '2022-01-04 03:46:54'),
(69, 'admin', 'Click-menu', 'Information', '2022-01-04 03:50:04'),
(70, 'admin', 'Click-menu', 'Information', '2022-01-04 03:50:08'),
(71, 'admin', 'Click-menu', 'Information', '2022-01-04 03:50:12'),
(72, 'admin', 'Click-menu', 'Information', '2022-01-04 03:50:54'),
(73, 'admin', 'Click-menu', 'RegulationList', '2022-01-04 04:19:22'),
(74, 'admin', 'Click-menu', 'Information', '2022-01-04 04:19:26'),
(75, 'ทนงค์', 'LOGIN', '', '2022-01-05 02:42:12'),
(76, 'admin', 'Click-menu', 'Asset-System', '2022-01-05 02:44:59'),
(77, 'admin', 'Click-menu', 'Information', '2022-01-05 02:45:04'),
(78, 'admin', 'Click-menu', 'Information', '2022-01-05 02:46:46'),
(79, 'admin', 'Click-menu', 'Report', '2022-01-05 05:20:11'),
(80, 'admin', 'Click-menu', 'Report', '2022-01-05 05:20:24'),
(81, 'admin', 'Click-menu', 'Search', '2022-01-05 05:20:25'),
(82, 'admin', 'Click-menu', 'Report', '2022-01-05 05:20:26'),
(83, 'admin', 'Click-menu', 'Information', '2022-01-05 07:13:18'),
(84, 'admin', 'Click-menu', 'Information', '2022-01-05 08:57:08'),
(85, 'ทนงค์', 'LOGOUT', '', '2022-01-05 09:13:32'),
(86, 'ทนงค์', 'LOGIN', '', '2022-01-05 09:13:35'),
(87, 'admin', 'Click-menu', 'Information', '2022-01-05 09:13:40'),
(88, 'ทนงค์', 'LOGIN', '', '2022-01-06 02:15:00'),
(89, 'admin', 'Click-menu', 'Information', '2022-01-06 02:15:04'),
(90, 'ทนงค์', 'LOGIN', '', '2022-01-07 01:43:54'),
(91, 'admin', 'Click-menu', 'Information', '2022-01-07 01:44:06'),
(92, 'ทนงค์', 'LOGIN', '', '2022-02-03 03:55:24'),
(93, 'ทนงค์', 'LOGIN', '', '2022-02-03 04:07:18'),
(94, 'ทนงค์', 'LOGIN', '', '2022-02-07 03:25:56'),
(95, 'ทนงค์', 'LOGIN', '', '2022-03-14 04:48:17'),
(96, 'admin', 'Click-menu', 'DocumentOfficialInList', '2022-03-14 04:48:36'),
(97, 'admin', 'Click-menu', 'DocMgrList', '2022-03-14 05:42:48'),
(98, 'admin', 'Click-menu', 'ComplianList', '2022-03-14 05:42:50'),
(99, 'admin', 'Click-menu', 'RegulationList', '2022-03-14 05:42:51'),
(100, 'admin', 'Click-menu', 'Asset-System', '2022-03-14 05:42:52'),
(101, 'admin', 'Click-menu', 'Information', '2022-03-14 05:42:54'),
(102, 'ทนงค์', 'LOGIN', '', '2022-03-14 05:43:18'),
(103, 'admin', 'Click-menu', 'ComplianList', '2022-03-14 05:47:16'),
(104, 'admin', 'Click-menu', 'ComplianList', '2022-03-14 05:51:00'),
(105, 'admin', 'Click-menu', 'DocMgrList', '2022-03-14 05:51:02'),
(106, 'admin', 'Click-menu', 'RegulationList', '2022-03-14 05:51:04'),
(107, 'admin', 'Update', 'ระเบียบ คำสั่ง เรื่อง :ประกาศ สบค', '2022-03-14 05:51:32'),
(108, 'ทนงค์', 'LOGIN', '', '2022-08-24 08:34:04'),
(109, 'admin', 'Click-menu', 'DocMgrList', '2022-08-24 08:34:09'),
(110, 'admin', 'Click-menu', 'map', '2022-08-24 08:34:20'),
(111, 'admin', 'Click-menu', 'Asset-System', '2022-08-24 08:34:37'),
(112, 'admin', 'Click-menu', 'Asset-System', '2022-08-24 08:34:42'),
(113, 'admin', 'Click-menu', 'DocMgrList', '2022-08-24 08:34:46'),
(114, 'admin', 'Click-menu', 'Report', '2022-08-24 08:34:53'),
(115, 'ทนงค์', 'LOGIN', '', '2023-02-09 08:25:49'),
(116, 'admin', 'click-menu', 'DocAcceptList', '2023-02-09 08:26:00'),
(117, 'admin', 'click-menu', 'InternalMemoList', '2023-02-09 08:26:04'),
(118, 'admin', 'click-menu', 'UserManager', '2023-02-09 08:26:19'),
(119, 'ทนงค์', 'LOGIN', '', '2023-02-20 07:53:17'),
(120, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-02-20 07:53:30'),
(121, 'admin', 'Click-menu', 'DocMgrList', '2023-02-20 07:53:44'),
(122, 'admin', 'Click-menu', 'ComplianList', '2023-02-20 07:53:46'),
(123, 'admin', 'Click-menu', 'RegulationList', '2023-02-20 07:53:48'),
(124, 'admin', 'Click-menu', 'Asset-System', '2023-02-20 07:53:49'),
(125, 'admin', 'Click-menu', 'Information', '2023-02-20 07:53:52'),
(126, 'admin', 'Click-menu', 'Report', '2023-02-20 07:53:56'),
(127, 'admin', 'Click-menu', 'map', '2023-02-20 07:53:58'),
(128, 'admin', 'Click-menu', 'Report', '2023-02-20 07:54:00'),
(129, 'admin', 'Click-menu', 'map', '2023-02-20 07:54:01'),
(130, 'admin', 'Click-menu', 'map', '2023-02-20 07:54:09'),
(131, 'admin', 'Click-menu', 'ComplianList', '2023-02-20 07:54:15'),
(132, 'admin', 'Click-menu', 'DocMgrList', '2023-02-20 07:54:31'),
(133, 'admin', 'Click-menu', 'ComplianList', '2023-02-20 07:54:33'),
(134, 'admin', 'Click-menu', 'RegulationList', '2023-02-20 07:54:36'),
(135, 'admin', 'Click-menu', 'ImportContrac', '2023-02-20 09:53:07'),
(136, 'ทนงค์', 'LOGIN', '', '2023-03-09 08:42:30'),
(137, 'ทนงค์', 'LOGIN', '', '2023-03-31 07:44:29'),
(138, 'ทนงค์', 'LOGOUT', '', '2023-03-31 07:44:49'),
(139, 'ทนงค์', 'LOGIN', '', '2023-03-31 07:45:16'),
(140, 'ทนงค์', 'LOGOUT', '', '2023-03-31 07:46:22'),
(141, 'สมปอง', 'LOGIN', '', '2023-03-31 07:46:37'),
(142, 'สมปอง', 'LOGOUT', '', '2023-03-31 07:47:10'),
(143, 'tha', 'LOGIN', '', '2023-03-31 07:47:17'),
(144, 'ทนงค์', 'LOGIN', '', '2023-04-03 02:52:51'),
(145, 'admin', 'Click-menu', 'Asset-System', '2023-04-03 03:00:51'),
(146, 'admin', 'Click-menu', 'Asset-System', '2023-04-03 03:00:53'),
(147, 'admin', 'Click-menu', 'Asset-System', '2023-04-03 03:00:57'),
(148, 'admin', 'Click-menu', 'Information', '2023-04-03 03:02:25'),
(149, 'admin', 'Click-menu', 'Information', '2023-04-03 03:02:34'),
(150, 'admin', 'Click-menu', 'Information', '2023-04-03 03:48:36'),
(151, 'admin', 'Click-menu', 'Information', '2023-04-03 03:48:43'),
(152, 'admin', 'Click-menu', 'Asset-System', '2023-04-03 03:48:43'),
(153, 'admin', 'Click-menu', 'RegulationList', '2023-04-03 03:48:46'),
(154, 'admin', 'Click-menu', 'Asset-System', '2023-04-03 03:48:50'),
(155, 'ทนงค์', 'LOGOUT', '', '2023-04-03 04:05:23'),
(156, 'ทนงค์', 'LOGIN', '', '2023-04-03 05:24:05'),
(157, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-04-03 05:54:36'),
(158, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-04-03 06:14:26'),
(159, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-04-03 06:17:46'),
(160, 'admin', 'Click-menu', 'DocumentOfficialInList', '2023-04-03 06:17:56'),
(161, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-04-03 06:18:08'),
(162, 'admin', 'Click-menu', 'DocumentOfficialInList', '2023-04-03 06:18:17'),
(163, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-04-03 06:19:01'),
(164, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-04-03 06:19:24'),
(165, 'admin', 'Click-menu', 'DocumentOfficialInList', '2023-04-03 06:20:20'),
(166, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-04-03 06:21:50'),
(167, 'admin', 'Click-menu', 'DocMgrList', '2023-04-03 06:59:16'),
(168, 'ทนงค์', 'LOGIN', '', '2023-04-07 07:59:59'),
(169, 'admin', 'click-menu', 'UserManager', '2023-04-07 08:00:02'),
(170, 'ทนงค์', 'LOGOUT', '', '2023-04-07 08:01:48'),
(171, 'สมปอง', 'LOGIN', '', '2023-04-07 08:02:02'),
(172, 'sompong', 'click-menu', 'UserManager', '2023-04-07 08:02:05'),
(173, 'ทนงค์', 'LOGOUT', '', '2023-10-24 12:16:07'),
(174, 'admin', 'Click-menu', 'DocMgrList', '2023-10-24 12:33:13'),
(175, 'admin', 'Click-menu', 'ComplianList', '2023-10-24 12:33:16'),
(176, 'admin', 'Click-menu', 'RegulationList', '2023-10-24 12:33:20'),
(177, 'admin', 'Click-menu', 'Asset-System', '2023-10-24 12:33:24'),
(178, 'admin', 'Click-menu', 'DocMgrList', '2023-10-24 18:02:53'),
(179, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-10-24 18:25:18'),
(180, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-10-24 18:25:22'),
(181, 'ทนงค์', 'LOGOUT', '', '2023-11-06 04:59:10'),
(182, 'ทนงค์', 'LOGOUT', '', '2023-11-06 06:14:36'),
(183, 'ทนงค์', 'LOGOUT', '', '2023-11-06 07:57:19'),
(184, 'ทนงค์', 'LOGOUT', '', '2023-11-06 08:18:05'),
(185, 'ทนงค์', 'LOGOUT', '', '2023-11-06 09:38:55'),
(186, 'admin', 'Click-menu', 'Information', '2023-11-15 01:44:58'),
(187, 'admin', 'Click-menu', 'Information', '2023-11-15 01:45:06'),
(188, 'ทนงค์', 'LOGOUT', '', '2023-11-21 08:43:48'),
(189, 'admin', 'Click-menu', 'Information', '2023-11-22 03:39:20'),
(190, 'admin', 'Click-menu', 'map', '2023-11-22 03:39:23'),
(191, 'admin', 'Click-menu', 'Report', '2023-11-22 03:39:25'),
(192, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-11-22 03:39:28'),
(193, 'admin', 'Click-menu', 'Search', '2023-11-22 03:39:31'),
(194, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-11-22 03:39:34'),
(195, 'admin', 'Click-menu', 'Information', '2023-11-22 03:39:36'),
(196, 'admin', 'Click-menu', 'Information', '2023-11-22 04:15:31'),
(197, 'admin', 'Click-menu', 'ImportContrac', '2023-11-22 04:15:35'),
(198, 'admin', 'Click-menu', 'ImportAcceptance', '2023-11-22 04:15:37'),
(199, 'admin', 'Click-menu', 'ImportAcceptance', '2023-11-22 04:15:39'),
(200, 'admin', 'Click-menu', 'ImportContrac', '2023-11-22 04:15:41'),
(201, 'admin', 'Click-menu', 'ImportAsset', '2023-11-22 04:15:43'),
(202, 'admin', 'Click-menu', 'Import-treasury', '2023-11-22 04:15:45'),
(203, 'admin', 'Click-menu', 'ImportContrac', '2023-11-22 09:39:06'),
(204, 'admin', 'Click-menu', 'ImportAcceptance', '2023-11-22 09:39:08'),
(205, 'admin', 'Click-menu', 'ImportAsset', '2023-11-22 09:39:10'),
(206, 'admin', 'Click-menu', 'Import-treasury', '2023-11-22 09:39:13'),
(207, 'admin', 'Click-menu', 'ImportAsset', '2023-11-22 09:39:16'),
(208, 'admin', 'Click-menu', 'ImportAcceptance', '2023-11-22 09:39:19'),
(209, 'admin', 'Click-menu', 'Information', '2023-11-23 03:03:59'),
(210, 'admin', 'Click-menu', 'Information', '2023-11-23 03:04:02'),
(211, 'admin', 'Click-menu', 'Information', '2023-11-23 03:38:57'),
(212, 'admin', 'Click-menu', 'Information', '2023-11-23 03:39:25'),
(213, 'admin', 'Click-menu', 'Information', '2023-11-23 03:39:41'),
(214, 'ทนงค์', 'LOGOUT', '', '2023-11-23 03:51:31');

-- --------------------------------------------------------

--
-- Table structure for table `internal_memo`
--

CREATE TABLE `internal_memo` (
  `id` int(11) NOT NULL,
  `doc_id` varchar(50) NOT NULL,
  `doc_topic` varchar(255) NOT NULL,
  `doc_date` date NOT NULL,
  `doc_ref` varchar(255) NOT NULL,
  `department` varchar(255) NOT NULL,
  `section` varchar(255) NOT NULL,
  `user_upload` varchar(255) NOT NULL,
  `date_upload` datetime NOT NULL,
  `file_name` varchar(255) NOT NULL,
  `last_update` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `internal_memo`
--

INSERT INTO `internal_memo` (`id`, `doc_id`, `doc_topic`, `doc_date`, `doc_ref`, `department`, `section`, `user_upload`, `date_upload`, `file_name`, `last_update`) VALUES
(14, 'ทดสอบระบบ', 'ทดสอบระบบ', '2566-03-28', 'ทดสอบระบบ', 'ฝ่าบบริหารงานทั่วไป', 'ส่วนการโยธาและช่างสุขาภิบาล', 'ทนงค์ บุญเติม', '2023-04-03 12:25:02', 'twp_budget_calendar.pdf', '2023-04-03 07:03:17');

-- --------------------------------------------------------

--
-- Table structure for table `official_in_doc`
--

CREATE TABLE `official_in_doc` (
  `id` int(11) NOT NULL,
  `doc_id` varchar(255) NOT NULL,
  `doc_date` date NOT NULL,
  `doc_topic` varchar(255) NOT NULL,
  `doc_ref` varchar(255) NOT NULL,
  `source_official` varchar(255) NOT NULL,
  `doc_recive_id` varchar(50) NOT NULL,
  `doc_recive_date` date NOT NULL,
  `user_upload` varchar(50) NOT NULL,
  `time_upload` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `file_name` varchar(255) NOT NULL,
  `work_result` varchar(255) NOT NULL,
  `responsible_person` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `official_in_doc`
--

INSERT INTO `official_in_doc` (`id`, `doc_id`, `doc_date`, `doc_topic`, `doc_ref`, `source_official`, `doc_recive_id`, `doc_recive_date`, `user_upload`, `time_upload`, `file_name`, `work_result`, `responsible_person`) VALUES
(2, 'บท 0710/2080', '2020-12-08', 'หาเรือเกี่ยวกับสิ่งก่อสร้าง', 'ปท 52103/463', 'สำนักงานคณะกรรมการควบคุมอาคาร', 'ช่าง 1234', '2020-12-08', 'Thanong Boonterm', '2020-12-08 06:25:42', 'yotha_01.PDF', '', ''),
(13, 'มท 0804.6/ว1474', '2564-04-04', 'เตรียมความพร้อมการใช้งานระบบการขออนุญาตอิเล็กทรอนิก', 'ไม่มี', 'กรมส่งเริมการปกครองส่วนท้องถิ่น', '1211', '2564-12-08', 'ทนงค์ บุญเติม', '2021-12-08 09:22:57', '21633_1_1555483735774.pdf', 'กำลังดำเนินการ', 'ฝ่ายควบคุมอาคาร'),
(14, 'vbhjm', '2566-03-28', '', 'ไม่มี', 'vhjmg', 'ghf', '2566-04-03', 'ทนงค์ บุญเติม', '2023-04-03 06:20:39', 'twp_budget_calendar.pdf', 'gh', 'ghujmgh');

-- --------------------------------------------------------

--
-- Table structure for table `official_in_story`
--

CREATE TABLE `official_in_story` (
  `id` int(11) NOT NULL,
  `ref_id` varchar(50) NOT NULL,
  `date` date NOT NULL,
  `comment` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `official_out_doc`
--

CREATE TABLE `official_out_doc` (
  `id` int(11) NOT NULL,
  `doc_id` varchar(255) NOT NULL,
  `doc_date` date NOT NULL,
  `doc_topic` varchar(255) NOT NULL,
  `doc_ref` varchar(255) NOT NULL,
  `contract` varchar(255) NOT NULL,
  `doc_recive_id` varchar(50) NOT NULL,
  `doc_recive_date` date NOT NULL,
  `user_upload` varchar(255) NOT NULL,
  `date_upload` datetime NOT NULL,
  `file_name` varchar(255) NOT NULL,
  `work_result` varchar(255) NOT NULL,
  `responsible_person` varchar(100) NOT NULL,
  `Last_update` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `official_out_doc`
--

INSERT INTO `official_out_doc` (`id`, `doc_id`, `doc_date`, `doc_topic`, `doc_ref`, `contract`, `doc_recive_id`, `doc_recive_date`, `user_upload`, `date_upload`, `file_name`, `work_result`, `responsible_person`, `Last_update`) VALUES
(1, 'ทดสอบต่อv1258', '2566-04-04', 'ทดสอบต่อ', 'ไม่มี', 'ทดสอบต่อ', 'ทดสอบต่อ', '2566-04-04', 'ทนงค์ บุญเติม', '2023-04-03 13:23:53', 'เอกสารการขอลงทะเบียนใช้สิทธิล่วงหน้านอกเขต.pdf', 'ทดสอบต่อ', 'ทดสอบต่อ', '2023-04-03 06:23:53');

-- --------------------------------------------------------

--
-- Table structure for table `project_complete`
--

CREATE TABLE `project_complete` (
  `id` int(11) NOT NULL,
  `contrac_no` varchar(12) NOT NULL,
  `date_regis` date NOT NULL,
  `contractor` varchar(255) NOT NULL,
  `job` varchar(255) NOT NULL,
  `cost` varchar(20) NOT NULL,
  `garanty_cost` varchar(20) NOT NULL,
  `garanty_type` varchar(255) NOT NULL,
  `accept_date` date NOT NULL,
  `exp_date` date NOT NULL,
  `garanty_time` varchar(255) NOT NULL,
  `date_note` date NOT NULL,
  `doc_ref` varchar(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `project_complete`
--

INSERT INTO `project_complete` (`id`, `contrac_no`, `date_regis`, `contractor`, `job`, `cost`, `garanty_cost`, `garanty_type`, `accept_date`, `exp_date`, `garanty_time`, `date_note`, `doc_ref`) VALUES
(1, 'CNTR-1267/63', '2020-07-13', 'ห้างหุ้นส่วนจำกัด เกรียงไร เทคนิค', 'จ้างซ่อมเครื่องอัดขยะมูลฝอยเครื่องที่ 1 (129 51 0001)', '286,813.50', '14,400.00', 'เงินสด', '2020-07-20', '2020-10-20', '3 เดือน', '2020-11-26', '8752'),
(2, 'CNTR-1268/63', '2020-07-13', 'ห้างหุ้นส่วนจำกัด เกรียงไร เทคนิค', 'จ้างซ่อมตู้บรรทุกขยะ 3 ตู้ (เบอร์ 10,17,20)', '250,701.00', '12,600.00', 'เงินสด', '2020-07-15', '2020-10-15', '3 เดือน', '2020-11-26', '8753'),
(3, 'CNTR-1287/63', '2020-07-16', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 2 คันทะเบียน ต-0346 และ บ-3830', '323,846.20', '16,200.00', 'เงินสด', '2020-07-22', '2020-10-21', '3 เดือน', '2020-11-26', '8754'),
(4, 'CNTR-1288/63', '2020-07-16', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถบรรทุก 6 ล้อ ทะเบียน 82-1806(002 49 0006)', '187,934.80', '9,400.00', 'เงินสด', '2020-07-21', '2020-10-21', '3 เดือน', '2020-11-26', '8755'),
(5, 'CNTR-1289/63', '2020-07-16', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 2 คันทะเบียน บง-247 และ 82-0562', '409,028.90', '20,500.00', 'เงินสด', '2020-07-21', '2020-10-21', '3 เดือน', '2020-11-26', '8756'),
(6, 'CNTR-1284/63', '2020-07-16', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 3 คัน (ทะเบียน 81-6822 ,82-7263 และ น-9724)', '408,782.80', '20,500.00', 'เงินสด', '2020-07-21', '2020-10-21', '3 เดือน', '2020-11-26', '8757'),
(7, 'CNTR-1285/63', '2020-07-16', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 2 คัน (ทะเบียน 81-5405 ,82-7262 )', '349,547.60', '17,500.00', 'เงินสด', '2020-07-21', '2020-10-21', '3 เดือน', '2020-11-26', '8758'),
(8, 'CNTR-1316/63', '2020-07-16', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมแซม 5 รายการ(เครื่องสูบน้ำ 3 เครือง,เลื่อยยนต์ และ รถเกรด ถข-1)', '172,867.50', '9,700.00', 'เงินสด', '2020-07-21', '2020-10-21', '3 เดือน', '2020-11-26', '8759'),
(9, 'CNTR-1276/63', '2020-07-15', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างงานซ่อมรถ 2 คัน ทะเบียน 81-5406 และ 81-5405', '448,554.00', '22,500.00', 'เงินสด', '2020-07-21', '2020-10-21', '3 เดือน', '2020-11-26', '8760'),
(10, 'CNTR-1326/63', '2020-07-22', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 4 คัน ทะเบียน 82-3255,81-6297,823253 และ น-9720', '259,742.50', '13,000.00', 'เงินสด', '2020-07-29', '2020-10-29', '3 เดือน', '2020-11-26', '8761'),
(11, 'CNTR-1273/63', '2020-07-13', 'บริษัท ชูชื่นวัฒนา จำกัด', 'จ้างซ่อมเครื่องสูบน้ำ 2 เครื่อง (055 40 0025 และ 055 40 0026)', '241,285.00', '12,100.00', 'เงินสด', '2020-07-24', '2020-10-24', '3 เดือน', '2020-11-26', '8762'),
(12, 'CNTR-1374/63', '2020-08-05', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมเครื่องสูบน้ำจำนวน 9 เครื่อง', '308,192.10', '15,500.00', 'เงินสด', '2020-03-18', '2020-11-08', '', '2020-11-26', '8763'),
(13, 'CNTR-1377/63', '2020-08-05', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 2 คัน ทะเบียน บง-6538 และ บง-2312', '242,044.70', '12,110.00', 'เงินสด', '2020-08-11', '2020-11-11', '3 เดือน', '2020-11-26', '8764'),
(14, 'CNTR-1382/63', '2020-08-06', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถดูดโคลนเลน ทะเบียน 82-0562', '346,519.50', '17,326.00', 'โอนเงิน', '2020-08-24', '2020-11-24', '3 เดือน', '2020-11-26', '8765'),
(15, 'CNTR-1383/63', '2020-08-06', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมแซมรถแบคโฮทะเบียน ตค-216', '267,769.64', '13,390.00', 'โอนเงิน', '2020-08-13', '2020-11-13', '3 เดือน', '2020-11-26', '8766'),
(16, 'CNTR-1391/63', '2020-08-07', 'ห้างหุ้นส่วนจำกัด เกรียงไร เทคนิค', 'จ้างซ่อมเครื่องอัดขยะมูลฝอยเครื่องที่ 1 (329 51 0001)', '490,595.00', '24,600.00', 'เงินสด', '2020-08-17', '2020-11-17', '3 เดือน', '2020-11-26', '8767'),
(17, 'CNTR-1392/63', '2020-08-07', 'ห้างหุ้นส่วนจำกัด เกรียงไร เทคนิค', 'จ้างซ่อมรถบรรทุกรถขยะคอนเทนเนอร์ 10 ล้อ ทะเบียน 82-4299', '293,682.90', '14,700.00', 'เงินสด', '2020-08-18', '2020-11-18', '3 เดือน', '2020-11-26', '8768'),
(18, 'CNTR-1444/63', '2020-08-20', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถบรรทุกขยะคอนเทรนเนอร์ ทะเบียน 42-4298', '313,092.70', '15,660.00', 'เงินสด', '2020-08-24', '2020-11-24', '3 เดือน', '2020-11-26', '8769'),
(19, 'CNTR-1638/64', '2020-09-22', 'นางสาวนภาพรรณ กลิ่นเกลี้ยง', 'จ้างปรับปรุงภูมิทัศน์ บริเวณเกาะกลางถนนริมเขื่อนโรงเรียนประชาธิปัตย์', '406,800.00', '20,340.00', 'เงินสด', '2020-11-05', '2020-11-20', '15 วัน', '2020-11-26', '8770'),
(20, 'CNTR-1163/61', '2018-06-13', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'ประกวดราคาจ้างก่อสร้างโครงการก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ หมู่บ้านธารารินทร์ ซอย 1 (ช่วงที่ 1)', '5,507,892.00', '282,000.00', 'หนังสือค้ำประกันเลขที่ ค.47690234806000', '2018-10-02', '2020-10-02', '2 ปี', '2020-11-27', '8838'),
(21, 'CNTR-1750/61', '2018-08-20', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', 'จ้างซ่อม จำนวน 3 รายการ (ตู้บรรทุกขยะ เบอร์ 16,เครื่องเติมอากาศ, เครื่องย่อยกิ่งไม้', '138,511.50', '6,926.00', 'เงินสด', '2018-08-27', '2018-11-27', '3 เดือน', '2020-11-27', '8839'),
(22, 'CNTR-1819/61', '2018-08-28', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัดชั่น', 'จ้างเหมาปรับปรุงไฟฟ้าริมเขื่อนสะพานแดง', '372,500.00', '18,650.00', 'เงินสด', '2018-10-26', '2019-10-26', '1 ปี', '2020-11-27', '8840'),
(23, 'CNTR-1807/62', '2019-09-12', 'ห้างหุ้นส่วนจำกัด ปทุมธานี วัสดุภัณฑ์', 'ซื้อครุภัณฑ์ก่อสร้าง จำนวน 4 รายการ(สว่านโรตารรี่, สว่านไฟฟ้าไร้สาย, ตู้เชื่อมอินเวอร์เตอร์ และ รถเข็นปูน)', '35,200.00', '1,760.00', 'เงินสด', '2019-10-12', '2020-10-12', '1 ปี', '2020-11-27', '8841'),
(24, 'CNTR-1806/62', '2019-09-12', 'ห้างหุ้นส่วนจำกัด ปทุมธานี วัสดุภัณฑ์', 'ซื้อครุภัณฑ์งานบ้านงานครัว (รถตัดหญ้าแบบล้อจักรยาน จำนวน 1 เครื่อง)', '12,000.00', '600.00', 'เงินสด', '2019-10-12', '2020-10-12', '1 ปี', '2020-11-27', '8842'),
(25, 'CNTR-1497/62', '2019-07-22', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถแมคโคร ทะเบียน ตค-50 และรถ JCB ทะเบียน ตค-45 ', '126,944.00', '6,400.00', 'เงินสด', '2019-07-25', '2019-10-25', '3 เดือน', '2020-11-27', NULL),
(26, 'CNTR-1318/62', '2019-07-18', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถฝ่ายสาธารณูปโภค 2 คัน (ทะเบียน ตค-134 และ บฉ-6940)', '290,772.50', '14,540.00', 'เงินสด', '2019-07-23', '2019-10-23', '3 เดือน', '2020-11-27', '8844'),
(27, 'CNTR-1711/62', '2019-09-02', 'บริษัท พฤกษ จำกัด', 'จ้างเหมาซ่อมแซมฝาบ่อพัก ซอย รังสิต-นครนายก 6 (กลางซอย) ช่วงที่ 2 จำนวน 10 บ่พัก', '436,900.00', '21,900.00', 'เงินสด', '2019-09-16', '2020-09-16', '1 ปี', '2020-11-27', '8845'),
(28, 'CNTR-1876/62', '2019-09-24', 'บริษัท พฤกษ จำกัด', 'จ้างเหมาซ่อมแซมฝาบ่อพัก บริเวณหลังตลาดสุชาติ ช่วงที่ 2 จำนวน 5 บ่พัก', '431,900.00', '21,600.00', 'เงินสด', '2019-10-22', '2020-10-22', '1 ปี', '2020-11-27', '8846'),
(29, 'CNTR-0525/62', '2019-02-06', 'ห้างหุ้นส่วนจำกัด ปทุมธานี วัสดุภัณฑ์', 'ซื้อครุภัณฑ์สำนักงาน (ถังน้ำพลาสติก ขนาด 1,000 ลิตร จำนวน 2 ถัง)', '5,200.00', '260.00', 'เงินสด', '2019-03-06', '2020-03-06', '1 ปี', '2020-11-27', '8847'),
(30, 'CNTR-1276/63', '2019-07-15', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 2 คัน ทะเบียน 81-5406 และ 81-5405', '448,554.70', '22,500.00', 'เงินสด', '2020-07-21', '2020-10-21', '3 เดือน', '2020-11-27', '8843'),
(31, 'CNTR-1391/63', '2018-08-07', 'ห้างหุ้นส่วนจำกัด เกรียงไร เทคนิค', 'จ้างซ่อมเครื่องอัดขยะมูลฝอยเครื่องที่ 1 (329 51 0001)', '490,595.00', '24,600.00', 'เงินสด', '2020-08-17', '2020-11-17', '3 เดือน', '2020-11-27', '8851'),
(32, 'CNTR-1385/63', '2020-08-06', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถแบคโฮ ทะเบียน ตค 217', '111,280.00', '5,564.00', 'เงินสด', '2020-08-10', '2020-11-10', '3 เดือน', '2020-11-27', '8852'),
(33, 'CNTR-1105/63', '2020-05-27', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถดูดโคลนเลน ทะเบียน 83-1306(035 59 0003)', '113,623.30', '5,700.00', 'เงินสด', '2020-06-01', '2020-09-01', '3 เดือน', '2020-12-02', '8886'),
(34, 'CNTR-0664/63', '2020-02-25', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถแมคโคร ทะเบียน ต-0348 (019 37 0002)', '251,706.80', '12,600.00', 'เงินสด', '2020-02-28', '2020-05-28', '3 เดือน', '2020-12-02', '8887'),
(35, 'CNTR-0786/63', '2020-03-18', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถ ทะเบียน ตค-45 (019 41 0004)', '114,233.20', '5,720.00', 'เงินสด', '2020-03-24', '2020-06-24', '3 เดือน', '2020-12-02', '8888'),
(36, 'CNTR-0663/63', '2020-02-25', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถแบคโฮ ทะเบียน ตค-65(081 42 0004)', '270,175.00', '13,600.00', 'เงินสด', '2020-03-02', '2020-06-02', '3 เดือน', '2020-12-02', '8889'),
(37, 'CNTR-0200/63', '2020-11-21', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถดูดโคลนเลน ทะเบียน 82-0562', '180,230.80', '9,012.00', 'เงินสด', '2020-11-27', '2021-02-27', '3 เดือน', '2020-12-02', '8890'),
(38, 'CNTR-0520/63', '2020-01-06', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถหน้าขุดหลัง ทะเบียน ต-0346 (เลขครุภัณฑ์ 018 37 0002)', '122,846.70', '6,200.00', 'เงินสด', '2020-02-06', '2020-05-06', '3 เดือน', '2020-12-02', '8891'),
(39, 'CNTR-1783/61', '2018-08-23', 'บริษัท ธนกรเมตัลเวอร์คโปรดิวเซอร์ จำกัด', 'จ้างเหมาปรับปรุงเมรุเผาศพ บริเวณวัดแสงสรรค์', '499,690.00', '2,500.00', 'เงินสด', '2018-11-21', '2020-11-21', '2 ปี', '2020-12-22', '9181'),
(40, 'CNTR-0600/62', '2019-02-20', 'ห้างหุ้นส่วนจำกัด ดี แอนด์ เอส นานาภัณฑ์', 'ซื้อครุภัณฑ์สำนักงาน (โต๊ะพับเอนกประสงค์ จำนวน 50 ตัว)', '175,000.00', '8,750.00', 'เงินสด', '2019-03-22', '2020-03-22', '1 ปี', '2020-12-22', '9182'),
(41, 'CNTR-0573/63', '2020-02-11', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'จ้างเหมาปรับปรุงภมิทัศน์ บริเวณเกาะกลางถนนริมเขื่อนหลังตลาดรังสิต', '216,000.00', '10,800.00', 'เงินสด', '2020-02-28', '2020-03-14', '15 วัน', '2020-12-22', '9184'),
(42, 'CNTR-1022/63', '2020-05-01', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถยนต์ 5 คัน (บท-4581, 82-7515, 82-3253, กฉน-789, บ-3502)', '211,314.30', '10,600.00', 'เงินสด', '2020-05-05', '2020-08-05', '3 เดือน', '2020-12-22', '9185'),
(43, 'CNTR-1106/63', '2020-05-27', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถบรรทุก 10 ล้อ ทะเบียน 81-6821', '411,821.60', '20,600.00', 'เงินสด', '2020-06-01', '2020-09-01', '3 เดือน', '2020-12-22', '9186'),
(44, 'CNTR-1183/63', '2020-06-22', 'ห้างหุ้นส่วนจำกัด เกรียงไร เทคนิค', 'จ้างซ่อมรถแมคโคร ทะเบียน ตค-145', '202,001.02', '10,100.00', 'เงินสด', '2020-07-01', '2020-10-03', '3 เดือน', '2020-12-22', '9187'),
(45, 'CNTR-1186/63', '2020-06-22', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถ 2 คัน ทะเบียน บง-247 และ ตค-216', '437,351.80', '21,868.00', 'โอนเงิน', '2020-06-29', '2020-09-29', '3 เดือน', '2020-12-22', '9188'),
(46, 'CNTR-1571/63', '2020-09-14', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถบรรทุกมูลฝอยแบบเปิดข้างเทท้าย ทะเบียน 83-0473', '192,321.80', '9,620.00', 'เงินสด', '2020-09-18', '2020-12-18', '3 เดือน', '2020-12-22', '9189'),
(47, 'CNTR-1572/63', '2020-09-14', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 4 คัน ทะเบียน 82-4299, 82-4298, 82-7263, น-9724', '166,534.80', '8,330.00', 'เงินสด', '2020-09-17', '2020-12-17', '3 เดือน', '2020-12-22', '9190'),
(48, 'CNTR-1580/63', '2020-09-15', 'ห้างหุ้นส่วนจำกัด เกรียงไร เทคนิค', 'จ้างซ่อมรถลากไฮโดรลิค ทะเบียน 82-7262', '202,807.80', '10,150.00', 'เงินสด', '2020-09-21', '2020-12-21', '3 เดือน', '2020-12-22', '9191'),
(49, 'CNTR-1460/63', '2020-08-24', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมตู้บรรทุก 10 ล้อ ทะเบียน 81-5406 ', '359,413.00', '18,000.00', 'เงินสด', '2020-08-31', '2020-12-01', '3 เดือน', '2020-12-23', '9212'),
(50, 'CNTR-1476/63', '2020-08-25', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถแม็คโคร ทะเบียน ตค-127', '133,643.00', '6,683.00', 'เงินสด', '2020-08-27', '2020-11-27', '3 เดือน', '2020-12-23', '9213'),
(51, 'CNTR-1487/63', '2020-08-26', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถ 3 คัน ทะเบียน ตค-216, ต-0348, ต-0346', '310,043.20', '15,503.00', 'โอนเงิน', '2020-08-31', '2020-12-01', '3 เดือน', '2020-12-23', '9214'),
(52, 'CNTR-1494/63', '2020-08-28', 'บริษัท วิรุฬห์ แอนด์ เกวนเนส จำกัด', 'จ้างซ่อมเครื่องสูบน้ำ เลขครุภัฑ์  055 61 0445', '324,745.00', '16,327.25', 'หนังสือค้ำประกัน ธนาคารกสิกรไทย จำกัด(มหาชน) สาขาติวานนท์(แคราย) เลขที่ 100033706140', '2020-09-18', '2020-12-18', '3 เดือน', '2020-12-23', '9215'),
(53, 'CNTR-1495/63', '2020-08-28', 'บริษัท วิรุฬห์ แอนด์ เกวนเนส จำกัด', 'จ้างซ่อมเครื่องสูบน้ำ (055 57 0367), ตู้ควบคุมเครื่องสูบน้ำ(202 57 0006), และเครื่องเก็บขยะอัตโนมัติ(635 57 0003)', '492,628.00', '24,631.40', 'หนังสือค้ำประกัน ธนาคารกสิกรไทย จำกัด(มหาชน) สาขาติวานนท์(แคราย) เลขที่ 100033706078', '2020-09-18', '2020-12-18', '3 เดือน', '2020-12-23', '9216'),
(54, 'CNTR-1513/63', '2020-08-31', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 3 คัน ทะเบียน 81-6822, น-4340, 81-6823', '391,609.30', '19,600.00', 'เงินสด', '2020-09-03', '2020-12-03', '3 เดือน', '2020-12-23', '9217'),
(55, 'CNTR-1514/63', '2020-08-31', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 3 คัน ทะเบียน 82-4299, 82-4298, ต-0348', '472,929.30', '23,700.00', 'เงินสด', '2020-09-08', '2020-12-08', '3 เดือน', '2020-12-23', '9218'),
(56, 'CNTR-1522/63', '2020-09-01', 'บริษัท พฤกษ จำกัด', 'จ้างเหมาซ่อมแซมเครื่องออกกำลังกาย บริเวณวัดคลองหนึ่งและบริเวณชุมชนสินสมุทร', '275,525.00', '13,800.00', 'เงินสด', '2020-09-17', '2020-12-17', '3 เดือน', '2020-12-23', '9219'),
(57, 'CNTR-1479/63', '2020-08-25', 'ห้างหุ้นส่วนจำกัด เกรียงไร เทคนิค', 'จ้างซ่อมตู้บรรทุกขยะ 10 ล้อ จำนวน 6 ตู้(เบอร์ 15,19,14,3,5,9)', '455,178.00', '22,800.00', 'เงินสด', '2020-08-31', '2020-12-01', '3 เดือน', '2020-12-23', '9220'),
(58, 'CNTR-1579/63', '2020-09-15', 'ห้างหุ้นส่วนจำกัด เกรียงไร เทคนิค', 'จ้างซ่อมเครื่องอัดขยะมูลฝอยเครื่องที่ 2 (329 45 0002)', '359,413.00', '17,980.00', 'เงินสด', '2020-09-22', '2020-12-22', '3 เดือน', '2020-12-23', '9221'),
(59, 'CNTR-0782/61', '2018-03-16', 'ห้างหุ้นส่วนจำกัด เอ.เอส.พี.นิพนธ์ คอนสตรัคชั่น', 'ประกวดราคาจ้างก่อสร้างโครงการก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิต-ปทุมธานี 10  ซอย 10  ด้วยวิธีประกวดราคาอิเล็กทรอนิกส์(e-bidding)', '3,085,085.00', '154,255.00', 'เงินสด', '2018-10-25', '2020-10-25', '', '2021-01-07', '68'),
(60, 'CNTR-0200/64', '2020-11-25', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'จ้างเหมาลอกลำรางสาธารณะ บริเวณหลังหมู่บ้านณัฐวรรณ', '420,600.00', '21,030.00', 'เงินสด', '2020-12-02', '2020-12-17', '', '2021-01-14', '166'),
(61, 'CNTR-0319/64', '2020-12-16', 'บริษัท วิสิเบิล ไลท์ จำกัด', 'จ้างเหมาตกแต่งไฟสวยงาม ในเทศกาลปีใหม่ ประจำปี 2564', '498,000.00', '24,900.00', 'เงินสด', '2020-12-30', '2021-01-14', '', '2021-01-14', '167'),
(62, 'CNTR-0274/60', '2016-12-14', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'จ้างเหมาก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิตนครนายก 2 ซอย 17', '', '48,500.00', 'หนังสือค้ำประกันเลขที่ ค.47690177522000', '0000-00-00', '2019-04-11', '', '2021-01-19', '220'),
(63, 'CNTR-0276/60', '2016-12-14', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'จ้างเหมาโครงการก่อสร้างปรับปรุงผิวจราจรแอสฟัลท์ติกคอนกรีต ซอยรังสิตนครนายก 67 (ฝั่งซ้าย)', '', '23,900.00', 'หนังสือค้ำประกันเลขที่ ค.47690177519000', '0000-00-00', '2019-03-10', '', '2021-01-19', '221'),
(64, 'CNTR-1901/61', '2018-09-10', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'จ้างปรับปรุงพื้นคอนกรีตพร้อมวางท่อระบายน้ำและบ่อพัก บริเวณลานแอโรบิคหน้าศูนย์การเรียนรู้ฯ', '', '6,400.00', 'เงินสด ', '0000-00-00', '2019-10-13', '', '2021-01-19', '222'),
(65, 'CNTR-2045/61', '2018-09-26', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'จ้างเหมาค่าแรงก่อสร้างหลังคาโรงเก็บพัสดุ ซอยรังสิต-นครนายก ๕๖ หลังวัดจันทร์สุข)', '', '19,900.00', 'เงินสด ', '0000-00-00', '2020-09-27', '', '2021-01-19', '223'),
(66, 'CNTR-2048/61', '2018-09-27', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'จ้างเหมาปรับปรุงพื้นที่ติดตั้งตู้คอนเทรนเนอร์สวนสาธารณะ ซอยรังสิต-ปทุมธานี ๑๔ ซอย ๑๖', '', '8,900.00', 'เงินสด', '0000-00-00', '2020-10-27', '', '2021-01-19', '224'),
(67, 'CNTR-1728/61', '2019-09-13', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'จ้างก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิต-นครนายก 13 ซอย 13/1 (ส่วนที่เหลือ)', '', '135,000.00', 'หนังสือค้ำประกันเลขที่ 100019649606', '0000-00-00', '2020-08-22', '', '2021-01-19', '225'),
(68, 'CNTR-0083/63', '2019-10-29', 'บริษัท พกฤษ จำกัด', 'จ้างเหมาซ่อมแซมฝาบ่อพัก ซอยรังสิต-นครนายก 6 (กลางซอย) ช่วงที่ 3 จำนวน 10 บ่อพัก', '', '22,030.00', 'เงินสด', '0000-00-00', '2020-11-08', '', '2021-01-19', '226'),
(69, 'CNTR-0100/63', '2019-11-05', 'บริษัท พกฤษ จำกัด', 'จ้างติดตั้งไฟฟ้าส่องสว่างบริเวณสวนสาธารณะ ซอยรังสิต-ปทุมธานี 14 ซอย 12', '', '23,705.00', 'เงินสด', '0000-00-00', '2020-11-13', '', '2021-01-19', '227'),
(70, 'CNTR-0122/63', '2019-11-07', 'บริษัท พกฤษ จำกัด', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-ปทุมธานี 8', '', '21,900.00', 'เงินสด', '0000-00-00', '2020-12-07', '', '2021-01-19', '228'),
(71, 'CNTR-0209/63', '2019-11-22', 'บริษัท พกฤษ จำกัด', 'จ้างติดตั้งไฟฟ้าส่องสว่างบริเวณจุดตัดสะพานฟ้า', '', '12,500.00', 'เงินสด', '0000-00-00', '2020-12-14', '', '2021-01-19', '229'),
(72, 'CNTR-1039/60', '2017-07-03', 'บริษัท อาคีร่า เอสเค จำกัด', 'จ้างเหมาติดตั้งเครื่องตักขยะอัตโนมัติ บริเวณสถานีสูบน้ำ ซอย รังสิต-ปทุมธานี 15 (ท้ายซอย)', '6,490,000.00', '294,000.00', 'หนังสือค้ำประกันเลขที่ 013/2560/00012/003 / 2 ปี ', '2017-11-17', '2021-01-16', '', '2021-01-25', '306'),
(73, 'CNTR-0069/63', '2019-10-25', 'บริษัท ยูไนเต็ดแมชชินเนอรี่ จำกัด', 'ซื้อครุภัณฑ์ยานพาหนะและขนส่ง รถลากคอนเทนเนอร์ใหญ่ จำนวน 1 (หนึ่ง) คัน เป็นรถบรรทุกชนิด 10 ล้อ พร้อมติดตั้งชุดยก-ลากได้น้ำหนัก 20 ตัน มีมุมยกเท 45 องศา', '6,490,000.00', '324,500.00', 'เงินสด', '0000-00-00', '2021-01-16', '', '2021-02-01', '412'),
(74, 'CNTR-1611/61', '2018-08-01', 'บริษัท นิมิต จำกัด', 'ประกวดราคาจ้างก่อสร้าง โครงการก่อสร้างรั้วโรงเก็บพัสดุเทศบาลนครรังสิต ซอยรังสิต-นครนายก 56', '2,250,000.00', '187,500.00', 'หนังสือค้ำประกันเลขที่ 100019403364 / 2 ปี ', '2018-12-25', '2021-02-01', '', '2021-02-01', '414'),
(75, 'CNTR-1742/62', '2019-09-05', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'จ้างเหมาโครงการปรับปรุงประตูระบายน้ำบริเวณหน้าประตูน้ำจุฬา', '240,300.00', '12,015.00', 'เงินสด', '2019-10-18', '2020-10-18', '', '2021-02-01', '415'),
(76, 'CNTR-1568/63', '2020-09-14', 'บริษัท อ.นวรัตน์ จำกัด', 'จ้างเหมาซ่อมแซมถนนแอสฟัลติกคอนกรีต สะพาน ในความรับผิดชอบของเทศบาลนครรังสิต', '467,000.00', '23,350.00', 'เงินสด', '2020-10-12', '2021-01-12', '', '2021-02-01', '416'),
(77, 'CNTR-0060/64', '2020-10-21', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถแบคโฮ ทะเบียน ตค-127', '227,813.70', '11,391.00', 'เงินสด', '2020-10-27', '2021-01-27', '', '2021-02-01', '417'),
(78, 'CNTR-0061/64', '2020-10-21', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถ JCB ทะเบียน ตค-45', '356,716.60', '17,836.00', 'เงินสด', '2020-10-27', '2021-01-27', '', '2021-02-01', '418'),
(79, 'CNTR-0086/64', '2020-10-28', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 4 คัน ทะเบียน ถข-16, ตค-45, 81-6297, บ-4895', '115,667.00', '5,800.00', 'เงินสด', '2020-10-30', '2021-01-30', '', '2021-02-01', '419'),
(80, 'CNTR-1681/62', '2019-08-28', 'บริษัท ฟูโซ่ ทรัค (ประเทศไทย) จำกัด', 'ซื้อรถบรรทุกหกล้อ', '', '84,450.00', 'เงินสด', '0000-00-00', '2020-09-24', '', '2021-02-09', '551'),
(81, 'CNTR-1809/62', '2019-09-12', 'ห้างหุ้นส่วนจำกัด ปทุมธานีวัสดุภัณฑ์', 'ซื้อปั๊มน้ำอัตโนมัติ ขนาด 400 W', '', '900.00', 'เงินสด', '0000-00-00', '0000-00-00', '', '2021-02-09', '552'),
(82, 'CNTR-1817/62', '2019-09-13', 'บริษัท กรีนเวิร์ค แอสโซซิเอท จำกัด', 'จ้างเหมาซ่อมแซมถนนลาดยางแอสฟัสท์ติกคอนกรีต ที่ชำรุดภายในเขตเทศบาลนครรังสิต', '', '24,600.00', 'เงินสด', '0000-00-00', '2020-10-12', '', '2021-02-09', '553'),
(83, 'CNTR-1818/62', '2019-09-13', 'บริษัท กรีนเวิร์ค แอสโซซิเอท จำกัด', 'จ้างเหมาซ่อมแซมถนนแอสฟัลติกคอนกรีต ในความรับผิดชอบของเทศมบาลนครรังสิต', '', '24,750.00', 'เงินสด', '0000-00-00', '2020-10-02', '', '2021-02-09', '554'),
(84, 'CNTR-1844/62', '2019-09-19', 'บริษัท เรเซอร์การไฟฟ้า (ประเทศไทย) จำกัด', 'ซื้อโคมไฟถนน LED', '', '24,075.00', 'หนังสือค้ำประกันเลขที่ ค.0321 ', '0000-00-00', '0000-00-00', '', '2021-02-09', '555'),
(85, 'CNTR-1888/62', '2019-09-27', 'บริษัท โชคอำนวยอีควิปเม้นท์ จำกัด', 'ซื้อรถยนต์บรรทุก ชนิด 6 ล้อ แบบเทท้าย', '', '163,675.00', 'เช็คเลขที่ 00512289', '0000-00-00', '2020-01-22', '', '2021-02-09', '556'),
(86, 'CNTR-1889/62', '2019-09-27', 'บริษัท เจ ซอฟท์ จำกัด', 'ซื้อเครื่องเสียง', '', '4,641.00', 'หนังสือค้ำประกันเลขที่ 02178191000342 ', '0000-00-00', '0000-00-00', '', '2021-02-09', '557'),
(87, 'CNTR-1892/62', '2019-09-27', 'บริษัท ธนกุลดีไซน์ แอนด์ เดคคอร์ จำกัด', 'จ้างติดตั้งไฟฟ้าส่องสว่างบริเวณทางแยกสาธารณะถนนภายในเขตเทศบาล', '', '24,300.00', 'หนังสือค้ำประกันเลขที่ 02120191000324 ', '0000-00-00', '2020-10-26', '', '2021-02-09', '558'),
(88, 'CNTR-0232/63', '2019-11-29', 'บริษัท พกฤษ จำกัด', 'จ้างติดตั้งไฟฟ้าส่องสว่างสวนสาธารณะ ซอยรังสิต-ปทุมธานี 8', '', '23,720.00', 'เงินสด  ', '0000-00-00', '0000-00-00', '', '2021-02-09', '559'),
(89, 'CNTR-0264/63', '2019-12-12', 'บริษัท สุทธิพงษ์ ไลท์ติ้ง จำกัด', 'ซื้อโคมไฟฟ้าถนนครุภัณฑ์ไฟฟ้าและวิทยุ', '', '34,000.00', 'เงินสด  ', '0000-00-00', '0000-00-00', '', '2021-02-09', '560'),
(90, 'CNTR-0397/63', '2020-01-07', 'บริษัท พกฤษ จำกัด', 'จ้างเหมาซ่อมแซมเครื่องออกกำลังกายและเครื่องเล่นสนาม', '', '17,300.00', 'เงินสด ', '0000-00-00', '2020-01-29', '', '2021-02-09', '561'),
(91, 'CNTR-0072/64', '2020-10-26', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมแซมรถ 2 คัน ทะเบียน 82-6916 และทะเบียน 81-5406', '467,627.20', '23,382.00', 'เงินโอน', '2020-11-02', '2021-02-02', '', '2021-02-23', '793'),
(92, 'CNTR-0360/64', '2020-12-25', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น ', 'จ้างเหมาลอกลำรางสาธารณะ บริเวณซอยรังสิต-นครนายก 27', '375,000.00', '18,750.00', 'เงินสด', '2021-01-22', '2021-02-06', '', '2021-02-23', '794'),
(93, 'CNTR-0147/64', '2020-11-10', 'บริษัท เควีเอ็มเอส จำกัด', 'จ้างซ่อมเครื่องอัดขยะมูลฝอยเครืองที่ 1 (329 51 0001)', '399,110.00', '19,960.00', 'เงินสด', '2020-11-23', '2021-02-23', '', '2021-02-23', '795'),
(94, 'CNTR-0782/61', '2018-03-16', 'ห้างหุ้นส่วนจำกัด เอ.เอส.พี.นิพนธ์ คอนสตรัคชั่น', 'ประกวดราคาจ้างก่อสร้างโครงการก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิต-ปทุมธานี 10  ซอย 10  ด้วยวิธีประกวดราคาอิเล็กทรอนิกส์(e-bidding)', '3,085,085.00', '154,255.00', 'เงินสด', '2018-10-25', '2020-10-25', '', '2021-01-07', '68'),
(95, 'CNTR-0200/64', '2020-11-25', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'จ้างเหมาลอกลำรางสาธารณะ บริเวณหลังหมู่บ้านณัฐวรรณ', '420,600.00', '21,030.00', 'เงินสด', '2020-12-02', '2020-12-17', '', '2021-01-14', '166'),
(96, 'CNTR-0319/64', '2020-12-16', 'บริษัท วิสิเบิล ไลท์ จำกัด', 'จ้างเหมาตกแต่งไฟสวยงาม ในเทศกาลปีใหม่ ประจำปี 2564', '498,000.00', '24,900.00', 'เงินสด', '2020-12-30', '2021-01-14', '', '2021-01-14', '167'),
(97, 'CNTR-0274/60', '2016-12-14', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'จ้างเหมาก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิตนครนายก 2 ซอย 17', '', '48,500.00', 'หนังสือค้ำประกันเลขที่ ค.47690177522000', '0000-00-00', '2019-04-11', '', '2021-01-19', '220'),
(98, 'CNTR-0276/60', '2016-12-14', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'จ้างเหมาโครงการก่อสร้างปรับปรุงผิวจราจรแอสฟัลท์ติกคอนกรีต ซอยรังสิตนครนายก 67 (ฝั่งซ้าย)', '', '23,900.00', 'หนังสือค้ำประกันเลขที่ ค.47690177519000', '0000-00-00', '2019-03-10', '', '2021-01-19', '221'),
(99, 'CNTR-1901/61', '2018-09-10', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'จ้างปรับปรุงพื้นคอนกรีตพร้อมวางท่อระบายน้ำและบ่อพัก บริเวณลานแอโรบิคหน้าศูนย์การเรียนรู้ฯ', '', '6,400.00', 'เงินสด ', '0000-00-00', '2019-10-13', '', '2021-01-19', '222'),
(100, 'CNTR-2045/61', '2018-09-26', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'จ้างเหมาค่าแรงก่อสร้างหลังคาโรงเก็บพัสดุ ซอยรังสิต-นครนายก ๕๖ หลังวัดจันทร์สุข)', '', '19,900.00', 'เงินสด ', '0000-00-00', '2020-09-27', '', '2021-01-19', '223'),
(101, 'CNTR-2048/61', '2018-09-27', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'จ้างเหมาปรับปรุงพื้นที่ติดตั้งตู้คอนเทรนเนอร์สวนสาธารณะ ซอยรังสิต-ปทุมธานี ๑๔ ซอย ๑๖', '', '8,900.00', 'เงินสด', '0000-00-00', '2020-10-27', '', '2021-01-19', '224'),
(102, 'CNTR-1728/61', '2019-09-13', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'จ้างก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิต-นครนายก 13 ซอย 13/1 (ส่วนที่เหลือ)', '', '135,000.00', 'หนังสือค้ำประกันเลขที่ 100019649606', '0000-00-00', '2020-08-22', '', '2021-01-19', '225'),
(103, 'CNTR-0083/63', '2019-10-29', 'บริษัท พกฤษ จำกัด', 'จ้างเหมาซ่อมแซมฝาบ่อพัก ซอยรังสิต-นครนายก 6 (กลางซอย) ช่วงที่ 3 จำนวน 10 บ่อพัก', '', '22,030.00', 'เงินสด', '0000-00-00', '2020-11-08', '', '2021-01-19', '226'),
(104, 'CNTR-0100/63', '2019-11-05', 'บริษัท พกฤษ จำกัด', 'จ้างติดตั้งไฟฟ้าส่องสว่างบริเวณสวนสาธารณะ ซอยรังสิต-ปทุมธานี 14 ซอย 12', '', '23,705.00', 'เงินสด', '0000-00-00', '2020-11-13', '', '2021-01-19', '227'),
(105, 'CNTR-0122/63', '2019-11-07', 'บริษัท พกฤษ จำกัด', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-ปทุมธานี 8', '', '21,900.00', 'เงินสด', '0000-00-00', '2020-12-07', '', '2021-01-19', '228'),
(106, 'CNTR-0209/63', '2019-11-22', 'บริษัท พกฤษ จำกัด', 'จ้างติดตั้งไฟฟ้าส่องสว่างบริเวณจุดตัดสะพานฟ้า', '', '12,500.00', 'เงินสด', '0000-00-00', '2020-12-14', '', '2021-01-19', '229'),
(107, 'CNTR-1039/60', '2017-11-22', 'บริษัท อาคีร่า เอสเค จำกัด', 'จ้างเหมาติดตั้งเครื่องตักขยะอัตโนมัติ บริเวณสถานีสูบน้ำ ซอย รังสิต-ปทุมธานี 15 (ท้ายซอย)', '6,490,000.00', '294,000.00', 'หนังสือค้ำประกันเลขที่ 013/2560/00012/003 / 2 ปี ', '2017-11-17', '2019-11-17', '', '0000-00-00', '306'),
(108, 'CNTR-0069/63', '2019-10-25', 'บริษัท ยูไนเต็ดแมชชินเนอรี่ จำกัด', 'ซื้อครุภัณฑ์ยานพาหนะและขนส่ง รถลากคอนเทนเนอร์ใหญ่ จำนวน 1 (หนึ่ง) คัน เป็นรถบรรทุกชนิด 10 ล้อ พร้อมติดตั้งชุดยก-ลากได้น้ำหนัก 20 ตัน มีมุมยกเท 45 องศา', '6,490,000.00', '324,500.00', 'เงินสด', '0000-00-00', '2021-01-16', '', '2021-02-01', '412'),
(109, 'CNTR-1611/61', '2018-08-01', 'บริษัท นิมิต จำกัด', 'ประกวดราคาจ้างก่อสร้าง โครงการก่อสร้างรั้วโรงเก็บพัสดุเทศบาลนครรังสิต ซอยรังสิต-นครนายก 56', '2,250,000.00', '187,500.00', 'หนังสือค้ำประกันเลขที่ 100019403364 / 2 ปี ', '2018-12-25', '2021-02-01', '', '2021-02-01', '414'),
(110, 'CNTR-1742/62', '2019-09-05', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'จ้างเหมาโครงการปรับปรุงประตูระบายน้ำบริเวณหน้าประตูน้ำจุฬา', '240,300.00', '12,015.00', 'เงินสด', '2019-10-18', '2020-10-18', '', '2021-02-01', '415'),
(111, 'CNTR-1568/63', '2020-09-14', 'บริษัท อ.นวรัตน์ จำกัด', 'จ้างเหมาซ่อมแซมถนนแอสฟัลติกคอนกรีต สะพาน ในความรับผิดชอบของเทศบาลนครรังสิต', '467,000.00', '23,350.00', 'เงินสด', '2020-10-12', '2021-01-12', '', '2021-02-01', '416'),
(112, 'CNTR-0060/64', '2020-10-21', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถแบคโฮ ทะเบียน ตค-127', '227,813.70', '11,391.00', 'เงินสด', '2020-10-27', '2021-01-27', '', '2021-02-01', '417'),
(113, 'CNTR-0061/64', '2020-10-21', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถ JCB ทะเบียน ตค-45', '356,716.60', '17,836.00', 'เงินสด', '2020-10-27', '2021-01-27', '', '2021-02-01', '418'),
(114, 'CNTR-0086/64', '2020-10-28', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 4 คัน ทะเบียน ถข-16, ตค-45, 81-6297, บ-4895', '115,667.00', '5,800.00', 'เงินสด', '2020-10-30', '2021-01-30', '', '2021-02-01', '419'),
(115, 'CNTR-1681/62', '2019-08-28', 'บริษัท ฟูโซ่ ทรัค (ประเทศไทย) จำกัด', 'ซื้อรถบรรทุกหกล้อ', '', '84,450.00', 'เงินสด', '0000-00-00', '2020-09-24', '', '2021-02-09', '551'),
(116, 'CNTR-1809/62', '2019-09-12', 'ห้างหุ้นส่วนจำกัด ปทุมธานีวัสดุภัณฑ์', 'ซื้อปั๊มน้ำอัตโนมัติ ขนาด 400 W', '', '900.00', 'เงินสด', '0000-00-00', '2020-10-12', '', '2021-02-09', '552'),
(117, 'CNTR-1817/62', '2019-09-13', 'บริษัท กรีนเวิร์ค แอสโซซิเอท จำกัด', 'จ้างเหมาซ่อมแซมถนนลาดยางแอสฟัสท์ติกคอนกรีต ที่ชำรุดภายในเขตเทศบาลนครรังสิต', '', '24,600.00', 'เงินสด', '0000-00-00', '2020-10-12', '', '2021-02-09', '553'),
(118, 'CNTR-1818/62', '2019-09-13', 'บริษัท กรีนเวิร์ค แอสโซซิเอท จำกัด', 'จ้างเหมาซ่อมแซมถนนแอสฟัลติกคอนกรีต ในความรับผิดชอบของเทศมบาลนครรังสิต', '', '24,750.00', 'เงินสด', '0000-00-00', '2020-10-02', '', '2021-02-09', '554'),
(119, 'CNTR-1844/62', '2019-09-19', 'บริษัท เรเซอร์การไฟฟ้า (ประเทศไทย) จำกัด', 'ซื้อโคมไฟถนน LED', '', '24,075.00', 'หนังสือค้ำประกันเลขที่ ค.0321 ', '0000-00-00', '2020-10-02', '', '2021-02-09', '555'),
(120, 'CNTR-1888/62', '2019-09-27', 'บริษัท โชคอำนวยอีควิปเม้นท์ จำกัด', 'ซื้อรถยนต์บรรทุก ชนิด 6 ล้อ แบบเทท้าย', '', '163,675.00', 'เช็คเลขที่ 00512289', '0000-00-00', '2020-01-22', '', '2021-02-09', '556'),
(121, 'CNTR-1889/62', '2019-09-27', 'บริษัท เจ ซอฟท์ จำกัด', 'ซื้อเครื่องเสียง', '', '4,641.00', 'หนังสือค้ำประกันเลขที่ 02178191000342 ', '0000-00-00', '2020-11-26', '', '2021-02-09', '557'),
(122, 'CNTR-1892/62', '2019-09-27', 'บริษัท ธนกุลดีไซน์ แอนด์ เดคคอร์ จำกัด', 'จ้างติดตั้งไฟฟ้าส่องสว่างบริเวณทางแยกสาธารณะถนนภายในเขตเทศบาล', '', '24,300.00', 'หนังสือค้ำประกันเลขที่ 02120191000324 ', '0000-00-00', '2020-10-26', '', '2021-02-09', '558'),
(123, 'CNTR-0232/63', '2019-11-29', 'บริษัท พกฤษ จำกัด', 'จ้างติดตั้งไฟฟ้าส่องสว่างสวนสาธารณะ ซอยรังสิต-ปทุมธานี 8', '', '23,720.00', 'เงินสด  ', '0000-00-00', '2020-12-28', '', '2021-02-09', '559'),
(124, 'CNTR-0264/63', '2019-12-12', 'บริษัท สุทธิพงษ์ ไลท์ติ้ง จำกัด', 'ซื้อโคมไฟฟ้าถนนครุภัณฑ์ไฟฟ้าและวิทยุ', '', '34,000.00', 'เงินสด  ', '0000-00-00', '2021-02-06', '', '2021-02-09', '560'),
(125, 'CNTR-0397/63', '2020-01-07', 'บริษัท พกฤษ จำกัด', 'จ้างเหมาซ่อมแซมเครื่องออกกำลังกายและเครื่องเล่นสนาม', '', '17,300.00', 'เงินสด ', '0000-00-00', '2021-01-29', '', '2021-02-09', '561'),
(126, 'CNTR-0939/62', '2019-08-05', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมแซมรถแบคโฮ ทะเบียน ตค-65', '241,798.60', '12,100.00', 'เงินสด', '2019-05-10', '2019-08-10', '', '2021-03-03', '882'),
(127, 'CNTR-1161/63', '2020-10-06', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 2 คัน ทะเบียน บง 2312 และ บง 6539', '304,564.80', '15,300.00', 'เงินสด', '2020-06-15', '2020-09-15', '', '2021-03-03', '883'),
(128, 'CNTR-1515/63', '2020-08-31', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถบรรทุกขยะคอนเทรนเนอร์ ทะเบียน 82-7262', '172,901.30', '8,650.00', 'เงินสด', '2020-09-08', '2020-12-08', '', '2021-03-03', '884'),
(129, 'CNTR-1569/63', '2020-09-16', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 3 คัน ทะเบียน  82-3255, 82-1806, 82-3253 ', '164,405.50', '8,230.00', 'เงินสด', '2020-09-16', '2020-12-16', '', '2021-03-03', '885'),
(130, 'CNTR-1570/63', '2020-09-14', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 3 คัน ทะเบียน บง-6538, บง-247, 82-0562', '168,043.50', '8,410.00', 'เงินสด', '2020-09-17', '2020-12-17', '', '2021-03-03', '886'),
(131, 'CNTR-0215/64', '2020-11-27', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์ 2 (028 51 0006) และ เบอร์ 4 (028 51 0008)', '273,081.12', '13,655.00', 'เงินโอน', '2020-12-03', '2021-03-03', '', '2021-03-03', '887'),
(132, 'CNTR-0216/64', '2020-11-27', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์ 11 (028 54 0015)', '209,613.00', '10,481.00', 'เงินโอน', '2020-12-01', '2021-03-01', '', '2021-03-03', '888'),
(133, 'CNTR-0223/64', '2020-11-27', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถบรรทุก 10 ล้อ ทะเบียน 81-6822', '268,570.00', '13,429.00', 'เงินโอน', '2020-12-03', '2021-03-03', '', '2021-03-03', '889'),
(134, 'CNTR-1227/63', '2020-07-01', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 6 คัน  ทะเบียน นค-4891, บ-3502, 81-6297, 82-3252, 82-3255 และเครื่องตบดิน(201 59 0005)', '482,366.70', '24,200.00', 'เงินสด', '2020-07-08', '2020-10-08', '', '2021-03-18', '1112'),
(135, 'CNTR-1378/63', '2020-08-05', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมแซมรถขยะคอนเทรนเนอร์ 6 ล้อ ทะเบียน บง-6539', '107,866.70', '5,400.00', 'เงินสด', '2020-08-10', '2020-11-10', '', '2021-03-18', '1113'),
(136, 'CNTR-1445/63', '2020-08-20', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถดูดโคลนเลน ทะเบียน 83-1306', '105,106.10', '5,260.00', 'เงินสด', '2020-08-24', '2020-11-24', '', '2021-03-18', '1114'),
(137, 'CNTR-1446/63', '2020-08-20', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถตักหน้า-ขุดหลัง JCB ทะเบียน ต-0346', '130,807.50', '6,550.00', 'เงินสด', '2020-08-26', '2020-11-26', '', '2021-03-18', '1115'),
(138, 'CNTR-1461/63', '2020-08-24', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถแมคโคร ทะเบียน ต-0345 (019 37 0001)', '127,865.00', '6,400.00', 'เงินสด', '2020-08-27', '2020-11-27', '', '2021-03-18', '1116'),
(139, 'CNTR-1463/63', '2020-08-24', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถบรรทุก 10 ล้อ ทะเบียน 81-6821(013 44 0009)', '198,367.30', '9,920.00', 'เงินสด', '2020-09-09', '2020-12-09', '', '2021-03-18', '1117'),
(140, 'CNTR-1464/63', '2020-08-24', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถแบคโฮ ทะเบียน ตค 217', '125,752.00', '6,300.00', 'เงินสด', '2020-08-27', '2020-11-27', '', '2021-03-18', '1118'),
(141, 'CNTR-0122/64', '2020-11-05', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมแซมรถขยะคอนเทรนเนอร์ 6 ล้อ ทะเบียน 82-6916', '134,499.00', '6,730.00', 'เงินสด', '2020-11-09', '2021-02-09', '', '2021-03-18', '1119'),
(142, 'CNTR-0123/64', '2020-11-05', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถบรรทุก 6 ล้อ ทะเบียน น-9724(017 37 0002)', '114,222.50', '5,720.00', 'เงินสด', '2020-11-09', '2021-02-09', '', '2021-03-18', '1120'),
(143, 'CNTR-0124/64', '2020-11-05', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถบรรทุก 10 ล้อ ทะเบียน 81-6822 ', '170,889.70', '8,550.00', 'เงินสด', '2020-11-09', '2021-02-09', '', '2021-03-18', '1121'),
(144, 'CNTR-0171/64', '2020-11-06', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมแซมรถขยะคอนเทรนเนอร์ ทะเบียน 82-4299', '118,812.80', '5,950.00', 'เงินสด', '2020-11-23', '2021-02-23', '', '2021-03-18', '1122'),
(145, 'CNTR-0183/64', '2020-11-18', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'จ้างซ่อมเครื่องอัดขยะมูลฝอยเครื่องที่ 2 (329 54 0002)', '359,413.00', '17,980.00', 'เงินโอน', '2020-12-04', '2021-03-04', '', '2021-03-24', '1187'),
(146, 'CNTR-0271/64', '2020-12-04', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'จ้างซ่อมตู้บรรทุกขยะ 2 ตู้ เบอร์ 19 (028 54 0023) และ เบอร์ 20 (028 54 0024) ', '418,444.90', '20,923.00', 'เงินโอน', '2020-12-09', '2021-03-09', '', '2021-03-24', '1188'),
(147, 'CNTR-0272/64', '2020-12-04', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์ 6 (028 51 0010)', '304,243.80', '15,213.00', 'เงินโอน', '2020-12-09', '2021-03-09', '', '2021-03-24', '1189'),
(148, 'CNTR-1888/62', '2019-09-27', 'บริษัท โชคอำนวยอีควิปเม้นท์ จำกัด', 'ประกวดราคาซื้อครุภัณฑ์ยานพาหนะและขนส่ง รถยนต์บรรทุก ชนิด 6 ล้อ แบบเทท้าย ด้วยวิธีประกวดราคาอิเล็กทรอนิกส์ (e-bidding) ', '3,273,500.00', '163,675.00', 'เช็คเลขที่ 00512289 ', '2019-12-12', '2020-12-12', '', '2021-04-19', '1348'),
(149, 'CNTR-0550/63', '2020-02-06', 'บริษัท วิรุฬห์ แอนด์ เกวนเนส จำกัด', 'ประกวดราคาซื้อดำเนินโครงการติดตั้งเครื่องสูบน้ำ ซอยรังสิต-ปทุมธานี 15(ท้ายซอย)', '2,540,000.00', '127,000.00', 'หนังสือค้ำประกันเลขที่ 100029997017 ', '2020-04-03', '2021-04-03', '', '2021-04-19', '1349'),
(150, 'CNTR-0890/63', '2020-04-07', 'บริษัท พกฤษ จำกัด', 'จ้างเหมาซ่อมแซมฟุตบาททางเท้า บริเวณปากซอยรังสิต-นครนายก 36', '379,400.00', '9,000.00', 'เงินสด', '2020-04-06', '2021-04-06', '', '2021-04-19', '1350'),
(151, 'CNTR-0744/63', '2020-03-10', 'บริษัท อ.นวรัตน์ จำกัด', 'จ้างเหมาซ่อมแซม คอสะพาน พื้นที่จอดรถ และถนนแอสฟัลติกคอนกรีตในความรับผิดชอบของเทศบาลนครรังสิต', '487,800.00', '24,390.00', 'เงินสด', '2020-04-09', '2021-04-09', '', '2021-04-19', '1351'),
(152, 'CNTR-0504/63', '2020-01-28', 'ห้างหุ้นส่วนจำกัด มัลติซัพพลาย อีควิปเมนท์ 1998', 'ซื้อครุภัณฑ์สำนักงาน(โพเดียมไม้ จำนวน 1 ตัว)', '35,000.00', '1,750.00', 'เงินสด', '2020-02-14', '2021-02-14', '', '2021-04-19', '1352'),
(153, 'CNTR-0407/63', '2020-01-08', 'ห้างหุ้นส่วนจำกัด ปทุมธานีวัสดุภัณฑ์ ', 'ซื้อครุภัณฑ์สำนักงาน (เก้าอี้โครงเหล็กบุนวม จำนวน 100 ตัว)', '62,500.00', '3,125.00', 'เงินสด', '2020-02-06', '2021-02-06', '', '2021-04-19', '1353'),
(154, 'CNTR-0056/64', '2020-10-21', 'บริษัท พกฤษ จำกัด', 'จ้างเหมาซ่อมแซมเครื่องออกกำลังกายและเครื่องเล่นสนาม', '374,607.00', '18,731.00', 'เงินสด', '2020-11-13', '2021-02-13', '', '2021-04-23', '1418'),
(155, 'CNTR-0234/64', '2020-11-30', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมแซมรถดูดโคลนเลน ทะเบียน 82-0562', '198,260.30', '9,920.00', 'เงินสด', '2020-12-04', '2021-03-04', '', '2021-04-23', '1419'),
(156, 'CNTR-0283/64', '2020-12-08', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมแซมรถดูดโคลนเลน ทะเบียน บง-247 (เลขครภันฑ์ 035-40-0001)', '198,474.30', '9,930.00', 'เงินสด', '2020-12-14', '2021-03-14', '', '2021-04-23', '1420'),
(157, 'CNTR-0302/64', '2020-12-14', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมเครื่องสูบน้ำ 5 เครื่อง', '110,295.60', '5,550.00', 'เงินสด', '2020-12-21', '2021-03-21', '', '2021-04-23', '1421'),
(158, 'CNTR-0303/64', '2020-12-14', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถขยะคอนเทรนเนอร์ ทะเบียน 82-4299', '109,921.10', '5,500.00', 'เงินสด', '2020-12-17', '2021-03-17', '', '2021-04-23', '1422'),
(159, 'CNTR-0341/64', '2020-12-23', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 2 คัน ทะเบียน 82-4298 และ ทะเบียน 82-7263', '192,748.90', '9,550.00', 'เงินสด', '2020-12-28', '2021-03-28', '', '2021-04-23', '1423'),
(160, 'CNTR-0775/63', '2020-03-17', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'จ้างเหมาซ่อมแซมฟุตบาททางเท้า บริเวณหมู่บ้านเอื้ออาทรรังสิต', '498,500.00', '24,925.00', 'เงินสด', '2020-04-30', '2021-04-30', '', '2021-04-30', '1504'),
(161, 'CNTR-0575/64', '2021-02-01', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถขยะคอนเทนเนอร์ 6 ล้อ ทะเบียน บง-2312 (เลขครุภัณฑ์ 011 40 0019)', '285,850.50', '14,300.00', 'โอนเงิน', '2021-02-08', '2021-05-08', '', '2021-05-19', '1636'),
(162, 'CNTR-0583/64', '2021-02-01', 'บริษัท พกฤษ จำกัด', 'จ้างซ่อมแซมเครื่องออกกำลังกาย ภายในเขตเทศบาลนครรังสิต', '426,288.00', '21,400.00', 'เงินสด', '2021-02-17', '2021-05-17', '', '2021-05-19', '1637'),
(163, 'CNTR-0591/64', '2021-02-03', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถขยะคอนเทนเนอร์ ทะเบียน 82-4300 (เลขครุภัณฑ์ 014 51 0003)', '234,158.80', '11,710.00', 'เงินสด', '2021-02-17', '2021-05-08', '', '2021-05-19', '1638'),
(164, 'CNTR-0592/64', '2021-02-03', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถ 3 คันทะเบียน บ-3830, ตค-65 และ ตค-145', '395,662.64', '19,784.00', 'โอนเงิน', '2021-02-09', '2021-05-09', '', '2021-05-19', '1639'),
(165, 'CNTR-0594/64', '2021-02-03', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถแมคโคร ทะเบียน ต-045 (เลขครุภัณฑ์ 019 37 0001)', '376,907.50', '18,846.00', 'โอนเงิน', '2021-02-08', '2021-05-08', '', '2021-05-19', '1640'),
(166, 'CNTR-0409/63', '2020-01-08', 'ห้างหุ้นส่วนจำกัดปทุมธานี วัสดุภัณฑ์', 'ซื้อครุภัณฑ์ไฟฟ้าและวิทยุ (โคมไฟฟ้า ชนิดเมทัลฮาไลท์ จำนวน 50 ชุด)', '160,000.00', '8,000.00', 'เงินสด', '2020-02-06', '2021-02-06', '', '2021-05-21', '1713'),
(167, 'CNTR-0650/64', '2021-02-15', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถยนต์ 5 คัน ทะเบียน 81-6297, บ-4895, ตค-127, 83-5142, 82-1806', '341,458.40', '17,080.00', 'เงินสด', '2021-02-22', '2021-05-22', '', '2021-05-28', '1750'),
(168, 'CNTR-0651/64', '2021-02-15', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จางซ่อมรถ 2 คันทะเบียน น-7703 และ 81-5405', '356,320.00', '17,820.00', 'เงินสด', '2021-02-22', '2021-05-22', '', '2021-05-28', '1751'),
(169, 'CNTR-0652/64', '2021-02-15', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ ทะเบียน 82-4298  (เลขครุภันฑ์ 014 51 0001)', '252,915.90', '12,650.00', 'เงินสด', '2021-02-22', '2021-05-22', '', '2021-05-28', '1752'),
(170, 'CNTR-0660/64', '2021-02-16', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถขยะคอนเทรนเนอร์ ทะเบียน บง-6539 เลขครุภันฑ์ 011 42 0022', '306,052.10', '15,310.00', 'เงินสด', '2021-02-24', '2021-05-24', '', '2021-05-28', '1753'),
(171, 'CNTR-0663/64', '2021-02-16', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถขุดตักหน้าขุดหลัง ทะเบียน ต-0346 (เลขครุภันฑ์ 018 37 0002)', '256,136.60', '13,598.00', 'โอนเงิน', '2021-02-22', '2021-05-22', '', '2021-05-28', '1754'),
(172, 'CNTR-0675/64', '2021-02-17', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 2 คัน ทะเบียน 82-4300 และ ทะเบียน 82-4299', '443,964.40', '22,200.00', 'เงินสด', '2021-02-22', '2021-05-22', '', '2021-05-28', '1755'),
(173, 'CNTR-0676/64', '2021-02-17', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 2 คัน ทะเบียน 81-6822 และ บง-247', '349,670.65', '17,500.00', 'เงินสด', '2021-02-22', '2021-05-22', '', '2021-05-28', '1756'),
(174, 'CNTR-0677/64', '2021-02-17', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถบรรทุก 10 ล้อ ทะเบียน 81-6823 (013 44 0008)', '222,442.30', '11,130.00', 'เงินสด', '2021-02-22', '2021-05-22', '', '2021-05-28', '1757'),
(175, 'CNTR-2048/61', '2018-09-27', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัดชั่น', 'จ้างเหมาปรับปรุงพื้นที่ติดตั้งตู้คอนเทรนเนอร์สวนสาธารณะ ซอยรังสิต-ปทุมธานี 14 ซอย 16', '167,000.00', '8,900.00', 'เงินสด', '2018-10-26', '2020-10-26', '', '2021-05-31', '1766'),
(176, 'CNTR-2045/61', '2018-11-26', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัดชั่น', 'จ้างเหมาค่าแรงก่อสร้างหลังคาโรงเก็บพัสดุ ซอยรังสิต-นครนายก 56 (หลังวัดจันทร์สุข)', '396,700.00', '19,900.00', 'เงินสด', '2018-11-22', '2020-11-22', '', '2021-05-31', '1767'),
(177, 'CNTR-0511/62', '2019-02-05', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัดชั่น', 'จ้างเหมาวางระบบน้ำสปริงเกอร์ รดน้ำต้นไม้ทางเข้าบริเวณแพตลาดน้ำนครรังสิต', '', '5,145.00', 'เงินสด', '2021-03-08', '2021-03-08', '', '2021-05-31', '1768'),
(178, 'CNTR-1988/61', '2018-09-18', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัดชั่น', 'จ้างเหมาปรับปรุงไหล่ทาง ซอยรังสิต-นครนายก 56', '', '495,000.00', 'เงินสด', '0000-00-00', '2019-10-16', '', '2021-05-31', '1769'),
(179, 'CNTR-1910/61', '2018-09-11', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'จ้างเหมาทาสีรั้วรอบสระว่ายน้ำพร้อมกันสาดเหล็กสระว่ายน้ำเทศบาลนครรังสิต', '', '6,900.00', 'เงินสด', '0000-00-00', '2020-11-13', '', '2021-06-08', '1836'),
(180, 'CNTR-0416/62', '2019-01-17', 'บริษัท ชินาภัค คอนกรีต จำกัด', 'ประกวดราคาจ้างก่อสร้างโครงการก่อสร้างถนน คสล. ซอยแยกย่อยเชื่อมต่อระหว่าง ซอยรังสิต-ปทุมธานี 27 กับซอยรังสิต-ปทุมธานี 29 ซอย 2', '2,711,157.37', '147,167.00', 'หนังสือค้ำประกันเลขที่ 100022239613', '0000-00-00', '2021-05-23', '', '2021-06-08', '1837'),
(181, 'CNTR-0568/62', '2019-02-13', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'จ้างซ่อมโครงสร้างตลาดน้ำนครรังสิต', '', '18,325.00', 'เงินสด', '0000-00-00', '2019-06-20', '', '2021-06-08', '1838'),
(182, 'CNTR-0590/64', '2021-02-02', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถรถ 6 คัน(ทะเบียน น-5755, 82-3255, บ-3502, 81-6297, นค-4891, 82-7515)', '288,750.20', '14,440.00', 'เงินสด', '2021-02-09', '2021-05-09', '', '2021-06-09', '1857'),
(183, 'CNTR-0611/64', '2021-02-05', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'จ้างซ่อมรถแมคโคร ทะเบียน ตค-50 เลขครุภัณฑ์ 018 41 0003', '163,035.90', '8,152.00', 'เงินสด', '2021-02-11', '2021-05-11', '', '2021-06-09', '1858'),
(184, 'CNTR-0623/64', '2021-02-08', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถยนต์ จำนวน 2 คัน (ทะเบียน ตค-134 และทะเบียน 81-7281)', '212,213.10', '10,620.00', 'เงินสด', '2021-02-15', '2021-05-15', '', '2021-06-09', '1859'),
(185, 'CNTR-0638/64', '2021-02-10', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์ 8 (028 51 0012)', '206,456.50', '10,484.00', 'เงินสด', '2021-02-24', '2021-05-24', '', '2021-06-09', '1860'),
(186, 'CNTR-0639/64', '2021-02-10', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์ 13 (028 54 0017)', '363,318.50', '18,434.00', 'เงินสด', '2021-02-24', '2021-05-24', '', '2021-06-09', '1861'),
(187, 'CNTR-0662/64', '2021-02-16', 'บริษัท เคลฟเวอร์ ซอร์วิส จำกัด', 'จ้างซ่อมรถขยะคอนเทนเนอร์ 6 ล้อ ทะเบียน บง-6538', '239,680.00', '12,500.00', 'โอนเงิน', '2021-02-22', '2021-05-22', '', '2021-06-09', '1862'),
(188, 'CNTR-0702/64', '2021-02-23', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถขยะคอนเทนเนอร์ 6 ล้อ ทะเบียน บง-6539', '265,039.00', '13,252.00', 'โอนเงิน', '2021-03-01', '2021-06-01', '', '2021-06-10', '1868'),
(189, 'CNTR-0704/64', '2021-02-23', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถบรรทุกซานต่ำ ทะเบียน 82-3255 เลขครุภัณฑ์ 002 50 0008', '315,971.00', '15,800.00', 'โอนเงิน', '2021-03-01', '2021-06-01', '', '2021-06-10', '1869'),
(190, 'CNTR-0724/64', '2021-03-01', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถบรรทุก 10 ล้อ ทะเบียน 81-6821 (เลขครุภัณฑ์ 013 44 0009)', '299,717.70', '15,000.00', 'เงินสด', '2021-03-05', '2021-06-05', '', '2021-06-10', '1870'),
(191, 'CNTR-0736/64', '2021-03-02', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถบรรทุก 10 ล้อ ทะเบียน 81-5405 ( 013 42 0001)', '220,002.70', '11,010.10', 'เงินสด', '2021-03-08', '2021-06-08', '', '2021-06-10', '1871'),
(192, 'CNTR-0738/64', '2021-03-02', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 2 คัน ทะเบียน บง-6538 และทะเบียน บ-3830', '366,678.30', '18,350.00', 'เงินสด', '2021-03-08', '2021-06-08', '', '2021-06-10', '1872'),
(193, 'CNTR-0746/64', '2021-03-04', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'จ้างซ่อมรถแมคโคร ทะเบียน ตค-127 เลขครุภัณฑ์ 018 46 0005', '185,580.80', '9,300.00', 'เงินสด', '2021-03-10', '2021-06-10', '', '2021-06-10', '1873'),
(194, 'CNTR-1086/63', '2020-05-20', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'จ้างเหมาซ่อมแซมถนนคอนกรีตเสริมเหล็ก ซอยรังสิต-ปทุมธานี 31', '484,700.00', '24,235.00', 'เงินสด', '2020-06-10', '2021-06-10', '', '2021-06-10', '1874'),
(195, 'CNTR-0404/64', '2021-01-08', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถและเครื่องสูบน้ำ(055 53 0224, 82-3252, ถข 1, 81-6297, 82-3255, บท 4581, บต-3847)', '427,518.50', '21,400.00', 'เงินสด', '2021-01-11', '2021-04-11', '', '2021-06-17', '1943'),
(196, 'CNTR-0527/64', '2021-01-26', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถ 2 คัน (ทะเบียน 81-7281 และ บฉ-6940)', '249,930.60', '12,500.00', 'เงินสด', '2021-02-01', '2021-05-01', '', '2021-06-17', '1944'),
(197, 'CNTR-0576/64', '2021-02-01', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถบรรทุก 10 ล้อ ทะเบียน 81-6821 (เลขครุภัณฑ์ 013 44 0009)', '106,893.00', '5,350.00', 'เงินสด', '2021-02-05', '2021-05-05', '', '2021-06-17', '1945'),
(198, 'CNTR-0597/64', '2021-02-03', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถบรรทุก 10 ล้อ ทะเบียน 81-6823 (เลขครุภัณฑ์ 013 44 0008)', '141,989.00', '7,100.00', 'เงินสด', '2021-02-08', '2021-05-08', '', '2021-06-17', '1946'),
(199, 'CNTR-0649/64', '2021-02-15', 'ห้างหุ้นส่วนจำกัด นาคนิกร', 'จ้างซ่อมรถขยะคอนเทรนเนอร์ 6 ล้อ ทะเบียน บ-3830', '169,798.30', '8,500.00', 'เงินสด', '2021-02-22', '2021-05-22', '', '2021-06-17', '1947'),
(200, 'CNTR-0071/64', '2020-10-26', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถแบคโฮ ทะเบียน ตค 65', '209,292.00', '10,465.00', 'เงินสด', '2020-11-02', '2021-02-02', '', '2021-06-24', '2014'),
(201, 'CNTR-0095/64', '2020-10-29', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างเหมาซ่อมแซมเครื่องอัดขยะมูลฝอย 2 เครื่อง (เลขครุภัณฑ์ 329 51 0001 และ 329 54 0002)', '153,117.00', '7,656.00', 'เงินสด', '2020-11-04', '2021-02-04', '', '2021-06-24', '2015'),
(202, 'CNTR-0743/64', '2021-03-03', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถบรรทุก 10 ล้อ ทะเบียน น-4340', '112,885.00', '5,650.00', 'เงินสด', '2021-03-08', '2021-06-08', '', '2021-06-24', '2016'),
(203, 'CNTR-0763/64', '2021-03-08', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'จ้างซ่อมรถ 2 คัน ทะเบียน บง-2312 และ ทะเบียน ต-0348', '409,713.70', '20,486.00', 'เงินสด', '2021-03-15', '2021-06-15', '', '2021-06-24', '2017');

-- --------------------------------------------------------

--
-- Table structure for table `purchase_process`
--

CREATE TABLE `purchase_process` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `purchase_process`
--

INSERT INTO `purchase_process` (`id`, `name`) VALUES
(1, 'วิธีประกาศเชิญชวนทั่วไป-วิธีตลาดอิเล็กทรอนิกส์'),
(2, 'วิธีประกาศเชิญชวนทั่วไป-วิธีประกวดราคาอิเล็กทรอนิกส์'),
(3, 'วิธีประกาศเชิญชวนทั่วไป-วิธีสอบราคา'),
(4, 'วิธีคัดเลือก'),
(5, 'วิธีเฉพาะเจาะจง');

-- --------------------------------------------------------

--
-- Table structure for table `rangsit_budget`
--

CREATE TABLE `rangsit_budget` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `rangsit_budget`
--

INSERT INTO `rangsit_budget` (`id`, `name`) VALUES
(1, 'เงินสะสม'),
(2, 'เงินยุทธศาสตร์');

-- --------------------------------------------------------

--
-- Table structure for table `rangsit_department`
--

CREATE TABLE `rangsit_department` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `rangsit_department`
--

INSERT INTO `rangsit_department` (`id`, `name`) VALUES
(1, 'สำนักการช่าง'),
(2, 'สำนักการคลัง'),
(3, 'กองสาธารณะสุข'),
(4, 'กองการศึกษา');

-- --------------------------------------------------------

--
-- Table structure for table `service_contract`
--

CREATE TABLE `service_contract` (
  `id` int(11) NOT NULL,
  `contract_id` varchar(14) NOT NULL,
  `date_regis` date NOT NULL,
  `contract_start` date NOT NULL,
  `contract_end` date NOT NULL,
  `owner` varchar(100) NOT NULL,
  `budget_type` varchar(100) NOT NULL,
  `contractor` varchar(255) NOT NULL,
  `process` varchar(50) NOT NULL,
  `job_detail` varchar(255) NOT NULL,
  `project_value` double(10,2) NOT NULL,
  `guarantee_value` double(10,2) NOT NULL,
  `guarantee_type` varchar(50) NOT NULL,
  `date_accept` date NOT NULL,
  `conditions` varchar(255) NOT NULL,
  `due_date` date NOT NULL,
  `status` varchar(100) NOT NULL,
  `remark` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `service_contract`
--

INSERT INTO `service_contract` (`id`, `contract_id`, `date_regis`, `contract_start`, `contract_end`, `owner`, `budget_type`, `contractor`, `process`, `job_detail`, `project_value`, `guarantee_value`, `guarantee_type`, `date_accept`, `conditions`, `due_date`, `status`, `remark`) VALUES
(1, 'CNTR-1234/335', '2021-01-12', '2564-01-13', '2564-11-25', 'สำนักการช่าง', 'เงินยุทธศาสตร์', 'บริษัท มหาวงษ์ จำกัด', 'เฉพาะเจาะจง', 'ทดสอบ', 5000000.00, 6000.00, 'เงินสด', '2564-01-12', '30 เดือน', '2564-02-06', 'ทดสอบ', 'AD'),
(2, 'CNTR-1334/64', '2021-01-12', '2021-01-12', '2021-01-20', 'สำนักการคลัง', 'เงินสะสม', 'test', 'วิธีประกาศเชิญชวนทั่วไป-วิธีสอบราคา', 'fff', 12.00, 45.00, 'ff', '2021-01-12', 'gg', '2021-01-20', 'tt', ''),
(3, 'CNTR-4544/99', '2021-01-12', '2020-12-30', '2021-01-20', 'สำนักการช่าง', 'เงินสะสม', 'ty', 'ty45', 'rg', 0.00, 0.00, 'rg', '0000-00-00', 'rg', '0000-00-00', 'rg', 'rg'),
(4, 'CNTR-1122/45', '2021-01-12', '2021-01-13', '2021-01-16', 'สำนักการช่าง', 'เงินสะสม', 'ผดุง เอ็นเนียริ่ง', 'วิธีเฉพาะเจาะจง', 'ทำ 3 รอบ 999', 999999.00, 221.00, 'clash', '2021-01-20', '1 ปี', '2021-01-19', 'กำลังดำเนินการ', 'THES'),
(5, 'CNTR-8888/11', '2021-02-04', '2021-02-03', '2021-02-04', 'สำนักการช่าง', 'เงินสะสม', 'ascvsa', 'วิธีประกาศเชิญชวนทั่วไป-วิธีตลาดอิเล็กทรอนิกส์', 'RRRRRRRRRR', 4444444.00, 0.00, 'xdvsd', '2021-02-10', 'svdsdv', '2021-02-02', 'eeeeeeeee', 'sdvds'),
(6, 'CNTR-8888/000', '2021-02-10', '2021-02-03', '2021-02-11', 'กองสาธารณะสุข', 'เงินยุทธศาสตร์', 'ergtregtre', 'วิธีประกาศเชิญชวนทั่วไป-วิธีประกวดราคาอิเล็กทรอนิก', 'eferg', 244.00, 234.00, 'เงินสด', '2021-02-25', '3 เดือน', '2021-02-23', 'ergre', 'ergerge'),
(7, 'CNTR-00001/64', '2564-02-01', '2564-02-05', '2564-02-02', 'กองสาธารณะสุข', 'เงินยุทธศาสตร์', 'SK Engineering', 'วิธีประกาศเชิญชวนทั่วไป-วิธีตลาดอิเล็กทรอนิกส์', 'Asphaltic congrete', 100000.00, 30000.00, 'เงินโอน', '2564-02-27', '3 เดือน', '2564-02-28', 'แล้วเสร็จ', ''),
(8, 'CNTR-0002/20', '2021-02-04', '2021-02-11', '2021-02-19', 'สำนักการช่าง', 'เงินสะสม', 'PTT OIL and Retail public companee', 'วิธีประกาศเชิญชวนทั่วไป-วิธีตลาดอิเล็กทรอนิกส์', 'test to insert in todatabase', 99900.00, 1000.00, 'iBanking Transfer', '2021-02-24', '1 year ', '2021-02-28', 'lo sample', 'accacxasx'),
(12, 'CNTR-1185/56', '2021-02-25', '2021-02-11', '2021-03-04', 'สำนักการช่าง', 'เงินสะสม', 'ascsa', 'วิธีประกาศเชิญชวนทั่วไป-วิธีตลาดอิเล็กทรอนิกส์', 'acac', 1666.00, 666.00, '66', '1966-01-12', 'ytt', '2021-02-09', 'rr5gr', 'rhrr'),
(26, 'zscsac', '2021-02-03', '2021-02-19', '2021-02-27', 'สำนักการช่าง', 'เงินสะสม', 'sdsz', 'วิธีประกาศเชิญชวนทั่วไป-วิธีตลาดอิเล็กทรอนิกส์', 'zsvs', 2343.00, 444.00, 'sfs', '2021-02-08', 'sdvsd', '2021-02-23', 'sds', 'sgvsge'),
(27, 'yyyyy', '2021-02-02', '2021-02-09', '2021-02-19', 'สำนักการช่าง', 'เงินสะสม', 'bbbbbb', 'วิธีประกาศเชิญชวนทั่วไป-วิธีตลาดอิเล็กทรอนิกส์', 'vvvvvvvvv', 222.00, 222.00, 'ggg', '2021-02-10', 'srfrsf', '2021-02-08', 'sfsr', 'sfrs'),
(28, 'sasa', '2021-02-09', '2021-02-24', '2021-02-26', 'สำนักการช่าง', 'เงินสะสม', 'ascxsa', 'วิธีประกาศเชิญชวนทั่วไป-วิธีตลาดอิเล็กทรอนิกส์', 'ACXA', 12222.00, 31222.00, '12', '2021-02-11', 'WEFDW', '2021-02-19', 'WEDW', 'WEF'),
(29, 'CNTR7777/88', '2021-02-09', '2021-02-17', '2021-02-12', 'กองการศึกษา', 'เงินสะสม', 'ASCAS', 'วิธีคัดเลือก', 'ASCXSA', 1000.00, 778.00, 'UIKU', '2021-02-23', 'ADXAC', '2021-02-10', 'แก้ไข', 'แก้ไข'),
(30, 'TETS112', '2021-02-09', '2021-02-28', '2021-02-17', 'กองสาธารณะสุข', 'เงินสะสม', 'joh biden', 'วิธีประกาศเชิญชวนทั่วไป-วิธีตลาดอิเล็กทรอนิกส์', 'job1', 1000000.00, 10000.00, '323322', '2021-02-26', 'werf', '2021-02-25', 'ewrcwe', 'ewv'),
(31, 'JOB3', '2021-02-10', '2021-02-24', '2021-02-24', 'สำนักการช่าง', 'เงินสะสม', 'afaf', 'วิธีประกาศเชิญชวนทั่วไป-วิธีตลาดอิเล็กทรอนิกส์', 'svsva', 1213.00, 43332.00, '232', '2021-02-25', 'fr', '2021-02-08', 'wsfe', 'wfw'),
(32, 'CNTR-1175/22', '2021-02-01', '2021-02-26', '2021-02-24', 'กองสาธารณะสุข', 'เงินสะสม', 'FRWEEW', 'วิธีประกาศเชิญชวนทั่วไป-วิธีประกวดราคาอิเล็กทรอนิก', 'EWW', 10000.00, 8999.00, '000', '2021-03-04', '8797', '2021-03-02', 'UILUI', 'UILU'),
(33, 'CNTR-4054/63', '2021-02-01', '1899-11-30', '2021-02-17', 'สำนักการช่าง', 'เงินสะสม', 'serea', 'วิธีประกาศเชิญชวนทั่วไป-วิธีตลาดอิเล็กทรอนิกส์', 'seges', 1334.00, 2344.00, '234r24', '2021-02-23', 'ewgw', '2021-02-08', 'wegw', 'wgew'),
(34, 'CNTR-6666/65', '2564-02-16', '2564-02-01', '2564-02-27', 'สำนักการช่าง', 'เงินยุทธศาสตร์', 'COM7', 'วิธีเฉพาะเจาะจง', 'เปลี่ยนบอร์ด', 80000.00, 3000.00, 'เงินสด', '2564-02-01', 'ึ7 เดือน', '2564-12-04', 'ปกติ', 'ไม่มี'),
(35, 'CNLL-001/66', '2564-02-18', '2564-02-01', '2564-02-27', 'สำนักการคลัง', 'เงินยุทธศาสตร์', 'LPN', 'วิธีประกาศเชิญชวนทั่วไป-วิธีประกวดราคาอิเล็กทรอนิก', 'ConDO Lumpinee', 20000000.00, 300.00, 'clash Havy Duty', '2564-02-03', '30 day', '2564-02-27', 'Test ECO', 'Test ELO'),
(36, 'SCdsa', '2564-02-19', '2564-02-18', '2564-02-18', 'สำนักการช่าง', 'เงินสะสม', 'ACSA', 'วิธีประกาศเชิญชวนทั่วไป-วิธีตลาดอิเล็กทรอนิกส์', 'SAcsa', 1212121.00, 1212.00, 'sacsac', '2564-02-18', 'sdcs', '2564-02-17', 'wedw', 'wdw'),
(37, 'CN-TR0256', '2564-12-28', '2564-12-28', '2564-12-29', 'สำนักการคลัง', 'เงินยุทธศาสตร์', 'tedr', 'วิธีประกาศเชิญชวนทั่วไป-วิธีประกวดราคาอิเล็กทรอนิก', 'dss', 2000.00, 30000.00, 'เงินสด', '2564-12-28', '1 ปี', '2564-12-30', 'จบงาน', 'หดไได');

-- --------------------------------------------------------

--
-- Table structure for table `service_contract_story`
--

CREATE TABLE `service_contract_story` (
  `id` int(11) NOT NULL,
  `service_ref` varchar(14) NOT NULL,
  `story_detail` text NOT NULL,
  `user_post` varchar(100) NOT NULL,
  `date_post` datetime NOT NULL,
  `file_upload_1` varchar(255) NOT NULL,
  `file_upload_2` varchar(255) NOT NULL,
  `file_upload_3` varchar(255) NOT NULL,
  `file_upload_4` varchar(255) NOT NULL,
  `file_upload_5` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `service_contract_story`
--

INSERT INTO `service_contract_story` (`id`, `service_ref`, `story_detail`, `user_post`, `date_post`, `file_upload_1`, `file_upload_2`, `file_upload_3`, `file_upload_4`, `file_upload_5`) VALUES
(1, 'CNTR-1122/45', 'ทดสอบครั้งที่ 1', 'admin', '2021-01-20 14:42:44', 'ภาษาไทย.pdf', '', '', '', ''),
(2, 'CNTR-1122/45', 'ทดสอบครั้งที่ 2', 'admin', '2021-01-20 14:49:04', 'แบบฟอร์ม เบี้ยเลี้ยง ธ.ค 62.xlsx', 'Compare_List_Contractor.xlsx', '11.txt', 'THAN5330.JPG', 'DEV_TIMELINE.xls'),
(3, 'CNTR-1122/45', 'Update  ครั้งที่ 5', 'admin', '2021-01-20 14:59:48', 'ภาษาไทย.pdf', '', '', '', ''),
(4, 'CNTR-1122/45', 'ทดสอบคร้งที่ 6', 'Thanong Boonterm', '2021-01-20 15:34:41', 'ผู้รับผิดชอบหน่วยเลือกตั้งสมาชิกและนายกองค์การบริหารส่วนจังหวัด   20 ธันวาคม 2563.docx', 'ปรตูน้ำจุฬา.pptx', '1608090350566.jpg', 'Untitled.jpg', 'ร่าง_ตัวอย่างเอกสารยื่นขอเสนอโครงการ_V4.doc'),
(5, '', '', 'Thanong Boonterm', '2021-01-20 16:39:16', '', '', '', '', ''),
(6, '', '', 'Thanong Boonterm', '2021-01-20 16:39:33', '', '', '', '', ''),
(7, 'CNTR-1122/45', 'ทอดสอบใหม่ นะ', 'Thanong Boonterm', '2021-01-20 16:39:48', 'พี่เสรี.txt', '', '', '', ''),
(8, 'CNTR-1122/45', 'อีกรอบ', 'Thanong Boonterm', '2021-01-20 16:40:27', 'ListData_01.xlsx', '', '', '', ''),
(9, 'CNTR-1122/45', 'ทดสอบซ้ำ', 'Thanong Boonterm', '2021-01-20 16:41:35', '', '', 'แผนงานชุดทีม_team4.pdf', '', ''),
(10, 'CNTR-1122/45', 'ทำไม', 'Thanong Boonterm', '2021-01-20 16:42:04', '', '', '', '', ''),
(11, 'CNTR-1122/45', 'หมดแล้ว', 'Thanong Boonterm', '2021-01-20 16:42:39', '', '', '', '', ''),
(12, 'CNTR-0002/20', 'test', 'Thanong Boonterm', '2021-03-08 15:39:20', '352361 Computer Network.pdf', '', '', '', ''),
(13, 'CNTR-0002/20', 'Test2', 'Thanong Boonterm', '2021-03-08 15:50:53', '352362 Network Operating System and Protocal.pdf', '', '', '', ''),
(14, 'CNTR-0002/20', 'special', 'Thanong Boonterm', '2021-03-08 15:58:27', '356312 โครงงานพิเศษ 2.pdf', '', '', '', ''),
(15, '', 'svsvs', 'Thanong Boonterm', '2021-03-08 16:00:30', '355331 เทคโนโลยีการสื่อสาร.pdf', '', '', '', ''),
(16, 'CNTR-0002/20', 'svcascas', 'Thanong Boonterm', '2021-03-08 16:08:39', '353352 ปัญหาพิเศษทางด้านอิเล็กทรอนิกส์.pdf', '', '', '', ''),
(17, 'CNTR-1100/44', 'svfsa', 'Thanong Boonterm', '2021-03-08 16:12:44', '352361 Computer Network.pdf', '', '', '', ''),
(18, 'CNTR-1100/44', 'ทดสอบ2', 'Thanong Boonterm', '2021-03-08 16:16:19', '', '1341100083508_OCSC2564.pdf', '', '', ''),
(19, 'CNTR-1175/22', 'Tetst OK', 'Thanong Boonterm', '2021-03-08 16:27:47', '', '', '', '', ''),
(20, 'CNLL-001/66', 'trr', 'Thanong Boonterm', '2021-03-16 11:10:13', '', '', '', '', ''),
(21, 'CNTR-1234/', '22', 'Thanong Boonterm', '2021-03-16 11:12:14', '', '', '', '', ''),
(22, 'CNTR-1122/45', 'tesr', 'ทนงค์ บุญเติม', '2021-12-28 11:00:32', '', '', '', '', ''),
(23, 'CNTR-1234/335', 'test', 'ทนงค์ บุญเติม', '2021-12-28 11:01:02', '', '', '', '', ''),
(24, 'CNTR-1234/335', 'test', 'ทนงค์ บุญเติม', '2021-12-28 11:01:14', '208209.jpg', '', '', '', ''),
(25, 'CNTR-1234/335', 'deaa', 'ทนงค์ บุญเติม', '2021-12-28 11:01:48', '105222.jpg', '', '', '', ''),
(26, 'CNTR-1334/', '333', 'ทนงค์ บุญเติม', '2021-12-28 11:03:39', '105224.jpg', '', '', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_asset`
--

CREATE TABLE `tbl_asset` (
  `asset_id` int(10) NOT NULL COMMENT 'รหัส',
  `asset_group_id` int(10) NOT NULL COMMENT 'ประเภทครุภัณฑ์',
  `asset_number` varchar(100) NOT NULL COMMENT 'เลขรหัสครุภัณฑ์',
  `asset_name` varchar(100) NOT NULL COMMENT 'ชื่อพัสดุ',
  `asset_invoice` varchar(100) NOT NULL COMMENT 'ใบส่งของที่',
  `asset_brand` varchar(100) NOT NULL COMMENT 'ชื่อ/ยี้ห้อ ผู้ทำหรือผู้ผลิต',
  `asset_look` varchar(100) NOT NULL COMMENT 'แบบ/ชนิด/ลักษณะ',
  `asset_sequence` varchar(100) NOT NULL COMMENT 'หมายเลขลำดับ',
  `asset_machine_number` varchar(100) NOT NULL COMMENT 'หมายเลขเครื่อง (ถ้ามี)',
  `asset_frame_number` varchar(100) NOT NULL COMMENT 'หมายเลขกรอบ (ถ้ามี)',
  `asset_registration_number` varchar(100) NOT NULL COMMENT 'หมายเลขจดทะเบียน (ถ้ามี)',
  `asset_parcel_color` varchar(100) NOT NULL COMMENT 'สีของพัสดุ',
  `asset_other` varchar(100) NOT NULL COMMENT 'อื่นๆ (ถ้ามี)',
  `asset_insurance_conditions` varchar(100) NOT NULL COMMENT 'เงื่อนไข-การประกัน',
  `asset_insurance_up_to_date` varchar(100) NOT NULL COMMENT 'พัสดุรับประกันถึงวันที่',
  `asset_insurance_company` varchar(100) NOT NULL COMMENT 'พัสดุประกันไว้ที่บริษัท',
  `asset_insurance_date` date NOT NULL COMMENT 'วันที่ประกันพัสดุ',
  `asset_get` varchar(100) NOT NULL COMMENT 'ชื้อ/จ้าง/ได้มา จาก',
  `asset_get_date` date NOT NULL COMMENT 'ชื้อ/จ้าง/ได้มา จาก เหมือนวันที่',
  `asset_price` varchar(100) NOT NULL COMMENT 'ราคา',
  `asset_budget` varchar(100) NOT NULL COMMENT 'ใช้งบประมาณของ',
  `asset_release_date` varchar(100) NOT NULL COMMENT 'วันที่จำหน่าย',
  `asset_distribution_method` varchar(100) NOT NULL COMMENT 'วิธีจำหน่าย',
  `asset_book_number` varchar(100) NOT NULL COMMENT 'เลขที่หนังสือที่อนุมัติ',
  `asset_selling_price` varchar(100) NOT NULL COMMENT 'ราคาจำหน่าย',
  `asset_profit_and_loss` varchar(100) NOT NULL COMMENT 'กำไรขาดทุน',
  `asset_location` varchar(100) NOT NULL COMMENT 'สถานที่ติดตั้ง',
  `section_ref` varchar(10) NOT NULL COMMENT 'หน่วยงานภายในที่รับผิดชอบ',
  `asset_status` enum('ปกติ','อยู่ระหว่างซ่อม','รอจำหน่าย','จำหน่าย') NOT NULL COMMENT 'สถานะครุภัณฑ์',
  `asset_caretaker` varchar(100) NOT NULL COMMENT 'ผู้ดูแล',
  `asset_img` varchar(100) NOT NULL DEFAULT 'no-image-found.jpg' COMMENT 'รูปถ่ายพัสดุ (ถ้ามี) หรือตำนิรูปพรรณสัตว์',
  `creation_asset_date` date NOT NULL COMMENT 'วันที่สร้าง',
  `update_asset_date` date NOT NULL COMMENT 'วันที่อัพเดต',
  `creation_by` int(10) NOT NULL COMMENT 'รหัสสผู้ใช้งานที่ทำการสร้าง',
  `update_by` int(10) NOT NULL COMMENT 'รหัสสผู้ใช้งานที่ทำการแก้ไข'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tbl_asset`
--

INSERT INTO `tbl_asset` (`asset_id`, `asset_group_id`, `asset_number`, `asset_name`, `asset_invoice`, `asset_brand`, `asset_look`, `asset_sequence`, `asset_machine_number`, `asset_frame_number`, `asset_registration_number`, `asset_parcel_color`, `asset_other`, `asset_insurance_conditions`, `asset_insurance_up_to_date`, `asset_insurance_company`, `asset_insurance_date`, `asset_get`, `asset_get_date`, `asset_price`, `asset_budget`, `asset_release_date`, `asset_distribution_method`, `asset_book_number`, `asset_selling_price`, `asset_profit_and_loss`, `asset_location`, `section_ref`, `asset_status`, `asset_caretaker`, `asset_img`, `creation_asset_date`, `update_asset_date`, `creation_by`, `update_by`) VALUES
(1, 4, '1112', 'ตลับเมตรp', 'ipo', 'topa', '', 'qwd', 'awdf', 'wadf', '', 'kop', 'kop', '3เดือน', '2564-08-16', 'kopk', '2564-10-16', 'kpo', '2564-08-16', '190', 'เงินประจำปี', '', '', '', '', '', 'LC03', 'W03', 'ปกติ', 'tt', 'no-image-found.jpg', '2021-08-18', '0000-00-00', 71, 0),
(2, 4, '4122222', 'ตลับเมตรp', '001-25425', '', 'awde', 'kpo', 'kpo', '366', 'qwd', 'ดำ', 'awd', '3เดือน', '2564-08-16', 'kopk', '2564-10-16', 'ซื้อ', '2564-08-12', '300', 'เงินประจำปี', '', '', '', '', '', 'LC03', 'W02', 'ปกติ', 'thanong', 'no-image-found.jpg', '2021-08-18', '0000-00-00', 71, 0),
(3, 2, '1113', 'PC computer', '001-25-544', 'HP', 'เครื่องคำนวณแบบ 2', '2333', '12522554', '25255', '1414', 'ดำ', '24 นิ้ว จอโค้ง', '3 ปี', '2564-08-26', '็็HP Thailand', '2564-10-20', 'ซื้อ', '2564-08-31', '32000', 'เงินประจำปี', '', '', '', '', '', 'LC01', 'W01', 'ปกติ', 'thanong', 'no-image-found.jpg', '2021-08-18', '0000-00-00', 71, 0),
(4, 2, '1113', 'PC computer', '001-25-544', 'HP', 'เครื่องคำนวณแบบ 2', '2333', '12522554', '25255', '1414', 'ดำ', '24 นิ้ว จอโค้ง', '3 ปี', '2564-08-26', '็็HP Thailand', '2564-10-20', 'ซื้อ', '2564-08-31', '32000', 'เงินประจำปี', '', '', '', '', '', 'LC01', 'W01', 'ปกติ', 'thanong', 'no-image-found.jpg', '2021-08-18', '0000-00-00', 71, 0),
(5, 2, '021241', 'Notebook', '001-25425', 'kop', '', '', '', '', '', 'kop', '', '', '', '', '0000-00-00', '', '0000-00-00', '35000', '', '', '', '', '', '', 'LC03', 'W01', 'ปกติ', 'thanong', 'no-image-found.jpg', '2021-08-18', '0000-00-00', 71, 0),
(6, 9, '2525', 'Blower', '001-25425', 'EMEM', 'แบบโรงงานอุตสาหกรรม', '', '', '', '', '', '', '3เดือน', '', 'EDD', '2564-08-18', '', '0000-00-00', '50000', 'เงินประจำปี', '', '', '', '', '', 'LC02', 'W03', 'ปกติ', 'thanong', 'assser_611cc699c9dd6.png', '2021-08-18', '0000-00-00', 71, 0),
(7, 9, '2525ddd', 'Blower', '001-25425', 'EMEM', 'แบบโรงงานอุตสาหกรรม', '', '', '', '', '', '', '3เดือน', '', 'EDD', '2564-08-18', '', '0000-00-00', '50000', 'เงินประจำปี', '', '', '', '', '', 'LC02', 'W03', 'ปกติ', 'thanong', 'assser_611cc6b827bc4.png', '2021-08-18', '0000-00-00', 71, 0),
(8, 3, '5622', '', 'ad', 'ad', '', '', '', '', '', '', '', '', '', '', '0000-00-00', '', '0000-00-00', '32000', '', '', '', '', '', '', 'LC01', 'W02', 'ปกติ', 'thanong', 'no-image-found.jpg', '2021-08-18', '0000-00-00', 71, 0),
(9, 9, '412222w', 'Bloer', '001-25-544', 'eqwd', 'dtrg', '2525', '14252', '252625-2522', 'kop', 'ขาว', '24 นิ้ว จอโค้ง', '3เดือน', '2564-08-29', 'DELL EMC Thailand', '2564-08-30', 'kpo', '2564-07-27', '50000', 'เงินประจำปี', '', '', '', '', '', 'LC04', 'W03', 'ปกติ', '', 'assser_611cc86f52a91.png', '2021-08-18', '0000-00-00', 71, 0),
(10, 8, '412221w23', 'ตลับเมตรp22', '001-25425', '', 'awde', '2333', '14252', '366', 'kop', 'ดำ', 'zz', '3เดือน', '2564-08-19', 'Mr DIY', '2564-08-03', 'ซื้อ', '2564-08-03', '190', '', '', '', '', '', '', 'LC01', 'W07', 'ปกติ', 'zzz', 'no-image-found.jpg', '2021-12-21', '0000-00-00', 0, 0),
(11, 2, 'rafew', 'sfas', '001-25425aa', 'Synology', '-', '', 'Cq1235', '', '', '', '', '3 ปี', '2566-12-13', 'SYNNEX', '2564-12-28', 'ซื้อ', '2564-08-12', '320000', '', '', '', '', '', '', 'LC01', 'W01', 'ปกติ', 'thanong', 'no-image-found.jpg', '2021-12-21', '0000-00-00', 0, 0),
(12, 2, '4122222q', 'xsdvs', 'zsdv', 'CSA', 'zC', 'ZCAs', 'ASCa', 'Addrtgh', 'sdfgv', 'srf', 'segs', 'sedg', '2564-08-11', 'DELL EMC Thailand', '2564-08-18', 'serg', '2564-08-16', '32000', 'เงินประจำปี', '', '', '', '', '', 'LC03', 'W02', 'ปกติ', 'serfgs', 'no-image-found.jpg', '2021-12-21', '0000-00-00', 0, 0),
(13, 2, '4122224', 'PC', 'PN0356016', 'HP', 'PVDDC', 'XSDD', '25162965', '26984', '281561', 'ดำ', 'drtgye', 'drg', '2564-12-01', 'kopk', '2564-08-11', 'serg', '2564-07-28', '50000', 'เงินประจำปี', '', '', '', '', '', 'LC01', 'W01', 'ปกติ', 'drgdrg', 'no-image-found.jpg', '2021-12-21', '0000-00-00', 0, 0),
(14, 2, '152545', 'ghkhg', 'ftyjht', 'fjhyf', 'fyjhf', 'fg', 'fgjf', 'fgj', 'ftgjh', 'fjhy', 'fgjhf', 'fgh', '2564-12-08', 'Mr DIY', '2564-10-16', 'fjhf', '2564-11-30', '320000', 'fjhy', '', '', '', '', '', 'LC03', 'W02', 'ปกติ', 'ftjhftgyj', 'no-image-found.jpg', '2021-12-21', '0000-00-00', 0, 0),
(15, 1, 'xdrg1212', 'ตลับเมตร', '123000', 'HP', 'แบบโรงงานอุตสาหกรรม', 'tguit67i', 'yuiouy', 'hyiyu', 'uikuy', 'gy7igy', 'gyiy', 'yiyiy7', '2564-08-03', '็็HP Thailand', '2564-08-11', 'ซื้อ', '2564-08-17', '180000', 'เงินประจำปี', '', '', '', '', '', 'LC01', 'W01', 'ปกติ', '[;p[', 'assser_61c199ef42d3e.png', '2021-12-21', '0000-00-00', 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `tbl_asset_group`
--

CREATE TABLE `tbl_asset_group` (
  `asset_group_id` int(10) NOT NULL COMMENT 'รหัส',
  `asset_group_code` varchar(10) NOT NULL COMMENT 'รหัสประเภทครุภัณฑ์',
  `asset_group_name` varchar(100) NOT NULL COMMENT 'ชื่อประเภทครุภัณฑ์',
  `asset_group_detail` text NOT NULL COMMENT 'รายละเอียดประเภทครุภัณฑ์'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tbl_asset_group`
--

INSERT INTO `tbl_asset_group` (`asset_group_id`, `asset_group_code`, `asset_group_name`, `asset_group_detail`) VALUES
(1, '1.1', 'ครุภัณฑ์สำนักงาน', ''),
(2, '1.2', 'ครุภัณฑ์คอมพิวเตอร์', ''),
(3, '1.3', 'ครุภัณฑ์วิทยาศาสตร์หรือการแพทย์', ''),
(4, '1.4', 'ครุภัณฑ์โฆษณาและเผยแพร่', ''),
(5, '1.5', 'ครุภัณฑ์ยานพาหนะและขนส่ง', ''),
(6, '1.6', 'ครุภัณฑ์งานบ้านงานครัว', ''),
(7, '1.7', 'ครุภัณฑ์ไฟฟ้าและวิทยุ', ''),
(8, '1.8', 'คุณภัณฑ์ก่อสร้าง', ''),
(9, '1.9', 'ครุภัณฑ์โรงงาน', ''),
(10, '1.10', 'ครุภัณฑ์กีฬา', ''),
(11, '1.11', 'ครุภัณฑ์การเกษตร', ''),
(12, '1.12', 'ครุภัณฑ์ดนตรี', '');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_asset_status`
--

CREATE TABLE `tbl_asset_status` (
  `asset_status_id` int(10) NOT NULL COMMENT 'รหัส',
  `asset_id` int(10) NOT NULL COMMENT 'รหัสครุภัณฑ์',
  `asset_status` enum('0','1','3') NOT NULL COMMENT 'สถานะ',
  `asset_date` datetime NOT NULL COMMENT 'วันที่สถานะ',
  `creation_date` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT 'วันที่สร้าง',
  `update_date` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT 'วันที่อัพเดต',
  `creation_by` int(10) NOT NULL COMMENT 'รหัสสผู้ใช้งานที่ทำการสร้าง',
  `update_by` int(10) NOT NULL COMMENT 'รหัสสผู้ใช้งานที่ทำการแก้ไข'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `tbl_contractor`
--

CREATE TABLE `tbl_contractor` (
  `id` int(11) NOT NULL,
  `code` varchar(5) NOT NULL,
  `name` varchar(255) NOT NULL,
  `tel` varchar(15) NOT NULL,
  `created` datetime NOT NULL,
  `modified` datetime NOT NULL,
  `user_modified` varchar(255) NOT NULL,
  `status` enum('Active','Inactive') NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tbl_contractor`
--

INSERT INTO `tbl_contractor` (`id`, `code`, `name`, `tel`, `created`, `modified`, `user_modified`, `status`) VALUES
(1, 'C001', 'บริษัท กรีนเวิร์ค แอสโซซิเอท จำกัด', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(2, 'C002', 'บริษัท เคลฟเวอร์ ซอร์วิส จำกัด', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(3, 'C003', 'บริษัท เจ ซอฟท์ จำกัด', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(4, 'C004', 'บริษัท ชินาภัค คอนกรีต จำกัด', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(5, 'C005', 'บริษัท โชคอำนวยอีควิปเม้นท์ จำกัด', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(6, 'C006', 'บริษัท ธนกุลดีไซน์ แอนด์ เดคคอร์ จำกัด', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(7, 'C007', 'บริษัท นิมิต จำกัด', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(8, 'C008', 'บริษัท พกฤษ จำกัด', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(9, 'C009', 'บริษัท ฟูโซ่ ทรัค (ประเทศไทย) จำกัด', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(10, 'C010', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(11, 'C011', 'บริษัท ยูไนเต็ดแมชชินเนอรี่ จำกัด', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(12, 'C012', 'บริษัท เรเซอร์การไฟฟ้า (ประเทศไทย) จำกัด', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(13, 'C013', 'บริษัท วรัญญาภรณ์ คอนสตรัคชั่น จำกัด', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(14, 'C014', 'บริษัท วิรุฬห์ แอนด์ เกวนเนส จำกัด', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(15, 'C015', 'บริษัท สุทธิพงษ์ ไลท์ติ้ง จำกัด', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(16, 'C016', 'บริษัท อ.นวรัตน์ จำกัด', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(17, 'C017', 'บริษัท อาคีร่า เอสเค จำกัด', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(18, 'C018', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(19, 'C019', 'ห้างหุ้นส่วนจำกัด นาคนิกร', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(20, 'C020', 'ห้างหุ้นส่วนจำกัด ปทุมธานีวัสดุภัณฑ์ ', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(21, 'C021', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(22, 'C022', 'ห้างหุ้นส่วนจำกัด มัลติซัพพลาย อีควิปเมนท์ 1998', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(23, 'C023', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active'),
(24, 'C024', 'ห้างหุ้นส่วนจำกัด เอ.เอส.พี.นิพนธ์ คอนสตรัคชั่น', '000-000-0000', '2021-07-16 13:20:31', '2021-07-16 13:20:31', 'admin', 'Active');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_division`
--

CREATE TABLE `tbl_division` (
  `division_id` int(3) NOT NULL COMMENT 'รหัส',
  `division_code` varchar(50) NOT NULL COMMENT 'รหัสสำนัก/กอง',
  `division_name` varchar(100) NOT NULL COMMENT 'ชื่อสำนัก/กอง',
  `division_initials` varchar(5) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tbl_division`
--

INSERT INTO `tbl_division` (`division_id`, `division_code`, `division_name`, `division_initials`) VALUES
(1, '0100', 'สำนักปลัด', 'สป.'),
(2, '0200', 'สำนักการศึกษา', 'สศ.'),
(3, '0300', 'สำนักช่าง', 'สช.'),
(4, '0400', 'สำนักคลัง', 'สค.'),
(5, '0500', 'กองสาธารณสุขและสิ่งแวดล้อม', 'กสส.'),
(6, '0600', 'กองสวัสดิการสังคม', 'กสค.'),
(7, '0700', 'กองการเจ้าหน้าที่', 'กจ.'),
(8, '0800', 'กองยุทธศาสตร์และงบประมาณ', 'กย.'),
(9, '0900', 'หน่วยตรวจสอบภายใน', 'นต.');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_location`
--

CREATE TABLE `tbl_location` (
  `id` int(11) NOT NULL,
  `location_code` varchar(10) NOT NULL,
  `location_name` varchar(255) NOT NULL,
  `location_detail` varchar(255) NOT NULL,
  `LAT` varchar(10) NOT NULL,
  `LNG` varchar(10) NOT NULL,
  `division_ref` varchar(10) NOT NULL,
  `part_ref` varchar(10) NOT NULL,
  `subdivision_ref` varchar(10) NOT NULL,
  `section_ref` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tbl_location`
--

INSERT INTO `tbl_location` (`id`, `location_code`, `location_name`, `location_detail`, `LAT`, `LNG`, `division_ref`, `part_ref`, `subdivision_ref`, `section_ref`) VALUES
(1, 'LC01', 'สำนักงาน', 'อาคารสำนักงาน เทศบาลนครรังสิต', '13.986915', '100.609675', '53603', 'P003', 'SD01', 'W01'),
(2, 'LC06', 'สถานีสูบน้ำ รน.38', 'N A', '222', '333', '53603', 'P002', 'SD05', 'W08'),
(3, 'LC06', 'สถานีสูบน้ำ รน.38', 'N A', '222', '333', '53603', 'P002', 'SD05', 'W08'),
(4, 'LC06', 'สถานีสูบน้ำ รน.38', 'N A', '222', '333', '53603', 'P002', 'SD05', 'W08'),
(5, 'LC07', 'สถานีสูบน้ำ รป 15', 'N A', '44444', '555555', '53603', 'P002', 'SD05', 'W08');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_mat`
--

CREATE TABLE `tbl_mat` (
  `id` int(11) NOT NULL,
  `mat_code` varchar(5) NOT NULL,
  `mat_name` varchar(100) NOT NULL,
  `price` double(10,2) NOT NULL,
  `unit` varchar(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tbl_mat`
--

INSERT INTO `tbl_mat` (`id`, `mat_code`, `mat_name`, `price`, `unit`) VALUES
(1, 'c01', 'ปากกา', 5.00, 'u001'),
(2, 'c02', 'ดินสอ', 3.00, 'u001'),
(3, 'c03', 'ยางลบ', 2.00, 'u001'),
(4, 'c04', 'ลิขวิดเปเปอร์', 25.00, ''),
(5, 'c06', 'กระดาษ A4', 250.00, ''),
(6, 'C07', 'กระดาษ A3', 350.00, '');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_part`
--

CREATE TABLE `tbl_part` (
  `part_id` int(11) NOT NULL,
  `part_code` varchar(5) NOT NULL,
  `part_name` varchar(100) NOT NULL,
  `division_ref` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci COMMENT='ส่วนงาน';

--
-- Dumping data for table `tbl_part`
--

INSERT INTO `tbl_part` (`part_id`, `part_code`, `part_name`, `division_ref`) VALUES
(1, '0110', '-- ไม่มีส่วน --', '0100'),
(2, '0201', 'ส่วนบริหารการศึกษา', '0200'),
(3, '0202', 'ส่วนส่งเสริมการศึกษา ศาสนาและวัฒนธรรม', '0200'),
(4, '0203', '-- ไม่มีส่วน --', '0200'),
(5, '0301', '-- ไม่มีส่วน --', '0300'),
(6, '0410', 'ส่วนบริหารงานคลัง', '0400'),
(7, '0420', 'ส่วนพัฒนารายได้', '0400'),
(8, '0403', '-- ไม่มีส่วน --', '0400'),
(9, '0510', '-- ไม่มีส่วน --', '0500'),
(10, '0610', '-- ไม่มีส่วน --', '0600'),
(11, '0710', '-- ไม่มีส่วน --', '0700'),
(12, '0810', '-- ไม่มีส่วน --', '0800'),
(13, '0910', '-- ไม่มีส่วน --', '0900');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_positions`
--

CREATE TABLE `tbl_positions` (
  `position_id` int(11) NOT NULL,
  `position_code` varchar(5) NOT NULL,
  `position_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tbl_positions`
--

INSERT INTO `tbl_positions` (`position_id`, `position_code`, `position_name`) VALUES
(1, 'S0001', 'ปลัดเทศบาล'),
(2, 'S0002', 'รองปลัดเทศบาล'),
(3, 'M0001', 'ผู้อำนวยการสำหนัก/กอง'),
(4, 'M0002', 'ผู้อำนวยการส่วน'),
(5, 'M0003', 'หัวหน้าฝ่าย'),
(6, 'K0001', 'นักจัดการงานทั่วไป'),
(7, 'K0002', 'นักวิเครำะห์นโยบำยและแผน'),
(8, 'K0003', 'นิติกร'),
(9, 'K0004', 'นักทรัพยากรบุคคล'),
(10, 'K0005', 'นักส่งเสริมกำรปกครองท้องถิ่น'),
(11, 'K0006', 'นักวิชาการศึกษา'),
(12, 'K0007', 'นักวิชาการคลัง'),
(13, 'K0008', 'นักวิชาการตรวจสอบภายใน'),
(14, 'K0009', 'นักวิชาการเงินและบัญชี'),
(15, 'K0010', 'นักวิชาการพัสดุ'),
(16, 'K0011', 'นักวิชาการคอมพิวเตอร์'),
(17, 'K0012', 'วิศวกรโยธา'),
(18, 'K0013', 'วิศวกรไฟฟ้า'),
(19, 'K0014', 'สถาปนิก'),
(20, 'K0015', 'นักผังเมือง'),
(21, 'O0001', 'เจ้าพนักงานธุรการ'),
(22, 'O0002', 'เจ้านายช่างศิลป์'),
(23, 'O0003', 'เจ้าพนักงานสุขาภิบาล'),
(24, 'O0004', 'นายช่างโยธา'),
(25, 'O0005', 'นายช่างไฟฟ้า'),
(26, 'O0006', 'นายช่างเครื่องกล'),
(27, 'O0007', 'นายช่างเครื่องยนต์');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_request`
--

CREATE TABLE `tbl_request` (
  `id` int(11) NOT NULL,
  `mat` varchar(10) NOT NULL,
  `qty` int(11) NOT NULL,
  `user` varchar(10) NOT NULL,
  `timp` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `tbl_stock`
--

CREATE TABLE `tbl_stock` (
  `id` int(11) NOT NULL,
  `mat_code` varchar(5) NOT NULL,
  `qty` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tbl_stock`
--

INSERT INTO `tbl_stock` (`id`, `mat_code`, `qty`) VALUES
(1, 'c01', 95),
(2, 'c02', 203),
(3, 'c03', 47);

-- --------------------------------------------------------

--
-- Table structure for table `tbl_subdivision`
--

CREATE TABLE `tbl_subdivision` (
  `subdivision_id` int(11) NOT NULL COMMENT 'รหัส',
  `subdivision_code` varchar(4) NOT NULL COMMENT 'รหัสฝ่าย',
  `subdivision_name` varchar(100) NOT NULL COMMENT 'ชื่อฝ่าย',
  `part_ref` varchar(11) NOT NULL COMMENT 'ส่วน',
  `division_ref` varchar(11) NOT NULL COMMENT 'รหัสสำนัก/กอง'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tbl_subdivision`
--

INSERT INTO `tbl_subdivision` (`subdivision_id`, `subdivision_code`, `subdivision_name`, `part_ref`, `division_ref`) VALUES
(1, '0111', 'ฝ่ายบริหารงทั่วไป', '0110', '0100'),
(2, '0112', 'ฝ่ายทะเบียนราษฎร', '0110', '0100'),
(3, '0113', 'ฝ่ายนิติการ', '0110', '0100'),
(4, '0114', 'ฝ่ายรักษาความสงบ', '0110', '0100'),
(5, '0115', 'ฝ่ายส่งเสริมการท่องเที่ยว', '0110', '0100'),
(6, '0116', 'งานป้องกันและบรรเทาสาธารณภัย', '0110', '0100'),
(7, '0211', 'ฝ่ายการเจ้าหน้าที่', '0201', '0200'),
(8, '0212', 'ฝ่ายกิจการโครงเรียน', '0201', '0200'),
(9, '0213', 'ฝ่ายการศึกษานอกระบบและอัธยาศัย', '0202', '0200'),
(10, '0214', 'ฝ่ายส่งเสริมศาสนาศิลปะและวัฒนธรรม', '0202', '0200'),
(11, '0215', 'หน่วยศึกษานิเทศก์', '0203', '0200'),
(12, '0216', 'โรงเรียน', '0203', '0200'),
(13, '0217', 'ศูนย์พัฒนาเด็กเล็ก', '0203', '0200'),
(14, '0311', 'ฝ่ายบริหารงานทั่วไป', '0301', '0300'),
(15, '0312', 'ฝ่ายสวนสาธารณะ', '0301', '0300'),
(16, '0313', 'ฝ่ายช่างสุขาภิบาล', '0301', '0300'),
(17, '0314', 'ฝ่ายควบคุมอาคารและผังเมือง – เฉพาะงบบุคลากร', '0301', '0300'),
(18, '0315', 'ฝ่ายสาธารณูปโภค', '0301', '0300'),
(19, '0316', 'ฝ่ายควบคุมการก่อสร้าง', '0301', '0300'),
(20, '0411', 'ฝ่ายพัสดุและทรัพย์สิน', '0410', '0400'),
(21, '0412', 'ฝ่ายการเงินและบัญชี', '0410', '0400'),
(22, '0413', 'ฝ่ายสถิติการคลัง', '0410', '0400'),
(23, '0421', 'ฝ่ายแผนที่และทะเบียนทรัพย์สิน', '0420', '0400'),
(24, '0422', 'ฝ่ายพัฒนารายได้', '0420', '0400'),
(25, '0423', 'ฝ่ายผลประโยชน์และกิจการพาณิชย์', '0420', '0400'),
(26, '0511', 'ฝ่ายบริหารงานทั่วไป', '0510', '0500'),
(27, '0512', 'ฝ่ายบริการสาธารณสุข', '0510', '0500'),
(28, '0513', 'ฝ่ายบริหารงานสาธารณสุข', '0510', '0500'),
(29, '0611', 'ฝ่ายบริหารงานทั่วไป ', '0610', '0600'),
(30, '0711', 'ฝ่ายบริหารงานทั่วไป', '0710', '0700'),
(31, '0811', 'ฝ่ายบริหารงานทั่วไป', '0810', '0800'),
(32, '0911', 'งานควบคุมภายในและการตรวจสอบภายใน', '0910', '0900');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_treasury`
--

CREATE TABLE `tbl_treasury` (
  `id` int(11) NOT NULL,
  `regis_date` varchar(255) NOT NULL,
  `contract_no` varchar(255) NOT NULL,
  `contractor` varchar(255) NOT NULL,
  `garanty_type` varchar(255) NOT NULL,
  `cost_budget` varchar(255) NOT NULL,
  `project_name` varchar(255) NOT NULL,
  `status` varchar(20) NOT NULL,
  `garanty_end` varchar(255) NOT NULL,
  `owner` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tbl_treasury`
--

INSERT INTO `tbl_treasury` (`id`, `regis_date`, `contract_no`, `contractor`, `garanty_type`, `cost_budget`, `project_name`, `status`, `garanty_end`, `owner`) VALUES
(1, '20/4/2561', 'CNTR-0970/61', 'ห้างหุ้นส่วนจำกัด ศิริศรพาณิชย์ 2011', 'หนังสือค้ำประกันเลขที่ 100017518555 / 2 ปี ', '26,000.00', 'ก่อสร้างถนน คสล. หนา 0.15 เมตร ผิวจราจรกว้างไม่น้อยกว่า 6.00 เมตร ความยาวประมาณไม่น้อยกว่า 191 เมตร', 'ยังไม่คืน', '5/6/2563', 'สำนักการช่าง'),
(2, '11/5/2561', 'CNTR-968/61', 'ห้างหุ้นส่วนจำกัด ศิริศรพาณิชย์ 2011', 'หนังสือค้ำประกันเลขที่ 100017518679 / 2 ปี ', '35,650.00', 'จ้างก่อสร้างโครงการขยายผิวจราจร คสล.ถนนเลียบคลองรังสิต-ประยูรศักดิ์ ช่วงโค้งผู้ใหญ่ลีถึงท่าเรือจ้างตลาดใน', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(3, '11/6/2561', 'CNTR-1268/61', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', 'เงินสด  / 3 เดือน ', '9,095.00', 'จ้างซ่อมแซมตู้บรรทุกขยะ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(4, '13/6/2561', 'CNTR-1163/61', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'หนังสือค้ำประกันเลขที่ ค.47690234806000 / 2 ปี ', '282,000.00', 'โครงการก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ หมู่บ้านธารารินทร์ ซอย 2 (ช่วงที่ 1)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(5, '1/8/2561', 'CNTR-1611/61', 'บริษัท นิมิต 317 จำกัด', 'หนังสือค้ำประกันเลขที่ 100019403364 / 2 ปี ', '187,500.00', 'โครงการก่อสร้างรั้วโรงเก็บพัสดุเทศบาลนครรังสิต ซอยรังสิต-นครนายก 56', 'ยังไม่คืน', '1/2/2564', 'สำนักการช่าง'),
(6, '20/8/2561', 'CNTR-1750/61', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', 'เงินสด  / 3 เดือน ', '6,926.00', 'จ้างซ่อม จำนวน 3 รายการ (ตู้บรรทุกขยะ เบอร์ 16,เครื่องเติมอากาศ, เครื่องย่อยกิ่งไม้)', 'ยังไม่คืน', '4/12/2561', 'สำนักการช่าง'),
(7, '23/8/2561', 'CNTR-1783/61', 'บริษัท ธนกรเมตัลเวอร์คโปรดิวเซอร์ จำกัด', 'เงินสด  / 2 ปี ', '25,000.00', 'จ้างเหมาปรับปรุงเมรุเผาศพ บริเวณวัดแสงสรรค์ ', 'ยังไม่คืน', '22/11/2563', 'สำนักการช่าง'),
(8, '3/9/2561', 'CNTR-1853/61', 'บริษัท เอสทีพี อินตริเกต จำกัด', 'หนังสือค้ำประกันเลขที่ 100019911297 / 1 ปี ', '3,000.00', 'ซื้อเครื่องจ่ายกระแสไฟฟ้าชุดประชุม', 'ยังไม่คืน', '4/9/2562', 'สำนักการช่าง'),
(9, '10/9/2561', 'CNTR-1901/61', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัดชั่น', 'เงินสด  / 1 ปี ', '6,400.00', 'จ้างปรับปรุงพื้นคอนกรีตพร้อมวางท่อระบายน้ำและบ่อพัก บริเวณลานแอโรบิคหน้าศูนย์การเรียนรู้ฯ', 'ยังไม่คืน', '13/10/2562', 'สำนักการช่าง'),
(10, '12/9/2561', 'CNTR-1915/61', 'บริษัท เซิท คอนแทรคเตอร์ จำกัด', 'เงินสด  / 1 ปี ', '24,900.00', 'โครงการติดตั้งป้ายชื่อซอยตามอัตลักษณ์เมือง', 'ยังไม่คืน', '11/11/2562', 'สำนักการช่าง'),
(11, '14/9/2561', 'CNTR-1949/61', 'บริษัท กรีนเวิร์ค แอสโซซิเอท จำกัด', 'เงินสด  / 1 ปี ', '24,200.00', 'จ้างปรับปรุงถนนแอสฟัลท์ติกคอนกรีต สะพาน ไหล่ทาง ภายในเขตเทศบาล ', 'ยังไม่คืน', '16/10/2562', 'สำนักการช่าง'),
(12, '18/9/2561', 'CNTR-1988/61', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัดชั่น', 'เงินสด  / 1 ปี ', '24,750.00', 'จ้างปรับปรุงไหล่ทาง ซอยรังสิต-นครนายก ๕๖', 'ยังไม่คืน', '16/10/2562', 'สำนักการช่าง'),
(13, '19/9/2561', 'CNTR-1987/61', 'ห้างหุ้นส่วนจำกัด เอ็น.เค.สถาปัตย์', 'หนังสือค้ำประกันเลขที่ 100020076946 / 2 ปี ', '1,677,500.00', 'จ้างก่อสร้างอาคารเรียนโรงเรียนนครรังสิต รัตนโกสินทร์ ', 'ยังไม่คืน', '29/10/2564', 'สำนักการช่าง'),
(14, '21/9/2561', 'CNTR-2025/61', 'บริษัท กรีนเวิร์ค แอสโซซิเอท จำกัด', 'เงินสด  / 2 ปี ', '24,000.00', 'จ้างเหมาปรับปรุงถนนแอสฟัลท์ติกคอนกรีตภายในเขตเทศบาล ', 'ยังไม่คืน', '23/10/2563', 'สำนักการช่าง'),
(15, '25/9/2561', 'CNTR-2040/61', 'บริษัท เทสโก้ จำกัด', 'หนังสือค้ำประกันเลขที่ 0435000195 QCMPG174966 / 1 ปี 4 เดือน 21 วัน ', '744,500.00', 'โครงการว่าจ้างที่ปรึกษาวางและปรับปรุงผังเมืองรวมเมืองท่าโขลง-รังสิต (ปรับปรุงครั้งที่ 2)', 'ยังไม่คืน', '1 ปี 4 เดือน 21 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(16, '26/9/2561', 'CNTR-2045/61', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '19,900.00', 'จ้างเหมาค่าแรงก่อสร้างหลังคาโรงเก็บพัสดุ ซอยรังสิต-นครนายก ๕๖ หลังวัดจันทร์สุข)', 'ยังไม่คืน', '27/9/2563', 'สำนักการช่าง'),
(17, '27/9/2561', 'CNTR-2048/61', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '8,900.00', 'จ้างเหมาปรับปรุงพื้นที่ติดตั้งตู้คอนเทรนเนอร์สวนสาธารณะ ซอยรังสิต-ปทุมธานี ๑๔ ซอย ๑๖', 'ยังไม่คืน', '27/10/2563', 'สำนักการช่าง'),
(18, '13/9/2562', 'CNTR-1732/61', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'หนังสือค้ำประกันเลขที่ 100019649967 / 2 ปี ', '124,500.00', 'โครงการก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิต-ปทุมธานี 14 ระหว่างซอย 4 ถึงซอย 5 (ทางหนีไฟ)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(19, '14/1/2562', 'CNTR-394/62', 'บริษัท วรัญญาภรณ์ คอนสตรัคชั่น จำกัด', 'หนังสือค้ำประกันเลขที่ 0034-0010/2561 / 2 ปี ', '134,000.00', 'โครงการก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ คสล.ถนนซอย พหลโยธิน 111 ชุมชนกรุงเทพเมืองใหม่', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(20, '18/4/2562', 'CNTR-838/62', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'หนังสือค้ำประกันเลขที่ ค.47690265185000 / 2 ปี ', '239,000.00', 'โครงการปรับปรุงถนนซอยรังสิต-นครนายก 54', 'ยังไม่คืน', '2/7/2564', 'สำนักการช่าง'),
(21, '3/5/2562', 'CNTR-921/62', 'บริษัท เซิท คอนแทรคเตอร์ จำกัด', 'เงินสด  / 1 ปี ', '23,985.00', 'โครงการติดตั้งป้ายชื่อซอยตามอัตลักษณ์เมือง', 'ยังไม่คืน', '3/7/2563', 'สำนักการช่าง'),
(22, '25/7/2562', 'CNTR-1533/62', 'ห้างหุ้นส่วนจำกัด นพเลิศ', 'เงินสด  / 30 วัน ', '15,301.00', 'เครื่องตีอากาศบนผิวน้ำ พร้อมติดตั้ง', 'ยังไม่คืน', '24/8/2563', 'สำนักการช่างงานกำจัดขยะมูลฝอยและสิ่งปฏิกูล'),
(23, '19/8/2562', 'CNTR-1681/62', 'บริษัท ฟูโซ่ ทรัค (ประเทศไทย) จำกัด', 'เงินสด  / 1 ปี ', '84,450.00', 'ซื้อรถบรรทุกหกล้อ', 'ยังไม่คืน', '26/10/2563', 'งานไฟฟ้าถนน'),
(24, '23/8/2562', 'CNTR-1702/62', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', 'เงินสด  / 1 ปี ', '10,280.00', 'จ้างซ่อมรถบรรทุกขยะอัดท้าย ทะเบียน 82-4562', 'ยังไม่คืน', '10/12/2562', 'สำนักการช่าง'),
(25, '4/9/2562', 'CNTR-1742/62', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '12,015.00', 'โครงการปรับปรุงประตูระบายน้ำบริเวณหน้าประตูน้ำจุฬา', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(26, '5/9/2562', 'CNTR-1751/62', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '11,400.00', 'จ้างเหมาลอกลำรางสาธารณะ ช่วงที่ 1 บริเวณหลังหมู่บ้านคาซ่าวิลล์ ถึง หมู่บ้านนฐดา ช่วงที่ 2 หลังหมู่บ้านพฤกษาวิลล์ 106 ถึง หมู่บ้านชมฟ้าวรางกูล', 'ยังไม่คืน', '26/10/2562', 'สำนักการช่าง'),
(27, '12/9/2562', 'CNTR-1680/62', 'บริษัท บราโว คิดส์ จำกัด', 'เงินสด  / 1 ปี ', '24,500.00', 'ซื้อเครื่องเล่นสนามกลางแจ้ง พร้อมติดตั้ง', 'ยังไม่คืน', '26/9/2563', 'สำนักการช่าง'),
(28, '13/9/2562', 'CNTR-1817/62', 'บริษัท กรีนเวิร์ค แอสโซซิเอท จำกัด', 'หนังสือค้ำประกันเลขที่ 233819000126 / 1 ปี ', '24,600.00', 'จ้างเหมาซ่อมแซมถนนลาดยางแอสฟัสท์ติกคอนกรีต ที่ชำรุดภายในเขตเทศบาลนครรังสิต', 'ยังไม่คืน', '2/10/2563', 'สำนักการช่าง'),
(29, '13/9/2562', 'CNTR-1818/62', 'บริษัท กรีนเวิร์ค แอสโซซิเอท จำกัด', 'เงินสด  / 1 ปี ', '24,750.00', 'จ้างเหมาซ่อมแซมถนนแอสฟัลติกคอนกรีต ในความรับผิดชอบของเทศมบาลนครรังสิต', 'ยังไม่คืน', '2/10/2563', 'สำนักการช่าง'),
(30, '13/9/2562', 'CNTR-1827/62', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', 'เงินสด  / 1 ปี ', '9,220.00', 'จ้างซ่อมรถเกษตรอีแต๋น ทะเบียน 026 50 000', 'ยังไม่คืน', '27/12/2562', 'สำนักการช่าง'),
(31, '17/9/2562', 'CNTR-1840/62', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', 'หนังสือค้ำประกันเลขที่ ค.00019/200209/0045/62 / 1 ปี ', '5,900.00', 'จ้างซ่อมรถบรรทุกซานต่ำ ทะเบียน 82-3255', 'ยังไม่คืน', '24/12/2562', 'งานไฟฟ้าถนน'),
(32, '18/9/2562', 'CNTR-1844/62', 'บริษัท เรเซอร์การไฟฟ้า (ประเทศไทย) จำกัด', 'เงินสด  / 3 เดือน ', '24,075.00', 'ซื้อโคมไฟถนน LED', 'ยังไม่คืน', '2/10/2563', 'งานไฟฟ้าถนน'),
(33, '18/9/2562', 'CNTR-1845/62', 'บริษัท ส.สิงห์อยู่ สปอร์ต จำกัด', 'หนังสือค้ำประกันเลขที่ 0105-0005/2562 / 2 ปี ', '24,940.00', 'ซื้อเครื่องออกกำลังกายกลางแจ้งสแตนเลสพร้อมติดตั้ง', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'งานไฟฟ้าถนน'),
(34, '19/9/2562', 'CNTR-1859/62', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '24,235.00', 'จ้างเหมาซ่อมแซมถนนคอนกรีตเสริมเหล็ก (ซ.รังสิต-นครนายก 46 และ ซ.รังสิต-นครนายก 2)', 'ยังไม่คืน', '19/1/2563', 'งานไฟฟ้าถนน'),
(35, '25/9/2562', 'CNTR-1889/62', 'บริษัท เจ ซอฟท์ จำกัด', 'เงินสด  / 3 เดือน ', '4,641.00', 'ซื้อเครื่องเสียง', 'ยังไม่คืน', '26/11/2563', 'งานไฟฟ้าถนน'),
(36, '27/9/2562', 'CNTR-1892/62', 'บริษัท ธนกุลดีไซน์ แอนด์ เดคคอร์ จำกัด', 'เช็คเลขที่ 00512289 / 1 ปี ', '24,300.00', 'โครงการติดตั้งไฟฟ้าส่องสว่างบริเวณทางแยกสาธารณะถนนภายในเขตเทศบาล', 'ยังไม่คืน', '18/2/2564', 'งานไฟฟ้าถนน'),
(37, '1/10/2562', 'CNTR-9/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัดชั่น', 'เงินสด  / 1 ปี ', '135,000.00', 'การจ้างเหมาดูแลบำรุงรักษาต้นไม้และสวนหย่อมภายในเขตเทศบาล', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'งานสวนสาธารณะสำนักการช่าง'),
(38, '5/11/2562', 'CNTR-106/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '19,350.00', 'โครงการปรับปรุงห้องชมรมผู้สูงอายุ ซอยรังสิต-ปทุมธานี 14 ซอย 11', 'ยังไม่คืน', '7/1/2564', 'สำนักการช่าง'),
(39, '12/12/2562', 'CNTR-264/63', 'บริษัท สุทธิพงษ์ ไลท์ติ้ง จำกัด', 'เงินสด  / 1 ปี ', '34,000.00', 'ซื้อโคมไฟฟ้าถนนครุภัณฑ์ไฟฟ้าและวิทยุ', 'ยังไม่คืน', '6/2/2564', 'งานไฟฟ้าถนน'),
(40, '8/1/2563', 'CNTR-407/63', 'ห้างหุ้นส่วนจำกัด ปทุมธานีวัสดุภัณฑ์', 'เงินสด  / 1 ปี ', '3,125.00', 'ซื้อเก้าอี้โครงเหล็กบุนวม', 'ยังไม่คืน', '6/2/2564', 'สำนักการช่าง'),
(41, '14/1/2563', 'CNTR-292/63', 'บริษัท วรัญญาภรณ์ คอนสตรัคชั่น จำกัด', 'หนังสือค้ำประกันเลขที่ 0102-0006/2562 / 2 ปี ', '44,200.00', 'โครงการก่อสร้างถนน คสล. ซอยรังสิต-นครนายก 26 (ช่วงท้ายซอย) (ข้างโลตัส)', 'ยังไม่คืน', '15/4/2565', 'สำนักการช่าง'),
(42, '14/1/2563', 'CNTR-293/63', 'บริษัท วรัญญาภรณ์ คอนสตรัคชั่น จำกัด', 'หนังสือค้ำประกันเลขที่ 0102-0007/2562 / 2 ปี ', '70,000.00', 'โครงการก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิต-นครนายก 10 (ยกระดับผิวจราจรเดิม)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(43, '14/1/2563', 'CNTR-294/63', 'บริษัท วรัญญาภรณ์ คอนสตรัคชั่น จำกัด', 'หนังสือค้ำประกันเลขที่ 0102-0008/2562 / 2 ปี ', '49,000.00', 'โครงการก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิต-ปทุมธานี 8 (หมู่บ้านแก้วกาญจน์ ซอย 3)', 'ยังไม่คืน', '18/4/2565', 'สำนักการช่าง'),
(44, '14/1/2563', 'CNTR-318/63', 'บริษัท วรัญญาภรณ์ คอนสตรัคชั่น จำกัด', 'หนังสือค้ำประกันเลขที่ 0102-0009/2562 / 2 ปี ', '45,400.00', 'โครงการก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิต-นครนายก 13 ซอย 13/1', 'ยังไม่คืน', '4/4/2565', 'สำนักการช่าง'),
(45, '16/1/2563', 'CNTR-446/63', 'บริษัท บราโว คิดส์ จำกัด', 'หนังสือค้ำประกันเลขที่ 233820000011 / 2 ปี ', '14,635.00', 'จ้างเหมาโครงการปูพื้นยางพาราบริเวณเครื่องเล่นปากซอยรังสิต-นครนายก 4', 'ยังไม่คืน', '7/2/2565', 'สำนักการช่าง'),
(46, '17/1/2563', 'CNTR-452/63', 'บริษัท เซิท คอนแทรคเตอร์ จำกัด', 'หนังสือค้ำประกันเลขที่ 100029703420 / 2 ปี ', '23,485.00', 'จ้างเหมาโครงการติดตั้งป้ายชื่อซอยตามอัตลักษณ์เมือง        จำนวน 15 ป้าย', 'ยังไม่คืน', '14/3/2565', 'สำนักการช่าง'),
(47, '20/1/2563', 'CNTR-462/63', 'บริษัท แพลนนิ่ง แอนด์ รีเสิร์ช คอนซัลแทนต์ จำกัด', 'หนังสือค้ำประกันเลขที่ ๐๐๐๑๙/๒๐๐๐๓๙/๐๐๐๓/๖๓ / 4 เดือน ', '36,000.00', 'ออกแบบสะพาน คสล.ข้าม', 'ยังไม่คืน', '4 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(48, '22/1/2563', 'CNTR-479/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '7,400.00', 'โครงการติดตั้งสวนแบบแนวตั้งบริเวณศาลาพักผู้โดยสารบริเวณหมู่บ้านมัณฑนา 2', 'ยังไม่คืน', '25/2/2565', 'สำนักการช่าง'),
(49, '22/1/2563', 'CNTR-480/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '5,000.00', 'โครงการติดตั้งสวนแบบแนวตั้งบริเวณด้านข้างกำแพงทางออกสำนักงานเทศบาลนครรังสิต', 'ยังไม่คืน', '6/3/2565', 'สำนักการช่าง'),
(50, '28/1/2563', 'CNTR-504/63', 'ห้างหุ้นส่วนจำกัด มัลติ ซัพพลาย อีควิปเมนท์ 1998', 'เงินสด  / 1 ปี ', '1,750.00', 'ซื้อโพเดียมไม้', 'ยังไม่คืน', '28/2/2564', 'สำนักการช่าง'),
(51, '28/1/2563', 'CNTR-505/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '5,575.00', 'จ้างเหมาซ่อมแซมขอบฟุตบาททางเท้า บริเวณศาลเจ้าไต่ฮงกง', 'ยังไม่คืน', '20/2/2564', 'สำนักการช่าง'),
(52, '31/1/2563', 'CNTR-515/63', 'ห้างหุ้นส่วนจำกัด ภักดีพรรณ์ คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '57,750.00', 'โครงการก่อสร้างถนน คสล. ซอยรังสิต-นครนายก 26 ซอย 4 (ด้านท้ายซอย) (ซอยป้าแฟง)', 'ยังไม่คืน', '9/5/2565', 'สำนักการช่าง'),
(53, '4/2/2563', 'CNTR-527/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '24,700.00', ' จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 24 ', 'ยังไม่คืน', '19/2/2565', 'สำนักการช่าง'),
(54, '6/2/2563', 'CNTR-550/63', 'บริษัท วิรุฬห์ แอนด์ เกวนเนส จำกัด', 'หนังสือค้ำประกันเลขที่ 100029997017 / 1 ปี ', '127,000.00', 'ซื้อดำเนินการโครงการติดตั้งเครื่องสูบน้ำสถานีสูบน้ำ ซอยรังสิต-ปทุมธานี 15 (ท้ายซอย)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(55, '7/2/2563', 'CNTR-559/63', 'บริษัท โตวันทรานสปอร์ต จำกัด', 'หนังสือค้ำประกันเลขที่ 02239201000024 / 2 ปี ', '221,250.00', 'จ้างก่อสร้างก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ คสล.ซอยพหลโยธิน 105 (กรุงเทพเมืองใหม่)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(56, '17/2/2563', 'CNTR-593/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,000.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก บริเวณซอยรังสิต-นครนายก 59', 'ยังไม่คืน', '4/3/2565', 'สำนักการช่าง'),
(57, '17/2/2563', 'CNTR-596/63', 'ห้างหุ้นส่วนจำกัด มัลติ ซัพพลาย อีควิปเมนท์ 1998', 'เงินสด  / 7 วัน ', '1,260.00', 'ซื้อเครื่องฉีดน้ำแรงดันสูง พร้อมอุปกรณ์ จำนวน ๑ เครื่อง', 'ยังไม่คืน', '7 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(58, '18/2/2563', 'CNTR-605/63', 'บริษัท เอ็นจินีโอ จำกัด', 'เงินสด  / 2 ปี ', '24,370.00', 'จ้างเหมาโครงการปรับปรุงระบบไฟฟ้าส่องสว่างศาลารอรถโดยสารโดยใช้พลังงานทดแทน ศาลารอรถโดยสารบริเวณหมู่บ้านสีวลี 1 ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(59, '20/2/2563', 'CNTR-628/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '7,510.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก บริเวณท้ายซอยหมู่บ้านพฤกษาวิลล์ ', 'ยังไม่คืน', '6/3/2565', 'สำนักการช่าง'),
(60, '27/2/2563', 'CNTR-672/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '8,450.00', 'จ้างเหมาโครงการปรับปรุงอาคารอเนกประสงค์ ซอยรังสิต-นครนายก ๒๖ ', 'ยังไม่คืน', '24/4/2565', 'สำนักการช่าง'),
(61, '9/3/2563', 'CNTR-739/63', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '23,830.00', 'จ้างเหมาซ่อมแซมถนนแอสฟัลติกคอนกรีต ซอยรังสิต-นครนายก 46 และ ซอยรังสิต-ปทุมธานี 29 (งานไพร์โค๊ต)', 'ยังไม่คืน', '14/3/2564', 'งานไฟฟ้าถนน'),
(62, '10/3/2563', 'CNTR-744/63', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '24,390.00', 'จ้างซ่อมเปลี่ยนสายไฟเบอร์ออฟติกภายในเขตเทศบาลนครรังสิต', 'ยังไม่คืน', '10/4/2564', 'งานไฟฟ้าถนน'),
(63, '12/3/2563', 'CNTR-757/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '24,700.00', 'จ้างเหมาติดตั้งโคมไฟฟ้าถนน หลอด LED Tube 2 x 18 วัตต์ 470 ชุด', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(64, '13/3/2563', 'CNTR-759/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '24,700.00', 'โครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 4', 'ยังไม่คืน', '31/3/2565', 'สำนักการช่าง'),
(65, '13/3/2563', 'CNTR-766/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '10,420.00', 'จ้างเหมาซ่อมแซมห้องน้ำ ทาสีเวทีกิจกรรม ทาสีเสาไฟและติดตั้งตาข่าย บริเวณสวนสาธารณะ ซอยรังสิต-ปทุมธานี 14 ซอย 11', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(66, '16/3/2563', 'CNTR-769/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '11,300.00', 'โครงการปรับปรุงฝาบ่อพัก เลียบคลองรังสิตประยูรศักดิ์ ช่วงระหว่างซอยรังสิต-นครนายก 16 ถึงซอยรังสิต-นครนายก 18', 'ยังไม่คืน', '31/3/2565', 'สำนักการช่าง'),
(67, '16/3/2563', 'CNTR-773/63', 'ห้างหุ้นส่วนจำกัด ธนยังวนิชเศรษฐ', 'เงินสด  / 2 ปี ', '92,000.00', 'โครงการก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิต-นครนายก 45 (ส่วนที่เหลือ)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(68, '17/3/2563', 'CNTR-580/63', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'หนังสือค้ำประกันเลขที่ 100029980920 / 2 ปี ', '112,000.00', 'จ้างก่อสร้างโครงการปรับปรุงบริเวณทางแยกปากซอยรังสิต-นครนายก 30 ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(69, '17/3/2563', 'CNTR-582/63', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'หนังสือค้ำประกันเลขที่ 100029987127 / 2 ปี ', '73,500.00', 'จ้างก่อสร้างก่อสร้างถนนผิวจราจรแอสฟัลท์ติกคอนกรีตถนนเลียบคลองรังสิตประยูรศักดิ์ ช่วงระหว่างถนนพหลโยธิน ถึง ซอยรังสิต-นครนายก 2', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(70, '17/3/2563', 'CNTR-775/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '24,925.00', 'จ้างเหมาซ่อมแซมฟุตบาททางเท้า บริเวณหมู่บ้านเอื้ออาทรรังสิต', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(71, '18/3/2563', 'CNTR-784/63', 'บริษัท พรวิเศษ วิศว์ จำกัด', 'เงินสด  / 4 เดือน ', '32,717.00', 'จ้างออกแบบออกแบบงานภูมิทัศน์บริเวณที่ดินเทศบาล ซอยรังสิต-นครนายก 30 (ซอยโรงสี)', 'ยังไม่คืน', '4 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(72, '20/3/2563', 'CNTR-798/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,030.00', 'จ้างซ่อมเครื่องเติมอากาศ  (๖๓๓ ๕๙ ๐๐๐๖)', 'ยังไม่คืน', '2/4/2565', 'สำนักการช่าง'),
(73, '30/3/2563', 'CNTR-847/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '24,700.00', ' จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 12 ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(74, '31/3/2563', 'CNTR-859/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 3 เดือน ', '5,590.00', 'จ้างเหมาซ่อมแซมป้ายประชาสัมพันธ์บอกเส้นทางภายในเขตเทศบาลนครรังสิต ', 'ยังไม่คืน', '8/7/2563', 'สำนักการช่าง'),
(75, '2/4/2563', 'CNTR-872/63', 'บริษัท แอดวานซ์ ดิจิตอล ซินเนอร์ยี จำกัด', 'เงินสด  / 1 ปี ', '7,360.00', 'ซ่อมแซมลานแอโรบิค', 'ยังไม่คืน', '20/5/2564', 'สำนักการช่าง'),
(76, '3/4/2563', 'CNTR-875/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '23,700.00', 'จ้างเหมาซ่อมแซมฝาบ่อพัก บริเวณซอยรังสิต-นครนายก 31', 'ยังไม่คืน', '15/4/2564', 'สำนักการช่าง'),
(77, '7/4/2563', 'CNTR-890/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '9,000.00', 'จ้างเหมาซ่อมแซมฟุตบาททางเท้า บริเวณปากซอยรังสิต-นครนายก 36', 'ยังไม่คืน', '15/4/2564', 'สำนักการช่าง'),
(78, '8/4/2563', 'CNTR-900/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '9,710.00', 'จ้างเหมาซ่อมแซมฟุตบาททางเท้า บริเวณปากซอยรังสิต-นครนายก 36', 'ยังไม่คืน', '29/4/2564', 'สำนักการช่าง'),
(79, '17/4/2563', 'CNTR-954/63', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '475', 'ซื้อครุภัณฑ์งานบ้านงานครัว (เครื่องตัดหญ้าแบบข้อแข็ง) จำนวน ๑ เครื่อง', 'ยังไม่คืน', '28/4/2564', 'สำนักการช่าง'),
(80, '17/4/2563', 'CNTR-955/63', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '3,040.00', 'ซื้อครุภัณฑ์โรงงาน (เครื่องเจีย,เครื่องตัดเหล็ก และเลื่อยวงเดือนไฟฟ้า) จำนวน ๑ งาน ', 'ยังไม่คืน', '16/5/2564', 'สำนักการช่าง'),
(81, '21/4/2563', 'CNTR-961/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '12,200.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่าง บริเวณเครื่องออกกำลังกาย ปากซอยรังสิต-นครนายก 4 ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(82, '21/4/2563', 'CNTR-964/63', 'ห้างหุ้นส่วนจำกัด เดชปภัช คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '37,000.00', 'จ้างก่อสร้างโครงการก่อสร้างบ่อพัก คสล.ปากซอยรังสิต-นครนายก 6 ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(83, '30/4/2563', 'CNTR-1021/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '7,965.00', 'จ้างเหมาซ่อมแซมพื้นคอนกรีตลานเครื่องอัดขยะมูลฝอยในสถานีขนถ่ายขยะมูลฝอย', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(84, '7/5/2563', 'CNTR-1028/63', 'ห้างหุ้นส่วนจำกัด สหผลวัฒนาโยธาการ', 'หนังสือค้ำประกันเลขที่ ค.47690297651000 / 2 ปี ', '215,000.00', 'จ้างก่อสร้างก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ คสล.ถนนเลียบคลองรังสิตประยูรศักดิ์ฝั่งใต้ ช่วงหมู่บ้านสีวลี 2 ถึงหมู่บ้านมัณฑนา 2', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(85, '13/5/2563', 'CNTR-1036/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 3 เดือน ', '12,100.00', 'จ้างเหมาซ่อมแซมระบบสปริงเกอร์รดน้ำต้นไม้สวนสาธารณะ ภายในเขตเทศบาลนครรังสิต ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(86, '18/5/2563', 'CNTR-1069/63', 'บริษัท พรประเสริฐ การโยธา จำกัด', 'หนังสือค้ำประกันเลขที่ 02237201000231 / 2 ปี ', '389,500.00', 'จ้างก่อสร้างก่อสร้างถนนคอนกรีตเสริมเหล็ก รหัสทางหลวงท้องถิ่น ปท.ถ6-0060 สายซอยรังสิต-นครนายก 42 ชุมชนคุ้มเกล้าอยู่เจริญ 2', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(87, '19/5/2563', 'CNTR-1074/63', 'บริษัท วันชัย 1992 จำกัด', 'หนังสือค้ำประกันเลขที่ 00019/201269/0019/63 / 5 ปี ', '360,000.00', 'จ้างก่อสร้างก่อสร้างถนนคอนกรีตเสริมเหล็กพร้อมวางท่อระบายน้ำคอนกรีตเสริมเหล็ก รหัสทางหลวงท้องถิ่น สายซอยรังสิต-นครนายก 56 (ช่วง 2) ชุมชนหมู่บ้านธารารินทร์ (วัดจันทรสุข)', 'ยังไม่คืน', '5 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(88, '20/5/2563', 'CNTR-1083/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '11,500.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพักเลียบคลองรังสิตประยูรศักดิ์ ช่วงระหว่าง ซอยรังสิต-นครนายก 18 ถึง ซอยรังสิต-นครนายก 22 ', 'ยังไม่คืน', '28/5/2565', 'สำนักการช่าง'),
(89, '20/5/2563', 'CNTR-1086/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '24,235.00', 'จ้างเหมาซ่อมแซมถนนคอนกรีตเสริมเหล็ก ซอยรังสิต-ปทุมธานี 31', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(90, '20/5/2563', 'CNTR-1087/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '14,600.00', ' จ้างเหมาโครงการปรับปรุงประตูระบายน้ำบริเวณหน้าปากซอยรังสิต-นครนายก 32 ', 'ยังไม่คืน', '20/6/2565', 'สำนักการช่าง'),
(91, '25/5/2563', 'CNTR-1097/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '17,100.00', 'จ้างติดตั้งไฟฟ้าส่องสว่างทางสาธารณะบริเวณซอยรังสิต-นครนายก 28', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(92, '25/5/2563', 'CNTR-1098/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,400.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-ปทุมธานี 17 ช่วงกลางซอย (ช่วง 1)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(93, '11/6/2563', 'CNTR-1164/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,300.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพักช่วงหมู่บ้านลุมพินีถึงปากซอยรังสิต-นครนายก 26 ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(94, '22/6/2563', 'CNTR-1182/63', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', 'เงินสด  / 3 เดือน ', '7,000.00', 'จ้างซ่อมรถแบคโฮ ตค ๖๕', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(95, '1/7/2563', 'CNTR-1228/63', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '9,600.00', 'จ้างซ่อมรถดูดสิ่งปฏิกูล ทะเบียน ๘๒-๐๗๗๕ (๐๐๙ ๔๘ ๐๐๐๒) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(96, '1/7/2563', 'CNTR-1230/63', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '8,300.00', 'จ้างซ่อมรถดูดสิ่งปฏิกูล ทะเบียน 82-0776', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(97, '8/7/2563', 'CNTR-1246/63', 'ห้างหุ้นส่วนจำกัด เอทีเอส ซัพพลาย', 'เงินสด  / 1 ปี ', '33,438.00', 'ซื้อครุภัณฑ์ไฟฟ้า (โคมไฟฟ้าถนน) ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(98, '10/7/2563', 'CNTR-1261/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '23,510.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่าง บริเวณสวนสาธารณะ ซอยรังสิต-ปทุมธานี 14 ซอย 16', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(99, '13/7/2563', 'CNTR-1266/63', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', 'เงินสด  / 3 เดือน ', '7,900.00', 'จ้างซ่อมตู้บรรทุกขยะ เบอร์๘ (๐๒๘ ๕๑ ๐๐๑๑) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(100, '17/7/2563', 'CNTR-1294/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '23,600.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 6 ช่วง 3 ท้ายซอย', 'ยังไม่คืน', '1/8/2565', 'สำนักการช่าง'),
(101, '21/7/2563', 'CNTR-1317/63', 'นางสาวนภาพรรณ กลิ่นเกลี้ยง', 'เงินสด  / 15 วัน ', '9,580.00', 'จ้างเหมาลอกท่อระบายน้ำภายในเขตเทศบาลนครรังสิต', 'ยังไม่คืน', '15 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(102, '29/7/2563', 'CNTR-1339/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '13,100.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าจุดตัดแยกสะพานข้ามคลองหน้าหมู่บ้านฟ้าลากูล ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(103, '3/8/2563', 'CNTR-1360/63', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', 'เงินสด  / 3 เดือน ', '9,000.00', 'จ้างซ่อมรถยนต์ทะเบียน ๘๒-๓๒๕๔ (เลขครุภัณฑ์ ๐๖-๕๐-๐๐๐๑) จำนวน ๑ งาน', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(104, '4/8/2563', 'CNTR-1370/63', 'บริษัท ธนกุลดีไซน์ แอนด์ เดคคอร์ จำกัด', 'หนังสือค้ำประกันเลขที่ 02120201000147 / 2 ปี ', '24,300.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่างทางแยกท้ายซอยรังสิต-ปทุมธานี 15', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(105, '21/8/2563', 'CNTR-1452/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '22,210.00', 'จ้างซ่อมรถตักหน้า-ขุดหลัง JCB ทะเบียน ต-๐๓๔๖ ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(106, '25/8/2563', 'CNTR-1482/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 3 เดือน ', '6,120.00', 'จ้างเหมาซ่อมแซมประตูระบายน้ำบริเวณหน้าปากซอยรังสิต-นครนายก 38 ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(107, '28/8/2563', 'CNTR-1494/63', 'บริษัท วิรุฬห์ แอนด์ เกวนเนส จำกัด', 'หนังสือค้ำประกันเลขที่ 100033706140 / 3 เดือน ', '16,237.25', 'จ้างซ่อมเครื่องสูบน้ำ เลขครุภัณฑ์ ๐๕๕ ๖๑ ๐๔๔๕', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(108, '28/8/2563', 'CNTR-1495/63', 'บริษัท วิรุฬห์ แอนด์ เกวนเนส จำกัด', 'หนังสือค้ำประกันเลขที่ 100033706078 / 3 เดือน ', '24,631.40', 'จ้างซ่อมเครื่องสูบน้ำ (๐๕๕ ๕๗ ๐๓๖๗) ,ตู้ควบคุมเครื่องสูบน้ำ (๒๐๒ ๕๗ ๐๐๐๖) และเครื่องเก็บขยะอัติโนมัติ (๖๓๕ ๕๗ ๐๐๐๓) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(109, '31/8/2563', 'CNTR-1510/63', 'ห้างหุ้นส่วนจำกัด พี.ที.สถาปัตย์', 'หนังสือค้ำประกันเลขที่ 00019/200460/0045/63 / 2 ปี ', '247,500.00', 'จ้างก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ คสล.ซอยรังสิต-นครนายก 56 ซอย 2 (หมู่บ้านธารารินทร์)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(110, '31/8/2563', 'CNTR-1512/63', 'บริษัท พรประเสริฐ การโยธา จำกัด', 'หนังสือค้ำประกันเลขที่ 02237201000398 / 2 ปี ', '97,500.00', 'จ้างก่อสร้างโครงการก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ คสล.ซอยรังสิต-นครนายก 57 (ซอยเจ้าจอม)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(111, '2/9/2563', 'CNTR-1535/63', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '5,000.00', ' ซื้อครุภัณฑ์สำรวจ เครื่องหาพิกัดด้วยสัญญาณดาวเทียมแบบพกพา', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(112, '3/9/2563', 'CNTR-1552/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '13,800.00', 'จ้างเหมาโครงการก่อสร้างขยายผิวจราจรถนนเลียบคลองรังสิตประยูรศักดิ์ ปากซอยรังสิต-นครนายก 56', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(113, '14/9/2563', 'CNTR-1568/63', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 3 เดือน ', '23,350.00', 'จ้างเหมาซ่อมแซมถนนแอสฟัลติกคอนกรีต สะพาน ในความรับผิดชอบของเทศบาลนครรังสิต', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(114, '15/9/2563', 'CNTR-1584/63', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '10,000.00', 'ซื้อครุภัณฑ์ก่อสร้าง รถดั้มเปอร์โม่ปูน ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(115, '16/9/2563', 'CNTR-1168/63', 'บริษัท อาควา นิชิฮาร่า คอร์ปอเรชั่น จำกัด', 'หนังสือค้ำประกันเลขที่ 02194201000165 / 1 ปี ', '22,470.00', 'ซ่อมระบบบำบัดน้ำเสีย จำนวน 1 งาน', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(116, '16/9/2563', 'CNTR-1600/63', 'ห้างหุ้นส่วนจำกัดอมรเทพ วิศวกรรม', 'เงินสด ', '14,300.00', 'จ้างเหมาเอกชนกำจัดขยะมูลฝอยภายในเขตเทศบาลนครรังสิต ตั้งแต่วันที่ 17-30 กันยายน 2563 ', 'ยังไม่คืน', '2/10/2563', 'สำนักการช่าง'),
(117, '17/9/2563', 'CNTR-1604/63', 'ห้างหุ้นส่วนจำกัดอมรเทพ วิศวกรรม', 'เงินสด ', '393,250.00', 'จ้างจ้างเหมาเอกชนกำจัดขยะมูลฝอยในเขตเทศบาล', 'ยังไม่คืน', '1/10/2564', 'สำนักการช่าง'),
(118, '17/9/2563', 'CNTR-1612/63', 'บริษัท เฮอร์ริเทจ อินเตอร์เนชั่ลแนล โพร์วายเดอร์ จำกัด', 'เงินสด  / 1 ปี ', '1,000.00', 'ซื้อครุภัณฑ์สำนักงาน (ตู้ไม้เข้าผนัง)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(119, '17/9/2563', 'CNTR-1613/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '19,000.00', 'จ้างเหมาก่อสร้างเวทีผู้นำออกกำลังกาย พร้อมติดตั้ง   ให้แก่กองการศึกษา', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(120, '21/9/2563', 'CNTR-1625/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '24,640.00', 'จ้างเหมาติดตั้งโคมไฟถนน หลอด LED Tube 2 x 18 วัตต์', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(121, '22/9/2563', 'CNTR-1631/63', 'ห้างหุ้นส่วนจำกัด ราไชศวรรย์', 'หนังสือค้ำประกันเลขที่ 02071201000118 / 2 ปี ', '82,000.00', 'โครงการปรับปรุงสะพานโรงเรียนทองพูนอุทิศ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(122, '22/9/2563', 'CNTR-1638/63', 'นางสาวนภาพรรณ กลิ่นเกลี้ยง', 'เงินสด  / 15 วัน ', '20,340.00', 'จ้างเหมาปรับปรุงภูมิทัศน์ บริเวณเกาะกลางถนนริมเขื่อนโรงเรียนประชาธิปัตย์ ', 'ยังไม่คืน', '15 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(123, '22/9/2563', 'CNTR-1643/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 3 เดือน ', '23,450.00', 'จ้างเหมาซ่อมแซมลานวางตู้คอนเทนเนอร์และรางระบายน้ำสถานีขนถ่ายขยะมูลฝอย', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(124, '23/9/2563', 'CNTR-1645/63', 'บริษัท พี ซี คอนกรีตปทุมธานี จำกัด', 'หนังสือค้ำประกันเลขที่ ค.47690308443000 / 2 ปี ', '24,100.00', 'จ้างเหมาซ่อมแซมลานวางตู้คอนเทนเนอร์และรางระบายน้ำสถานีขนถ่ายขยะมูลฝอย', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(125, '23/9/2563', 'CNTR-1647/63', 'ห้างหุ้นส่วนจำกัด สหผลวัฒนาโยธาการ', 'หนังสือค้ำประกันเลขที่ ค.47690308445000 / 2 ปี ', '24,000.00', 'จ้างเหมาโครงการปรับปรุงระบบจราจร บริเวณซอยรังสิต-นครนายก 46 (ถนนเสมา-ฟ้าคราม) ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(126, '23/9/2563', 'CNTR-1649/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 3 เดือน ', '6,100.00', 'จ้างซ่อมแซมอาคารหอประชุม ๑๐๐ ปี เมืองธัญญบูรี จำนวน ๑ งาน', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(127, '24/9/2563', 'CNTR-1651/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,345.00', 'จ้างเหมาซ่อมแซมฝาบ่อพัก บริเวณซอยรังสิต-นครนายก 59 (ช่วงที่ 2 กลางซอย)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(128, '24/9/2563', 'CNTR-1655/63', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '5,000.00', 'ซื้อปั๊มชักมอเตอร์ไฟฟ้า', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'งานไฟฟ้าถนน'),
(129, '25/9/2563', 'CNTR-1658/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 3 เดือน ', '24,350.00', 'จ้างเหมาซ่อมแซมทางเดินเท้าแบบอิฐตัวหนอน บริเวณริมถนนรังสิต-นครนายก (ฝั่งเหนือ)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(130, '25/9/2563', 'CNTR-1663/63', 'กิจการร่วมค้า เอส.เอ็ม.ซี.', 'หนังสือค้ำประกันเลขที่ 800351053896 / 2 ปี ', '127,232.00', 'างก่อสร้างรั้ว คสล. ศูนย์พึ่งพิงสุนัขจรจัดคลองสิบสอง (ตั้งจ่ายรายการใหม่ 2561)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(131, '29/9/2563', 'CNTR-1688/63', 'บริษัท รักษาความปลอดภัย พิทักษ์ชน การ์ด เซอร์วิส จำกัด', 'เงินสด  / 15 วัน ', '52,002.00', 'จ้างเหมารักษาความปลอดภัยสถานีขนถ่ายขยะมูลฝอย ฝั่งตะวันออก (ซอยรังสิต-นครนายก 17)', 'ยังไม่คืน', '15 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(132, '29/9/2563', 'CNTR-1689/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 15 วัน ', '142,500.00', 'จ้างเหมาดูแลบำรุงรักษาต้นไม้และสวนหย่อมภายในเขตเทศบาล', 'ยังไม่คืน', '15 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(133, '29/9/2563', 'CNTR-1690/63', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'หนังสือค้ำประกันเลขที่ 100034236024 / 2 ปี ', '242,500.00', 'จ้างก่อสร้างปรับปรุงผิวจราจรพาราแอสฟัลท์ติกคอนกรีต ซอยรังสิต-นครนายก 58', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(134, '30/9/2563', 'CNTR-1691/63', 'บริษัท เมืองสะอาด จำกัด', 'หนังสือค้ำประกันเลขที่ ค.47690309110000', '5,894,933.00', 'จ้างเอกชนจัดเก็บขยะมูลฝอยในเขตเทศบาลนครรังสิต ปีงบประมาณ พ.ศ.2564-2568', 'ยังไม่คืน', '1/10/2568', 'สำนักการช่าง'),
(135, '7/12/2563', 'CNTR-1693/63', 'บริษัท รักษาความปลอดภัย เอ็ม.วาย.เซอร์วิส จำกัด', 'หนังสือค้ำประกันเลขที่ 02192201000592 / 15 วัน ', '36,000.00', 'จ้างเหมารักษาความปลอดภัยอาคารโรงเก็บพัสดุ หลังวัดจันทรสุข (ซอยรังสิต-นครนายก 56)', 'ยังไม่คืน', '15 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(136, '7/10/2563', 'CNTR-24/64', 'นางศิริทิพย์  จันทร์เพ็ญ', 'เงินสด ', '5,087.00', 'จ้างเหมาดูแลสวนเฉลิมพระเกียรติภักดีราชา ซอยรังสิต-นครนายก 45', 'ยังไม่คืน', '2/10/2564', 'สำนักการช่าง'),
(137, '21/10/2563', 'CNTR-56/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 3 เดือน ', '18,731.00', 'จ้างเหมาซ่อมแซมเครื่องออกกำลังกายและเครื่องเล่นสนาม', 'ยังไม่คืน', '3/2/2564', 'สำนักการช่าง'),
(138, '26/10/2563', 'CNTR-71/64', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '10,465.00', 'จ้างซ่อมรถแบคโฮ ทะเบียน ตค ๖๕', 'ยังไม่คืน', '16/9/2564', 'สำนักการช่าง'),
(139, '29/10/2563', 'CNTR-95/64', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '7,656.00', 'จ้างเหมาซ่อมแซมเครื่องอัดขยะมูลฝอย ๒ เครื่อง (เลขครุภัณฑ์ ๓๒๙ ๕๑ ๐๐๐๑ และ ๓๒๙ ๕๔ ๐๐๐๒)', 'ยังไม่คืน', '15 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(140, '18/11/2563', 'CNTR-183/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '17,980.00', ' จ้างซ่อมเครื่องอัดขยะมูลฝอยเครื่องที่๒ (๓๒๙ ๕๔ ๐๐๐๒)', 'ยังไม่คืน', '24/2/2564', 'สำนักการช่าง'),
(141, '18/11/2563', 'CNTR-184/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '6,030.00', 'จ้างซ่อมแซมรถแบคโฮ ตค ๒๑๗', 'ยังไม่คืน', '28/2/2564', 'สำนักการช่าง'),
(142, '18/11/2563', 'CNTR-185/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '6,560.00', 'จ้างซ่อมรถแบคโฮ ทะเบียน ตค ๒๑๖', 'ยังไม่คืน', '18/12/2563', 'สำนักการช่าง'),
(143, '25/11/2563', 'CNTR-200/64', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 15 วัน ', '21,030.00', 'จ้างเหมาลอกลำรางสาธารณะ บริเวณหลังหมู่บ้านณัฐวรรณ', 'ยังไม่คืน', '3/3/2564', 'สำนักการช่าง'),
(144, '27/11/2563', 'CNTR-215/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '13,655.00', ' จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์ ๒ (๐๒๘ ๕๑ ๐๐๐๖) และเบอร์ ๔ (๐๒๘ ๕๑ ๐๐๐๘)', 'ยังไม่คืน', '8/12/2564', 'สำนักการช่าง'),
(145, '27/11/2563', 'CNTR-216/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '10,481.00', 'จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์ ๑๑ (๐๒๘ ๕๔ ๐๐๑๕)', 'ยังไม่คืน', '8/3/2564', 'สำนักการช่าง'),
(146, '27/11/2563', 'CNTR-219/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '23,800.00', 'จ้างซ่อมแซมฝาบ่อพัก บริเวณปากซอยรังสิต-นครนายก 31', 'ยังไม่คืน', '5/3/2564', 'สำนักการช่าง'),
(147, '27/11/2563', 'CNTR-223/64', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '13,429.00', 'จ้างซ่อมรถบรรทุก ๑๐ ล้อ ทะเบียน ๘๑-๖๘๒๒', 'ยังไม่คืน', '15/3/2564', 'สำนักการช่าง'),
(148, '27/11/2563', 'CNTR-225/64', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '8,132.00', 'จ้างซ่อมรถดูดโคลนเลน ทะเบียน บง-๒๔๗', 'ยังไม่คืน', '10/3/2564', 'สำนักการช่าง'),
(149, '30/11/2563', 'CNTR-231/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '24,645.00', 'ซื้อครุภัณฑ์อื่น (เวทีกิจกรรม แบบถอดประกอบได้ ขนาด 6.00 x 10.00 x 8.00 เมตร จำนวน 1 ชุด) ', 'ยังไม่คืน', '8/3/2564', 'สำนักการช่าง'),
(150, '30/11/2563', 'CNTR-233/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '22,500.00', 'จ้างเหมาซ่อมแซมฝาบ่อพัก บริเวณปากซอยรังสิต-นครนายก 6 จำนวน 10 บ่อพัก', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(151, '3/12/2563', 'CNTR-251/64', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '8,650.00', 'จ้างซ่อมรถขยะคอนเทนเนอร์ ๖ ล้อ ทะเบียน บ-๓๘๓๐ (เลขครุภัณฑ์ ๐๑๑ ๓๘ ๐๐๑๕)', 'ยังไม่คืน', '15/3/2564', 'สำนักการช่าง'),
(152, '3/12/2563', 'CNTR-252/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '6,610.00', 'จ้างซ่อมรถแบคโฮ ทะเบียน ตค-๖๕ (เลขครุภัณฑ์ ๐๑๘ ๔๒ ๐๐๐๔)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(153, '3/12/2563', 'CNTR-253/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '8,944.00', 'จ้างซ่อมรถตักหน้าขุดหลัง JCB ทะเบียน ต-๐๓๔๖ (เลขครุภัณฑ์ ๐๑๘ ๓๗ ๐๐๐๒) ', 'ยังไม่คืน', '15/12/2564', 'สำนักการช่าง'),
(154, '4/12/2563', 'CNTR-271/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '20,923.00', 'จ้างซ่อมตู้บรรทุกขยะ ๒ ตู้เบอร์ ๑๙ (๐๒๘ ๕๔ ๐๐๒๓)และเบอร์ ๒๐ (๐๒๘ ๕๔ ๐๐๒๔)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(155, '4/12/2563', 'CNTR-272/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '15,213.00', 'จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์ ๖ (๐๒๘ ๕๑ ๐๐๑๐) ', 'ยังไม่คืน', '22/3/2564', 'สำนักการช่าง'),
(156, '7/12/2563', 'CNTR-280/64', 'กิจการร่วมค้า เอส.เอ็ม.ซี.', 'หนังสือค้ำประกันเลขที่ 800353554268 / 2 ปี ', '130,633.00', 'จ้างก่อสร้างรั้ว คสล. ศูนย์พึ่งพิงสุนัขจรดจัดคลองสิบสอง (งบประมาณรายจ่ายประจำปี 2562)', 'ยังไม่คืน', '18/3/2564', 'สำนักการช่าง'),
(157, '7/12/2563', 'CNTR-281/64', 'บริษัท วันชัย 1992 จำกัด', 'หนังสือค้ำประกันเลขที่ 00019/201036/0010/63 / 2 ปี ', '177,500.00', 'จ้างก่อสร้างก่อสร้างวางท่อระบายน้ำ คสล.ซอยรังสิต-นครนายก 27 ซอย 3', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(158, '8/12/2563', 'CNTR-284/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '18,910.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่างทางสาธารณะ บริเวณสะพานศาลเจ้าคลองหนึ่ง', 'ยังไม่คืน', '26/12/2564', 'สำนักการช่าง'),
(159, '9/12/2563', 'CNTR-291/64', 'บริษัท พี.เจ.แอนด์ แอล. ก่อสร้าง จำกัด', 'หนังสือค้ำประกันเลขที่ 100034120506 / 2 ปี ', '1,000,000.00', 'จ้างก่อสร้างซ่อมแซมสะพานไม้ข้ามคลองบริเวณคลองรังสิตประยูรศักดิ์ (โรงเรียนศิริศึกษา)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(160, '14/12/2563', 'CNTR-304/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 1 ปี ', '4,200.00', 'ซื้อครุภัณฑ์โรงงาน (ถังเติมน้ำมันเกียร์ จำนวน 2 เครื่อง และ ถังอัดจารบี จำนวน 1 เครื่อง)', 'ยังไม่คืน', '29/3/2564', 'สำนักการช่าง'),
(161, '15/12/2563', 'CNTR-307/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,100.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่างทางสาธารณะ บริเวณซอยรังสิต-ปทุมธานี 27 ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(162, '16/12/2563', 'CNTR-320/64', 'บริษัท เฮอร์ริเทจ อินเตอร์เนชั่ลแนล โพร์วายเดอร์ จำกัด', 'เงินสด  / 1 ปี ', '525', 'จ้างซ่อมเครื่องสูบน้ำ ๕ เครื่อง ', 'ยังไม่คืน', '1 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(163, '21/12/2563', 'CNTR-334/64', 'บริษัท โอลี่ กรุ๊ป จำกัด', 'หนังสือค้ำประกันเลขที่ 00019/200130/0069/63 / 1 ปี ', '24,900.00', 'จ้างเหมาซ่อมแซมสะพานเฉลิมพระเกียรติ หน้าหมู่บ้านรัตนโกสินทร์ 200', 'ยังไม่คืน', '30/12/2564', 'สำนักการช่าง'),
(164, '23/12/2563', 'CNTR-343/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '22,900.00', 'ซื้อครุภัณฑ์สนาม (ชุดหลังคาทรงโค้ง และผ้าใบเต็นท์)', 'ยังไม่คืน', '15 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(165, '25/12/2563', 'CNTR-358/64', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 เดือน ', '21,172.00', 'จ้างเหมาปลูกต้นพุทธรักษา พร้อมดูแล บริเวณริมคลองรังสิตประยูรศักดิ์ (ฝั่งใต้) ช่วงสะพานหน้าหมู่บ้านเปรมปรีดิ์ ถึง สะพานหน้าหมู่บ้านธงชัย', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(166, '25/12/2563', 'CNTR-360/64', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 15 วัน ', '18,750.00', 'จ้างเหมาลอกลำรางสาธารณะ บริเวณซอยรังสิต-นครนายก 27', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(167, '25/12/2563', 'CNTR-363/64', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยา การโยธา', 'หนังสือค้ำประกันเลขที่ ค.47690315831000 / 2 ปี ', '241,000.00', 'จ้างก่อสร้างยกระดับผิวจราจร คสล.ซอยรังสิต-นครนายก 24 (ด้านท้ายซอย) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(168, '7/1/2564', 'CNTR-394/64', 'บริษัท แพลนนิ่ง แอนด์ รีเสิร์ช คอนซัลแทนต์ จำกัด', 'หนังสือค้ำประกันเลขที่ 100036058980', '49,500.00', 'จ้างออกแบบออกแบบการจราจรและการระบายน้ำฯช่วงระหว่างซอยรังสิต-นครนายก 27 ถึง ซอยรังสิต-นครนายก 31', 'ยังไม่คืน', '20/3/2565', 'สำนักการช่าง'),
(169, '8/1/2564', 'CNTR-401/64', 'ห้างหุ้นส่วนจำกัด ปทุมธานีวัสดุภัณฑ์', 'เงินสด  / 1 ปี ', '18,750.00', 'ซื้อครุภัณฑ์ไฟฟ้าและวิทยุ (โคมไฟฟ้าสนาม LED ขนาด 400 W จำนวน 50 ชุด) ', 'ยังไม่คืน', '6/4/2565', 'สำนักการช่าง'),
(170, '8/1/2564', 'CNTR-402/64', 'ห้างหุ้นส่วนจำกัด ปทุมธานีวัสดุภัณฑ์', 'เงินสด  / 1 ปี ', '3,250.00', 'ซื้อครุภัณฑ์สำนักงาน (เก้าอี้โครงเหล็กบุนวม พร้อมสกรีนหลัง เทศบาลนครรังสิต จำนวน 100 ตัว)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(171, '8/1/2564', 'CNTR-404/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '21,400.00', ' จ้างซ่อมรถยนต์และเครื่องสูบน้ำ (๐๕๕ ๕๓ ๐๒๒๔,๘๒-๓๒๕๒,ถข ๑,๘๑-๖๒๙๗,๘๒-๓๒๕๕,บท ๔๕๘๑,บต-๓๘๔๗)', 'ยังไม่คืน', '11/2/2565', 'สำนักการช่าง'),
(172, '11/1/2564', 'CNTR-415/64', 'บริษัท โตโยต้าเภตรา จำกัด', 'เช็คเลขที่ 17256598 / 1 ปี ', '68,200.00', 'ซื้อครุภัณฑ์ยานพาหนะและขนส่ง รถโดยสารขนาด 12 ที่นั่ง (ดีเซล) จำนวน 1 คัน (สำนักการช่าง)', 'ยังไม่คืน', '14/1/2565', 'สำนักการช่าง'),
(173, '12/1/2564', 'CNTR-419/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '23,330.00', 'จ้างเหมาโครงการติดตั้งระบบสปริงเกอร์รดน้ำต้นไม้ บริเวณเกาะกลางถนน บริเวณซอยพหลโยธิน 127 ', 'ยังไม่คืน', '26/2/2565', 'สำนักการช่าง'),
(174, '13/1/2564', 'CNTR-436/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '23,850.00', 'โครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-ปทุมธานี 24 ช่วงที่ 2 กลางซอย', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(175, '14/1/2564', 'CNTR-441/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '7,070.00', 'จ้างเหมาโครงการติดตั้งตู้ควบคุมไฟสวนสาธารณะ ซอยรังสิต-ปทุมธานี 14 ซอย 11', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(176, '15/1/2564', 'CNTR-454/64', 'บริษัท พัชรี เฮฟวี่ แมชชีนเนอรี่ จำกัด', 'หนังสือค้ำประกันเลขที่ 02256211000001 / 1 ปี ', '169,950.00', 'ซื้อครุภัณฑ์ก่อสร้าง (จัดซื้อรถตักหน้าขุดหลัง แบบขับเคลื่อนสี่ล้อ จำนวน 1 คัน) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(177, '15/1/2564', 'CNTR-455/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '6,265.00', 'จ้างซ่อมรถดูดสิ่งปฏิกูล ทะเบียน 82-0775', 'ยังไม่คืน', '3/2/2566', 'สำนักการช่าง'),
(178, '15/1/2564', 'CNTR-457/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '18,600.00', 'จ้างเหมาโครงการติดตั้งตู้ควบคุมการเปิด-ปิดไฟทางอัตโนมัติ บริเวณชุมชนในเขตเทศบาลนครรังสิต (จำนวน 16 จุด)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(179, '15/1/2564', 'CNTR-460/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '23,900.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 12 ช่วงกลางซอย ', 'ยังไม่คืน', '19/2/2565', 'สำนักการช่าง'),
(180, '18/1/2564', 'CNTR-467/64', 'บริษัท ดับบลิวอีสิบเก้าเอ็นจิเนียริ่ง จำกัด', 'หนังสือค้ำประกันเลขที่ 100036170977 / 2 ปี ', '188,500.00', 'จ้างก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ คสล.ซอยรังสิต-ปทุมธานี 10 ซอย 12 ', 'ยังไม่คืน', '10/2/2565', 'สำนักการช่าง'),
(181, '18/1/2564', 'CNTR-473/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,700.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 67', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(182, '19/1/2564', 'CNTR-477/64', 'บริษัท แสงชัย ไลท์ติ้ง จำกัด', 'เงินสด  / 1 ปี ', '67,500.00', 'ซื้อครุภัณฑ์ไฟฟ้าและวิทยุ (โคมไฟฟ้าถนน)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(183, '20/1/2564', 'CNTR-483/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,500.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 26', 'ยังไม่คืน', '26/2/2565', 'สำนักการช่าง'),
(184, '20/1/2564', 'CNTR-498/64', 'บริษัท วันชัย 1992 จำกัด', 'หนังสือค้ำประกันเลขที่ 00019/201036/0003/64 / 2 ปี ', '280,000.00', 'จ้างก่อสร้างก่อสร้างขยายผิวจราจรบริเวณปากซอยรังสิต-นครนายก 31 ', 'ยังไม่คืน', '2/2/2565', 'สำนักการช่าง'),
(185, '22/1/2564', 'CNTR-508/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,500.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-ปทุมธานี 17 (ช่วง 2)', 'ยังไม่คืน', '30/4/2564', 'สำนักการช่าง'),
(186, '26/1/2564', 'CNTR-527/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '12,500.00', 'จ้างซ่อมรถ ๒ คัน (ทะเบียน ๘๑-๗๒๘๑ และ บฉ-๖๙๔๐)', 'ยังไม่คืน', '12/2/2565', 'สำนักการช่าง'),
(187, '27/1/2564', 'CNTR-533/64', 'บริษัท ส.สิงห์อยู่ สปอร์ต จำกัด', 'เงินสด  / 1 ปี ', '24,980.00', 'ซื้อครุภัณฑ์กีฬา (เครื่องออกกำลังกายกลางแจ้งสแตนเลส พร้อมติดตั้ง) ', 'ยังไม่คืน', '19/3/2565', 'สำนักการช่าง'),
(188, '28/1/2564', 'CNTR-539/64', 'บริษัท น่ำเฮงพรชัย จำกัด', 'เงินสด  / 1 ปี ', '9,630.00', 'ซื้อครุภัณฑ์โรงงาน (เครื่องผสมปุ๋ยแบบแนวนอนติดมอเตอร์10แรง) สำนักการช่าง', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(189, '28/1/2564', 'CNTR-542/64', 'บริษัท เก้า-ห้า โปร จำกัด', 'เงินสด  / 1 ปี ', '2,600.00', 'ซื้อครุภัณฑ์สำนักงาน (ถังน้ำพลาสติก ขนาด 3,000 ลิตร จำนวน 4 ใบ)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(190, '29/1/2564', 'CNTR-547/64', 'บริษัท เรเซอร์การไฟฟ้า (ประเทศไทย) จำกัด', 'หนังสือค้ำประกันเลขที่ ค.47690320409000 / 1 ปี ', '24,075.00', 'ซื้อครุภัณฑ์ไฟฟ้าและวิทยุ (โคมไฟฟ้าถนน LED)', 'ยังไม่คืน', '26/3/2565', 'สำนักการช่าง'),
(191, '29/1/2564', 'CNTR-551/64', 'บริษัท นาราธร 14 คอร์ปอเรชั่น จำกัด', 'เงินสด ', '11,250.00', 'ออกแบบสวนสาธารณะชุมชนวรุณพร', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(192, '1/2/2564', 'CNTR-565/64', 'บริษัท บราโว คิดส์ จำกัด', 'หนังสือค้ำประกันเลขที่ 233821000055 / 1 ปี ', '24,750.00', 'ซื้อเครื่องเล่นสนามกลางแจ้ง', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(193, '2/2/2564', 'CNTR-582/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 3 เดือน ', '5,300.00', 'จ้างก่อสร้างก่อสร้างถนนผิวจราจรแอสฟัลท์ติกคอนกรีตถนนเลียบคลองรังสิตประยูรศักดิ์ ช่วงระหว่างถนนพหลโยธิน ถึง ซอยรังสิต-นครนายก 2 ', 'ยังไม่คืน', '19/2/2565', 'สำนักการช่าง'),
(194, '2/2/2564', 'CNTR-583/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 3 เดือน ', '21,400.00', ' จ้างเหมาซ่อมแซมเครื่องออกกำลังกาย ภายในเขตเทศบาลนครรังสิต', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(195, '3/2/2564', 'CNTR-592/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '19,784.00', 'จ้างซ่อมรถ ๓ คันทะเบียน บ-๓๘๓๐, ตค-๖๕ และ ตค-๑๔๕', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(196, '3/2/2564', 'CNTR-593/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '6,530.00', 'จ้างซ่อมรถยนต์ ๒ คันทะเบียน ตค-๒ (๐๑๙ ๔๐ ๐๐๐๓) และทะเบียน ตค-๑๒๗ (๐๑๘ ๔๖ ๐๐๕) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(197, '3/2/2564', 'CNTR-594/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '18,846.00', ' จ้างซ่อมรถแมคโคร ทะเบียน ต-๐๓๔๕ (เลขครุภัณฑ์ ๐๑๙ ๓๗ ๐๐๐๑)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(198, '3/2/2564', 'CNTR-595/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '6,802.00', 'จ้างซ่อมแซมรถแบคโฮ ทะเบียน ตค-๖๕ (เลขครุภัณฑ์ ๐๑๘ ๔๒ ๐๐๐๔)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(199, '3/2/2564', 'CNTR-597/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '7,100.00', ' จ้างซ่อมรถบรรทุก ๑๐ ล้อ ทะเบียน ๘๑-๖๘๒๓ (เลขครุภัณฑ์ ๐๑๓ ๔๔ ๐๐๐๘) ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(200, '4/2/2564', 'CNTR-607/64', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '16,830.00', 'จ้างเหมาโครงการปรับปรุงประตูระบายน้ำ บริเวณหน้าหมู่บ้านชวนชื่น ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(201, '4/2/2564', 'CNTR-608/64', 'บริษัท พรวิเศษ วิศว์ จำกัด', 'เงินสด ', '17,500.00', 'จ้างออกแบบออกแบบปรับปรุงสะพานคอนกรีตเสริมเหล็ก ข้ามคลองรังสิตประยูรศักดิ์ (บริเวณทางเข้าหมู่บ้านชมฟ้า-วรางกูล) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(202, '5/2/2564', 'CNTR-610/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,900.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก บริเวณซอยรังสิต-นครนายก 33 ซอย 1', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(203, '5/2/2564', 'CNTR-611/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '8,152.00', 'จ้างซ่อมรถแมคโคร ทะเบียน ตค-๕๐ เลขครุภัณฑ์ ๐๑๘ ๔๑ ๐๐๐๓ ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(204, '8/2/2564', 'CNTR-617/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '6,140.00', 'จ้างซ่อมรถดูดสิ่งปฏิกูล ทะเบียน 82-0775 ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(205, '8/2/2564', 'CNTR-618/64', 'ห้างหุ้นส่วนจำกัด สหผลวัฒนาโยธาการ', 'หนังสือค้ำประกันเลขที่ ค.47690321401000 / 2 ปี ', '24,750.00', 'จ้างเหมาโครงการปรับปรุงผิวจราจรบริเวณถนนซอยรังสิต-นครนายก 2 (ช่วงตั้งแต่ปากซอยถึงท้ายซอยข้างวัดคลองหนึ่ง)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(206, '8/2/2564', 'CNTR-621/64', 'ห้างหุ้นส่วนจำกัด สหผลวัฒนาโยธาการ', 'หนังสือค้ำประกันเลขที่ ค.47690321399000 / 2 ปี ', '17,650.00', 'จ้างเหมาโครงการปรับปรุงระบบจราจรบริเวณถนนซอยรังสิต-นครนายก 56 (ซอยวัดจันทรสุข) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(207, '8/2/2564', 'CNTR-623/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '10,620.00', ' จ้างซ่อมรถยนต์ จำนวน ๒ คัน ทะเบียน ตค-๑๓๔ และทะเบียน ๘๑-๗๒๘๑ ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(208, '10/2/2564', 'CNTR-638/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '10,484.00', 'จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์๘ (๐๒๘ ๕๑ ๐๐๑๒)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(209, '10/2/2564', 'CNTR-639/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '18,434.00', 'จ้างซ่อมแซมตู้บรรทุกขยะเบอร์ ๑๓ (๐๒๘ ๕๔ ๐๐๑๗)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง');
INSERT INTO `tbl_treasury` (`id`, `regis_date`, `contract_no`, `contractor`, `garanty_type`, `cost_budget`, `project_name`, `status`, `garanty_end`, `owner`) VALUES
(210, '11/2/2564', 'CNTR-641/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '23,800.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 67 ช่วงที่ 1', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(211, '11/2/2564', 'CNTR-645/64', 'บริษัท ดับบลิวอีสิบเก้าเอ็นจิเนียริ่ง จำกัด', 'หนังสือค้ำประกันเลขที่ 100036671666 / 2 ปี ', '87,850.00', 'จ้างก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ คสล.ซอยรังสิต-ปทุมธานี 11 (ต่อจากโครงการเดิม) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(212, '15/2/2564', 'CNTR-649/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '8,500.00', 'จ้างซ่อมรถขยะคอนเทนเนอร์ ๖ ล้อ ทะเบียน บ-๓๘๓๐', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(213, '16/2/2564', 'CNTR-659/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '23,900.00', ' จ้างเหมาโครงการปรับปรุงฝาบ่อ ซอยรังสิต-นครนายก 4 ช่วงที่ 2 กลางซอย ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(214, '16/2/2564', 'CNTR-661/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '7,500.00', 'จ้างซ่อมแซมรถดูดโคลนเลน ทะเบียน ๘๓-๑๓๐๖ (เลขครุภัณฑ์ ๐๓๕ ๐๙ ๐๐๐๓)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(215, '16/2/2564', 'CNTR-662/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '12,500.00', 'จ้างซ่อมรถขยะคอนเทนเนอร์ ๖ ล้อ ทะเบียน บง-๖๕๓๘', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(216, '16/2/2564', 'CNTR-663/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '13,598.00', 'จ้างซ่อมรถขุดตักหน้าขุดหลัง ทะเบียน ต-๐๓๔๖ (เลขครุภัณฑ์ ๐๑๘ ๓๗ ๐๐๐๒) ', 'ยังไม่คืน', '26/3/2565', 'สำนักการช่าง'),
(217, '17/2/2564', 'CNTR-670/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '12,075.00', 'จ้างซ่อมรถกวาดดูดฝุ่น ทะเบียน 82-2974 ', 'ยังไม่คืน', '20/4/2565', 'สำนักการช่าง'),
(218, '17/2/2564', 'CNTR-673/64', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '3,328.00', 'ซื้อครุภัณฑ์การเกษตร (มอเตอร์ไฟฟ้า) จำนวน ๒ ตัว', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(219, '18/2/2564', 'CNTR-680/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '24,950.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 33 ซอย 3 (ใน)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(220, '19/2/2564', 'CNTR-692/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '12,600.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่างทางสาธารณะ บริเวณสะพานข้างโรงงานกรีนสปอร์ต', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(221, '19/2/2564', 'CNTR-693/64', 'ห้างหุ้นส่วนจำกัด แอคคิวเรท พลัส', 'เงินสด  / 1 ปี ', '290', 'ซื้อครุภัณฑ์ (เครื่องวัดอุณหภูมิร่างกายแบบไม่สัมผัสระบบอินฟาเรดพร้อมขาตั้ง) ตามโครงการป้องกันการแพร่ระบาดเชื้อไวรัสโคโรน่า2019 จำนวน 2 เครื่อง', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(222, '19/2/2564', 'CNTR-696/64', 'ห้างหุ้นส่วนจำกัดมาอิ่มรวย2555', 'เงินสด  / 1 ปี ', '9,650.00', 'ซื้อครุภัณฑ์สำนักงาน (พัดลมตั้งพื้น ขนาด 26 นิ้ว และ พัดลมไอน้ำ ขนาด 24 นิ้ว)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(223, '22/2/2564', 'CNTR-699/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '23,450.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-ปทุมธานี ๙', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(224, '23/2/2564', 'CNTR-701/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '5,431.00', 'จ้างซ่อมแซมรถตักล้อยาง ทะเบียน ต-๐๓๐๓ (เลขครุภัณฑ์ ๐๑๘ ๓๔ ๐๐๐๑)', 'ยังไม่คืน', '9/3/2565', 'สำนักการช่าง'),
(225, '23/2/2564', 'CNTR-702/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '13,252.00', 'จ้างซ่อมรถขยะคอนเทนเนอร์ ๖ ล้อ ทะเบียน บง-๖๕๓๙', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(226, '23/2/2564', 'CNTR-703/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '8,280.00', 'จ้างซ่อมรถแมคโคร ทะเบียน ต-๐๓๔๘ (หมายเลขครุภัณฑ์ ๐๑๙ ๓๗ ๐๐๐๒) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(227, '23/2/2564', 'CNTR-704/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '15,800.00', 'จ้างซ่อมรถบรรทุกซานต่ำ ทะเบียน ๘๒-๓๒๕๕ เลขครุภัณฑ์ ๐๐๒ ๕๐ ๐๐๐๘', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(228, '24/2/2564', 'CNTR-711/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '5,040.00', 'จ้างซ่อมรถบรรทุกขยะอัดท้าย ทะเบียน 82-4563 ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(229, '24/2/2564', 'CNTR-714/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '6,600.00', 'จ้างซ่อมรถบรรทุกขยะอัดท้าย ทะเบียน 82-2961', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(230, '1/3/2564', 'CNTR-724/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '15,000.00', 'จ้างซ่อมรถบรรทุก ๑๐ ล้อ ทะเบียน ๘๑-๖๘๒๑ (ครุภัณฑ์ ๐๑๓ ๔๔ ๐๐๐๙)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(231, '2/3/2564', 'CNTR-735/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '5,350.00', 'จ้างซ่อมรถแบคโฮ ทะเบียน ตค-๒๑๗ (เลขครุภัณฑ์ ๐๑๘ ๕๑ ๐๐๐๘) ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(232, '2/3/2564', 'CNTR-736/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '11,010.00', 'จ้างซ่อมรถบรรทุก ๑๐ ล้อ ทะเบียน ๘๑-๕๔๐๕ (๐๑๓ ๔๒ ๐๐๐๑) ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(233, '2/3/2564', 'CNTR-737/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '8,070.00', 'จ้างซ่อมรถบรรทุก ๑๐ ล้อทะเบียน ๘๑-๕๔๐๖ (เลขครุภัณฑ์ ๐๑๓ ๔๒ ๐๐๐๒)', 'ยังไม่คืน', '11/3/2565', 'สำนักการช่าง'),
(234, '2/3/2564', 'CNTR-738/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '18,350.00', 'จ้างซ่อมรถ ๒ คันทะเบียน บง-๖๕๓๙ และทะเบียน บ-๓๘๓๐', 'ยังไม่คืน', '30/3/2565', 'สำนักการช่าง'),
(235, '3/3/2564', 'CNTR-743/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '5,650.00', 'จ้างซ่อมรถบรรทุก ๑๐ ล้อ ทะเบียน น-๔๓๔๐', 'ยังไม่คืน', '30/3/2565', 'สำนักการช่าง'),
(236, '4/3/2564', 'CNTR-745/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '24,300.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่างทางสาธารณะ บริเวณซอยรังสิต-นครนายก 67 ช่วงท้ายซอย ', 'ยังไม่คืน', '11/3/2565', 'สำนักการช่าง'),
(237, '4/3/2564', 'CNTR-746/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '9,300.00', ' จ้างซ่อมรถแมคโคร ทะเบยน ตค-๑๒๗ เลขครุภัณฑ์ ๐๑๘ ๔๖ ๐๐๐๕ ', 'ยังไม่คืน', '12/3/2565', 'สำนักการช่าง'),
(238, '4/3/2564', 'CNTR-747/64', 'ห้างหุ้นส่วนจำกัด นวภูมิ การโยธา', 'หนังสือค้ำประกันเลขที่ 02073211000042 / 2 ปี ', '417,500.00', 'จ้างก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ คสล.ซอยรังสิต-นครนายก 56 (ช่วงที่ 1) ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(239, '4/3/2564', 'CNTR-750/64', 'ห้างหุ้นส่วนจำกัด นวภูมิ การโยธา', 'หนังสือค้ำประกันเลขที่ 02073211000041 / 2 ปี ', '212,000.00', 'จ้างก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ ซอยรังสิต-นครนายก 27 ซอย 4 (สหกรณ์รัตนปทุม)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(240, '5/3/2564', 'CNTR-754/64', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '2,600.00', 'ซื้อครุภัณฑ์ไฟฟ้าและวิทยุ (เครื่องกำเนิดไฟฟ้า) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(241, '5/3/2564', 'CNTR-756/64', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '2,375.00', 'ซื้อครุภัณฑ์งานบ้านงานครัว (จัดซื้อเครื่องตัดหญ้าจำนวน 5 เครื่อง) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(242, '5/3/2564', 'CNTR-757/64', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '2,885.00', ' ซื้อครุภัณฑ์งานบ้านงานครัว(เครื่องตัดแต่งพุ่มไม้ ขนาด ๒๒ นิ้ว ๑ เครื่องและเครื่องตัดหญ้าแบบข้อแข็ง ๕ เครื่อง)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(243, '8/3/2564', 'CNTR-763/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '20,486.00', 'จ้างซ่อมรถ ๒ คันทะเบียน บง-๒๓๑๒ และทะเบียน ต-๐๓๔๘', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(244, '9/3/2564', 'CNTR-769/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '6,880.00', 'จ้างซ่อมรถบรรทุกขยะอัดท้าย ทะเบียน 82-4722', 'ยังไม่คืน', '24/4/2564', 'สำนักการช่าง'),
(245, '9/3/2564', 'CNTR-771/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '15,000.00', 'จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์ ๑๖ (๐๒๘ ๕๔ ๐๐๒๐)', 'ยังไม่คืน', '31/3/2565', 'สำนักการช่าง'),
(246, '15/3/2564', 'CNTR-793/64', 'บริษัท ท็อปเบสท์ มอเตอร์ เซลส์ จำกัด', 'หนังสือค้ำประกันเลขที่ ค.47690324220000 / 1 ปี ', '93,500.00', 'ซื้อครุภัณฑ์ยานพาหนะและขนส่ง (รถบรรทุกมูลฝอยแบบอัดท้าย (ดีเซล) ขนาด ๖ ตัน ๖ ล้อ)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(247, '16/3/2564', 'CNTR-798/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '14,800.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่างทางสาธารณะ บริเวณสะพานหน้าซอยรังสิต-นครนายก 46 ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(248, '16/3/2564', 'CNTR-800/64', 'ห้างหุ้นส่วนจำกัด เดชปภัช คอนสตรัคชั่น', 'เช็คเลขที่ 16512241 / 2 ปี ', '186,000.00', 'จ้างก่อสร้างถนน คสล.ซอยรังสิต-ปทุมธานี 15 (ซอยแสงรัตน์) ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(249, '22/3/2564', 'CNTR-818/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '15,400.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่างบริเวณฟุตบาทริมคลองรังสิตประยูรศักดิ์และบริเวณป้ายรถประจำทางสะพานฟ้า ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(250, '25/3/2564', 'CNTR-848/64', 'บริษัท เอ็นจินีโอ จำกัด', 'เงินสด  / 2 ปี ', '24,800.00', 'จ้างเหมาโครงการปรับปรุงระบบไฟฟ้าสปริงเกอร์รดน้ำต้นไม้โดยใช้พลังงานทดแทน บริเวณสวนเกาะกลางถนนเลียบคลองรังสิตประยูรศักดิ์ ช่วงระหว่างสะพานแก้วถึงโรงเรียนชุมชนประชาธิปัตย์ (ช่วง 1)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(251, '30/3/2564', 'CNTR-862/64', 'บริษัท วิรุฬห์ แอนด์ เกวนเนส จำกัด', 'หนังสือค้ำประกันเลขที่ 100038159954 / 2 ปี ', '125,000.00', 'จ้างติดตั้งเครื่องสูบน้ำสถานีสูบน้ำ เมน 1 หมู่บ้านรัตนโกสินทร์ 200 ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(252, '31/3/2564', 'CNTR-799/64', 'บริษัท วิรุฬห์ แอนด์ เกวนเนส จำกัด', 'หนังสือค้ำประกันเลขที่ 100037651685 / 2 ปี ', '99,000.00', 'จ้างก่อสร้างบ่อระบบสูบน้ำโรงเรียนนครรังสิต เทพธัญญะอุปถัมภ์ พร้อมระบบสูบน้ำอัตโนมัติ ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(253, '7/4/2564', 'CNTR-895/64', 'บริษัท จุไลยะจักร คอนโซลิเดต จำกัด', 'หนังสือค้ำประกันเลขที่ 100038363306 / 2 ปี ', '181,900.00', 'จ้างก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ HDPE ซอยพหลโยธิน 87 ซอย 10 แยก 6', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(254, '7/4/2564', 'CNTR-0896/64', 'บริษัท วันชัย 1992 จำกัด', 'หนังสือค้ำประกันเลขที่ 00019/201036/0001/64 / 2 ปี ', '305,000.00', 'จ้างก่อสร้างถนนคอนกรีตเสริมเหล็ก รหัสทางหลวงท้องถิ่น ปท ถ.6-0047 สายซอยรังสิต - นครนายก 12 (ด้านท้ายซอย)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(255, '26/4/2564', 'CNTR-926/64', 'บริษัท ไฮไลท์ อิเล็กทรอนิกส์ จำกัด', 'หนังสือค้ำประกันเลขที่ 100038727243 / 2 ปี ', '48,300.00', 'จ้างก่อสร้างติดตั้งไฟฟ้าส่องสว่างทางสาธารณะ ถนนซอยรังสิต-นครนายก 29 ซอย 1', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(256, '27/4/2564', 'CNTR-934/64', 'บริษัท พรประเสริฐ การโยธา จำกัด', 'หนังสือค้ำประกันเลขที่ 02237211000224 / 2 ปี ', '102,800.00', 'จ้างก่อสร้างก่อสร้างถนน คสล.ซอยพหลโยธิน 87 แยก 6 (ทางเข้าโรงเรียนสายปัญญา)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(257, '25/5/2564', 'CNTR-0978/64', 'บริษัท วันชัย 1992 จำกัด', 'หนังสือค้ำประกันเลขที่ 00019/201036/0002/64 / 2 ปี ', '350,000.00', 'จ้างก่อสร้างถนนคอนกรีตเสริมเหล็ก รหัสทางหลวงท้องถิ่น ปท.ถ.6-0038 สายซอยรังสิต- นครนายก 57 (ด้านท้ายซอย) ชุมชนเจ้าจอม', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(258, '27/5/2564', 'CNTR-981/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '19,905.00', 'จ้างซ่อมรถแบคโฮ ทะเบียน ตค-๒๑๗ (๐๑๘ ๕๑ ๐๐๐๘)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(259, '27/5/2564', 'CNTR-982/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '12,343.00', 'จ้างซ่อมรถดูดโคลนเลน ทะเบียน บง-๒๔๗ (๐๓๕ ๔๐ ๐๐๐๑)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(260, '27/5/2564', 'CNTR-984/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '14,617.00', 'จ้างซ่อมรถบรรทุก ๑๐ ล้อ ทะเบียน ๘๑-๖๘๒๓ (๐๑๓ ๔๔ ๐๐๐๘)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(261, '27/5/2564', 'CNTR-985/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '8,674.00', 'จ้างซ่อมรถตักล้อยาง ทะเบียน ต-๐๓๐๓ (๐๑๘ ๓๔ ๐๐๐๑)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(262, '28/5/2564', 'CNTR-994/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '6,273.00', 'จ้างซ่อมตู้บรรทุกขยะ เบอร์ ๒๓ (๐๒๘ ๖๑ ๐๐๑๙) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(263, '28/5/2564', 'CNTR-995/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '11,140.00', 'จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์ ๑ (๐๒๘ ๕๑ ๐๐๐๕) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(264, '28/5/2564', 'CNTR-996/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '14,578.00', 'จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์ ๓ (๐๒๘ ๕๑ ๐๐๐๗) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(265, '28/5/2564', 'CNTR-997/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '20,330.00', 'จ้างซ่อมแซมเครื่องอัดขยะมูลฝอยเครื่องที่ ๒ (๓๒๙ ๕๔ ๐๐๐๒)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(266, '31/5/2564', 'CNTR-1010/64', 'บริษัท พี ซี คอนกรีตปทุมธานี จำกัด', 'หนังสือค้ำประกันเลขที่ ค.47690330893000 / 2 ปี ', '24,250.00', 'จ้างเหมาโครงการปรับปรุงระบบจราจร บริเวณซอยรังสิต-นครนายก 67', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(267, '31/5/2564', 'CNTR-1013/64', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '9,359.00', 'ซื้อครุภัณฑ์สำนักงาน (โต๊ะพับเอนกประสงค์ จำนวน 50 ตัว)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(268, '23/6/2564', 'CNTR-1045/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '6,273.00', 'ค่าบำรุงรักษาและซ่อมแซม', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(269, '23/6/2564', 'CNTR-1046/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '20,330.00', 'ค่าบำรุงรักษาและซ่อมแซม', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(270, '23/6/2564', 'CNTR-1047/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '11,140.00', 'ค่าบำรุงรักษาและซ่อมแซม', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(271, '23/6/2564', 'CNTR-1048/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '14,578.00', 'ค่าบำรุงรักษาและซ่อมแซม', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(272, '24/6/2564', 'CNTR-1030/64', 'บริษัท ไฮไลท์ อิเล็กทรอนิกส์ จำกัด', 'หนังสือค้ำประกันเลขที่ 1000400598518 / 2 ปี ', '79,000.00', 'จ้างเหมาโครงการปรับปรุงสะพานคลองหนึ่ง', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(273, '24/6/2564', 'CNTR-1049/64', 'บริษัท พรประเสริฐ การโยธา จำกัด', 'หนังสือค้ำประกันเลขที่ 02237211000329 / 2 ปี ', '164,000.00', 'จ้าเหมาโครงการก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิต-นครนายก 57 (ช่วงที่ 2)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_unit`
--

CREATE TABLE `tbl_unit` (
  `unit_id` int(11) NOT NULL,
  `unit_code` varchar(4) NOT NULL,
  `unit_name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tbl_unit`
--

INSERT INTO `tbl_unit` (`unit_id`, `unit_code`, `unit_name`) VALUES
(1, 'u001', 'ชิ้น'),
(2, 'u002', 'อัน'),
(3, 'u003', 'รีม'),
(4, 'u004', 'กล่อง'),
(5, 'u005', 'ถุง'),
(6, 'u006', 'set');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_user`
--

CREATE TABLE `tbl_user` (
  `user_id` int(11) NOT NULL,
  `username` varchar(200) NOT NULL COMMENT 'รหัสผู้ใช้',
  `user_pass` varchar(200) NOT NULL COMMENT 'รหัสผ่าน hash',
  `user_prefix` varchar(20) NOT NULL COMMENT 'คำนำหน้าชื่อ',
  `user_fname` varchar(200) NOT NULL COMMENT 'ชื่อ',
  `user_lname` varchar(200) NOT NULL COMMENT 'สกุล',
  `user_tel` varchar(20) NOT NULL,
  `user_email` varchar(100) NOT NULL COMMENT 'email',
  `user_division_id` int(11) NOT NULL COMMENT 'รหัสสำนัก/กอง',
  `user_subdivision_id` int(11) NOT NULL COMMENT 'รหัสฝ่าย',
  `user_section_id` int(11) NOT NULL COMMENT 'รหัสแผนก',
  `user_position` varchar(100) NOT NULL COMMENT 'ตำแหน่ง',
  `user_status` enum('N','Y') NOT NULL,
  `user_stat` enum('ADMIN','STAFF','BOSS','EWPLOYES','GENERAL') NOT NULL,
  `profile_img` varchar(255) NOT NULL DEFAULT 'avatar_2x.png',
  `creation_date` date NOT NULL COMMENT 'วันที่สร้าง',
  `update_date` date NOT NULL COMMENT 'วันที่อัพเดต',
  `creation_by` int(10) NOT NULL COMMENT 'รหัสสผู้ใช้งานที่ทำการสร้าง',
  `update_by` int(10) NOT NULL COMMENT 'รหัสสผู้ใช้งานที่ทำการแก้ไข'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tbl_user`
--

INSERT INTO `tbl_user` (`user_id`, `username`, `user_pass`, `user_prefix`, `user_fname`, `user_lname`, `user_tel`, `user_email`, `user_division_id`, `user_subdivision_id`, `user_section_id`, `user_position`, `user_status`, `user_stat`, `profile_img`, `creation_date`, `update_date`, `creation_by`, `update_by`) VALUES
(71, 'maxmumi99', '7c4a8d09ca3762af61e59520943dc26494f8941b', 'นาย', 'ปฐวีกานต์', 'ศรีคราม', '0981051534', 'maxmumi99@gmail..com', 1, 4, 1, 'นักวิชาการคอมพิวเตอร์ปฏิบัติการ', 'Y', 'ADMIN', 'user_5fb6a43bac4f8.png', '2020-11-14', '2020-12-06', 71, 71),
(76, 'publich_p', '$2y$10$y8cWV7wYgovJL4ag.7farOv58hucbujfndAdERlSqXi61BEGkkUfi', 'นาง', 'พิมพร', 'เทียนถาวร', ' 0898167254', 'publich_p@rangsit.com', 1, 3, 8, 'พยาบาลวิชาชีพชำนาญการ', 'Y', 'STAFF', 'user_5fa7ffe2a8a15.png', '2020-11-22', '2020-12-09', 71, 71),
(133, '0867756863', '$2y$10$WxDx2cArCmWBm.qhGdNCrOFeJgBUwDREMYetFQiyepWNu9D1PfKBm', 'นาง', 'ฉลวย', 'พินดิษฐ์', '0867756863', '', 1, 4, 1, 'ผู้ช่วยนักจัดการงานทั่วไป', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-02', '2020-12-02', 71, 71),
(134, 's01', '$2y$10$SqaXt8.x0300d.IXiklVteFxzKQzRQYn3/P.g8kLDhyxSdaIkceAC', 'นาง', 'ทัศนีย์', 'เจริญอัศวสุข', '0850460870', '', 0, 3, 10, 'พยาบาลวิชาชีพชำนาญการ', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-09', '2020-12-09', 71, 71),
(135, 's03', '$2y$10$.At1OhLawIjgvQ5iozDfn.tgSIOto37mxBwDcpQZmHFoXkrRbbm0.', 'นาง', 'วรรณ์มนธัญ', 'ปลื้มชัย', '0890681992', '', 0, 3, 10, 'พยาบาลวิชาชีพชำนาญการ', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-09', '2020-12-09', 71, 71),
(136, 's04', '$2y$10$FkuIt0fYbHW2yjWHLpxl6OXe5GJcZNd1FhDCPhL7clHOua4XNytZK', 'นาง', 'พิมประภา', 'พลเธียร', '0831889907', '', 1, 3, 10, 'พยาบาลวิชาชีพชำนาญการ', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-09', '0000-00-00', 71, 0),
(137, 's02', '$2y$10$9xe7ovO9EFCuUfXl8zxdJOWcsA30cXjBlXG6LxRpcUmc/SIGdclFq', 'นางสาว', 'ศุฐินันท์', 'เลื้อนแป้น', '0860896911', '', 0, 3, 10, 'พยาบาลวิชาชีพบชำนาญการ', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-09', '2020-12-09', 71, 71),
(138, 's05', '$2y$10$IyRtOOy4mP5sTezNN5IvR.gi6Tn4p4l7pcXTfX6lg25MnC4r0YDaS', 'นางสาว', 'จริญา', 'พัดทอง', '0830325314', '', 0, 3, 10, 'พยาบลวิชาชีพชำนาญการ', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-09', '2020-12-09', 71, 71),
(139, 'at2c', '$2y$10$Fu68ljhU.8kUG6RRbH.d0O2sK3W.FXh1jgRP2kewWvyR9gqW31Nxm', 'นาย', 'ภัทรพล', 'ภูคุ้มจันอัด', '0948629159', '', 0, 3, 10, 'นักกายภาพบำบัดปฏิบัติการ', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-09', '2020-12-09', 71, 71),
(140, 'pah01', '$2y$10$DE8xOTNkhjOQvoCttIYowenGwbx1IbMbYAmxqA0jv6h1TLI1aTILC', 'นางสาว', 'ชุลีวรรณ', 'มาดเจือ', '0981051534', 'Chuleewan@gmail.com', 0, 1, 2, 'ผู้ช่วยเจ้าพนักงานธุรการ', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-09', '2020-12-09', 71, 71),
(141, 'pha2', '$2y$10$vSunX.7IUkgXYFHVVirdIuSkywxIVPkilFhzjrbzMjOTR32ek4Qla', 'นาย', 'ศักดา', 'เหมาะหมาย', '0981051534', 'Sakda12345555@gmail.com', 0, 2, 7, 'ผู้ช่วยเจ้าพนักงานงานธุรการ', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-09', '2020-12-09', 71, 71);

-- --------------------------------------------------------

--
-- Table structure for table `tbl_withdraw`
--

CREATE TABLE `tbl_withdraw` (
  `id` int(11) NOT NULL,
  `withdraw_id` varchar(20) NOT NULL,
  `user` varchar(100) NOT NULL,
  `time` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tbl_withdraw`
--

INSERT INTO `tbl_withdraw` (`id`, `withdraw_id`, `user`, `time`) VALUES
(1, 'w2023-11-30_0851am', 'ทนงค์ บุญเติม', '2023-11-30 07:51:48'),
(2, 'w2023-11-30_0907am', 'ทนงค์ บุญเติม', '2023-11-30 08:07:25'),
(3, 'w2023-11-30_0908am', 'ทนงค์ บุญเติม', '2023-11-30 08:08:09'),
(4, 'w2023-11-30_0933am', 'ทนงค์ บุญเติม', '2023-11-30 08:33:47'),
(5, 'w2023-11-30_0945am', 'ทนงค์ บุญเติม', '2023-11-30 08:45:51'),
(6, 'w2023-11-30_0956am', 'ทนงค์ บุญเติม', '2023-11-30 08:56:47');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_withdraw_log`
--

CREATE TABLE `tbl_withdraw_log` (
  `id` int(11) NOT NULL,
  `withdraw_id` varchar(20) NOT NULL,
  `withdraw_mat` varchar(10) NOT NULL,
  `withdraw_qty` int(11) NOT NULL,
  `withdraw_time` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `status` varchar(1) NOT NULL,
  `user` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tbl_withdraw_log`
--

INSERT INTO `tbl_withdraw_log` (`id`, `withdraw_id`, `withdraw_mat`, `withdraw_qty`, `withdraw_time`, `status`, `user`) VALUES
(1, 'w2023-11-30_0851am', 'c01', 1, '2023-11-30 07:52:16', '3', 'ทนงค์ บุญเติม'),
(2, 'w2023-11-30_0851am', 'c02', 1, '2023-11-30 07:52:21', '2', 'ทนงค์ บุญเติม'),
(3, 'w2023-11-30_0851am', 'c03', 1, '2023-11-30 08:32:47', '3', 'ทนงค์ บุญเติม'),
(4, 'w2023-11-30_0907am', 'c01', 1, '2023-11-30 08:32:58', '3', 'ทนงค์ บุญเติม'),
(5, 'w2023-11-30_0907am', 'c03', 1, '2023-11-30 08:42:14', '3', 'ทนงค์ บุญเติม'),
(6, 'w2023-11-30_0908am', 'c01', 1, '2023-11-30 08:34:06', '3', 'ทนงค์ บุญเติม'),
(7, 'w2023-11-30_0908am', 'c02', 1, '2023-11-30 08:42:21', '3', 'ทนงค์ บุญเติม'),
(8, 'w2023-11-30_0908am', 'c03', 1, '2023-11-30 08:44:15', '3', 'ทนงค์ บุญเติม'),
(9, 'w2023-11-30_0933am', 'c01', 1, '2023-11-30 08:45:23', '3', 'ทนงค์ บุญเติม'),
(10, 'w2023-11-30_0945am', 'c01', 1, '2023-11-30 08:46:04', '3', 'ทนงค์ บุญเติม'),
(11, 'w2023-11-30_0945am', 'c02', 1, '2023-11-30 08:46:39', '3', 'ทนงค์ บุญเติม'),
(12, 'w2023-11-30_0956am', 'c01', 1, '2023-11-30 08:57:45', '3', 'ทนงค์ บุญเติม'),
(13, 'w2023-11-30_0956am', 'c02', 1, '2023-11-30 08:56:47', '1', 'ทนงค์ บุญเติม'),
(14, 'w2023-11-30_0956am', 'c03', 1, '2023-11-30 08:56:47', '1', 'ทนงค์ บุญเติม');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_work`
--

CREATE TABLE `tbl_work` (
  `work_id` int(11) NOT NULL,
  `work_code` varchar(10) NOT NULL,
  `work_name` varchar(100) NOT NULL,
  `division_ref` varchar(10) NOT NULL,
  `part_ref` varchar(11) NOT NULL,
  `subdivision_ref` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci COMMENT='งานย่อยในแต่ละฝ่าย';

--
-- Dumping data for table `tbl_work`
--

INSERT INTO `tbl_work` (`work_id`, `work_code`, `work_name`, `division_ref`, `part_ref`, `subdivision_ref`) VALUES
(1, '0111', 'งานธุการ', '0100', '0110', '0111'),
(2, '0112', 'งานธุรการสภา', '0100', '0110', '0111');

-- --------------------------------------------------------

--
-- Table structure for table `tb_complain`
--

CREATE TABLE `tb_complain` (
  `id` int(11) NOT NULL,
  `req_date` date NOT NULL,
  `topic` varchar(255) NOT NULL,
  `complainant` varchar(255) NOT NULL,
  `complainant_type` varchar(100) NOT NULL,
  `address` varchar(255) NOT NULL,
  `tel` varchar(10) NOT NULL,
  `email` varchar(255) NOT NULL,
  `detail` varchar(255) NOT NULL,
  `receive_id` varchar(10) NOT NULL,
  `receive_date` datetime NOT NULL,
  `department` varchar(255) NOT NULL,
  `work_result` varchar(255) NOT NULL,
  `responsible_person` varchar(100) NOT NULL,
  `file_name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tb_complain`
--

INSERT INTO `tb_complain` (`id`, `req_date`, `topic`, `complainant`, `complainant_type`, `address`, `tel`, `email`, `detail`, `receive_id`, `receive_date`, `department`, `work_result`, `responsible_person`, `file_name`) VALUES
(8, '2564-12-08', 'ท่อระบายน้ำอุดตัน และน้ำเจิ่งนอง', 'test', 'นิติบุคคล', '25/222', '099', 'th@gg.com', 'mmm', 'rfeg', '2564-12-29 00:00:00', 'sdgrs', 'sefgs', 'sdeges', 'แบบโรงงานขยะ-Model.pdf'),
(9, '2564-12-29', 'พรบ คอม', 'noo', 'นิติบุคคล', 'ืืnbb', '000', 'sdgvsvg', 'sds', 'sd', '2564-12-29 00:00:00', 'sdvfsdv', 'sdfvds', 'sdfvdsv', 'พรบ_คอม.PDF'),
(10, '2564-12-29', 'asefwaw', 'asfawfewa', 'นิติบุคคล', 'sfewawe', 'sfaw', 'sfs', 'sfas', 'sfsae', '2564-12-23 00:00:00', 'sefra', 'asfas', 'sfaerf', 'สปร.5.pdf'),
(11, '2564-12-23', 'zsfvzsv', 'scSAD', 'บุคคลธรรมดา', 'sZcf', 'zscvzs', 'zsdcvzs', 'zscvzscv', 'sZcvS', '2564-11-30 00:00:00', 'sVszv', 'zsvzsvd', 'zsvaz', 'AdminLTE 3  DataTables.pdf'),
(12, '2564-12-08', 'ไฟดับ', 'ฟำดฟไ', 'นิติบุคคล', 'ฟไดฟไ', 'ฟหดฟ', 'ฟไดฟ', 'หเอหกอิหก', 'กหเอกหอ', '2564-11-26 00:00:00', 'เดำหเอห', 'หดเกหพดเอห', 'ฟดฟหำพเ', 'ภาค ก ท้องถิ่น(กฎหมาย).pdf');

-- --------------------------------------------------------

--
-- Table structure for table `user_login`
--

CREATE TABLE `user_login` (
  `id` int(11) NOT NULL,
  `prefix` varchar(10) NOT NULL,
  `firstname` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `lastname` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `username` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `tel` varchar(10) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `user_level` varchar(1) NOT NULL,
  `position` varchar(255) NOT NULL,
  `division` varchar(100) NOT NULL,
  `part` varchar(100) NOT NULL,
  `subdivision` varchar(100) NOT NULL,
  `section` varchar(10) NOT NULL,
  `img` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `user_login`
--

INSERT INTO `user_login` (`id`, `prefix`, `firstname`, `lastname`, `username`, `password`, `email`, `tel`, `user_level`, `position`, `division`, `part`, `subdivision`, `section`, `img`) VALUES
(1, 'นาย', 'ทนงค์', 'บุญเติม', 'admin', 'engineer', 'thanongb42@gmail.com', '0910109174', 'a', 'Administrator', '', '', '', '', 'thanong.jpg'),
(2, 'นาย', 'นายอาทิตย์', 'พรหมฤทธิ์', 'arthit', 'athity5588', 'athity5588@gmail.com', '0849145558', 'a', 'รก.หน.ฝ่ายบริหารงานทั่วไป', '', '', '', '', 'athity.jpg'),
(3, 'นางสาว', 'สุกัญญา', 'รอดเมือง', 'aumaim', 'aumaim1234', 'aumaimaa18@gmail.com', '1234567891', 'b', 'เลขา หน้าห้อง ผอ. สำนักการช่าง', '', '', '', '', 'aumaim.jpg'),
(4, 'นาย', 'ปภพ', 'กุลฉันวิทย์', 'Papop', 'Papop1234', 'Papop@hotmail.com', '1234567891', 'b', 'ผู้ช่วยนายช่างโยธา', '', '', '', '', 'arm.jpg'),
(5, 'นาย', 'นายธนทรัพย์', 'ประสมทรัพย์', 'thanasup', '1234', 'thanasup1978@gmail.com\r\n', '1234567891', 'b', 'เจ้าพนักงานธุรการชำนาญงาน', '', '', '', '', 'thanasup.jpg'),
(9, 'นาย', 'tha', 'b', 'tha', '1234', 'thanongb42@gmail.com', '0813902531', 'b', 'Administrator', '', '', '', '', 'ื'),
(10, 'นาย', 'ไทp', 'ธนาp', 'THAI', '88888', 'surapong2530@ho.p', 'p', 'p', 'Administratorp', '', '', '', '', ''),
(11, 'นาย', 'thep', 'test', 'a', '1234', 'surapong2530@ho', 'ffff', 'b', 'Administrator', '', '', '', '', ''),
(12, 'นาง', 'สมปอง', 'นามธรรม', 'sompong', 'S0mp0ng', 'sompong@gmail.com', '0309867777', 'c', 'ธุรการ', '', '', '', '', '');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `activity_log`
--
ALTER TABLE `activity_log`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `admin_login`
--
ALTER TABLE `admin_login`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `doc_acceptance`
--
ALTER TABLE `doc_acceptance`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `doc_mgr_command`
--
ALTER TABLE `doc_mgr_command`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `doc_recheck`
--
ALTER TABLE `doc_recheck`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `doc_regulation`
--
ALTER TABLE `doc_regulation`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `engineering_staff`
--
ALTER TABLE `engineering_staff`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `event_log`
--
ALTER TABLE `event_log`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `internal_memo`
--
ALTER TABLE `internal_memo`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `official_in_doc`
--
ALTER TABLE `official_in_doc`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `official_in_story`
--
ALTER TABLE `official_in_story`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `official_out_doc`
--
ALTER TABLE `official_out_doc`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `project_complete`
--
ALTER TABLE `project_complete`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `purchase_process`
--
ALTER TABLE `purchase_process`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `rangsit_budget`
--
ALTER TABLE `rangsit_budget`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `rangsit_department`
--
ALTER TABLE `rangsit_department`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `service_contract`
--
ALTER TABLE `service_contract`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `service_contract_story`
--
ALTER TABLE `service_contract_story`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbl_asset`
--
ALTER TABLE `tbl_asset`
  ADD PRIMARY KEY (`asset_id`),
  ADD KEY `asset_gorup_id` (`asset_group_id`);

--
-- Indexes for table `tbl_asset_group`
--
ALTER TABLE `tbl_asset_group`
  ADD PRIMARY KEY (`asset_group_id`);

--
-- Indexes for table `tbl_asset_status`
--
ALTER TABLE `tbl_asset_status`
  ADD PRIMARY KEY (`asset_status_id`),
  ADD KEY `asset_id` (`asset_id`);

--
-- Indexes for table `tbl_contractor`
--
ALTER TABLE `tbl_contractor`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbl_division`
--
ALTER TABLE `tbl_division`
  ADD PRIMARY KEY (`division_id`);

--
-- Indexes for table `tbl_location`
--
ALTER TABLE `tbl_location`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbl_mat`
--
ALTER TABLE `tbl_mat`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbl_part`
--
ALTER TABLE `tbl_part`
  ADD PRIMARY KEY (`part_id`);

--
-- Indexes for table `tbl_positions`
--
ALTER TABLE `tbl_positions`
  ADD PRIMARY KEY (`position_id`);

--
-- Indexes for table `tbl_request`
--
ALTER TABLE `tbl_request`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbl_stock`
--
ALTER TABLE `tbl_stock`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbl_subdivision`
--
ALTER TABLE `tbl_subdivision`
  ADD PRIMARY KEY (`subdivision_id`);

--
-- Indexes for table `tbl_treasury`
--
ALTER TABLE `tbl_treasury`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbl_unit`
--
ALTER TABLE `tbl_unit`
  ADD PRIMARY KEY (`unit_id`);

--
-- Indexes for table `tbl_user`
--
ALTER TABLE `tbl_user`
  ADD PRIMARY KEY (`user_id`),
  ADD KEY `user_section_id` (`user_section_id`),
  ADD KEY `user_position_id` (`user_position`);

--
-- Indexes for table `tbl_withdraw`
--
ALTER TABLE `tbl_withdraw`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbl_withdraw_log`
--
ALTER TABLE `tbl_withdraw_log`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbl_work`
--
ALTER TABLE `tbl_work`
  ADD PRIMARY KEY (`work_id`);

--
-- Indexes for table `tb_complain`
--
ALTER TABLE `tb_complain`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user_login`
--
ALTER TABLE `user_login`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `activity_log`
--
ALTER TABLE `activity_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `admin_login`
--
ALTER TABLE `admin_login`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `doc_acceptance`
--
ALTER TABLE `doc_acceptance`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=137;

--
-- AUTO_INCREMENT for table `doc_mgr_command`
--
ALTER TABLE `doc_mgr_command`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `doc_recheck`
--
ALTER TABLE `doc_recheck`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=275;

--
-- AUTO_INCREMENT for table `doc_regulation`
--
ALTER TABLE `doc_regulation`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `event_log`
--
ALTER TABLE `event_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=215;

--
-- AUTO_INCREMENT for table `internal_memo`
--
ALTER TABLE `internal_memo`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `official_in_doc`
--
ALTER TABLE `official_in_doc`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `official_in_story`
--
ALTER TABLE `official_in_story`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `official_out_doc`
--
ALTER TABLE `official_out_doc`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `project_complete`
--
ALTER TABLE `project_complete`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=204;

--
-- AUTO_INCREMENT for table `purchase_process`
--
ALTER TABLE `purchase_process`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `rangsit_budget`
--
ALTER TABLE `rangsit_budget`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `rangsit_department`
--
ALTER TABLE `rangsit_department`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `service_contract`
--
ALTER TABLE `service_contract`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;

--
-- AUTO_INCREMENT for table `service_contract_story`
--
ALTER TABLE `service_contract_story`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- AUTO_INCREMENT for table `tbl_asset`
--
ALTER TABLE `tbl_asset`
  MODIFY `asset_id` int(10) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT for table `tbl_asset_group`
--
ALTER TABLE `tbl_asset_group`
  MODIFY `asset_group_id` int(10) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `tbl_asset_status`
--
ALTER TABLE `tbl_asset_status`
  MODIFY `asset_status_id` int(10) NOT NULL AUTO_INCREMENT COMMENT 'รหัส';

--
-- AUTO_INCREMENT for table `tbl_contractor`
--
ALTER TABLE `tbl_contractor`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=198;

--
-- AUTO_INCREMENT for table `tbl_division`
--
ALTER TABLE `tbl_division`
  MODIFY `division_id` int(3) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `tbl_location`
--
ALTER TABLE `tbl_location`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `tbl_mat`
--
ALTER TABLE `tbl_mat`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `tbl_part`
--
ALTER TABLE `tbl_part`
  MODIFY `part_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `tbl_positions`
--
ALTER TABLE `tbl_positions`
  MODIFY `position_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT for table `tbl_request`
--
ALTER TABLE `tbl_request`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `tbl_stock`
--
ALTER TABLE `tbl_stock`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `tbl_subdivision`
--
ALTER TABLE `tbl_subdivision`
  MODIFY `subdivision_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=33;

--
-- AUTO_INCREMENT for table `tbl_treasury`
--
ALTER TABLE `tbl_treasury`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=274;

--
-- AUTO_INCREMENT for table `tbl_unit`
--
ALTER TABLE `tbl_unit`
  MODIFY `unit_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `tbl_user`
--
ALTER TABLE `tbl_user`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=142;

--
-- AUTO_INCREMENT for table `tbl_withdraw`
--
ALTER TABLE `tbl_withdraw`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `tbl_withdraw_log`
--
ALTER TABLE `tbl_withdraw_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `tbl_work`
--
ALTER TABLE `tbl_work`
  MODIFY `work_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `tb_complain`
--
ALTER TABLE `tb_complain`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `user_login`
--
ALTER TABLE `user_login`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `tbl_asset_status`
--
ALTER TABLE `tbl_asset_status`
  ADD CONSTRAINT `tbl_asset_status_ibfk_1` FOREIGN KEY (`asset_id`) REFERENCES `tbl_asset` (`asset_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
