-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Dec 01, 2023 at 11:57 AM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.0.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `stock-admin`
--

-- --------------------------------------------------------

--
-- Table structure for table `activity_log`
--

CREATE TABLE `activity_log` (
  `id` int(11) NOT NULL,
  `log_time` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `log_msg` varchar(255) NOT NULL,
  `log_user` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `admin_login`
--

CREATE TABLE `admin_login` (
  `id` int(11) NOT NULL,
  `prefix` varchar(10) NOT NULL,
  `firstname` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `lastname` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `username` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `tel` varchar(10) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `user_level` varchar(1) NOT NULL,
  `position` varchar(255) NOT NULL,
  `division` varchar(100) NOT NULL,
  `part` varchar(100) NOT NULL,
  `subdivision` varchar(100) NOT NULL,
  `section` varchar(10) NOT NULL,
  `img` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `admin_login`
--

INSERT INTO `admin_login` (`id`, `prefix`, `firstname`, `lastname`, `username`, `password`, `email`, `tel`, `user_level`, `position`, `division`, `part`, `subdivision`, `section`, `img`) VALUES
(1, 'นาย', 'ทนงค์', 'บุญเติม', 'admin', 'engineer', 'thanongb42@gmail.com', '0910109174', 'a', 'Administrator', '', '', '', '', 'thanong.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `event_log`
--

CREATE TABLE `event_log` (
  `id` int(11) NOT NULL,
  `user_id` varchar(10) NOT NULL,
  `event` varchar(100) NOT NULL,
  `messege` text NOT NULL,
  `event_time` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `event_log`
--

INSERT INTO `event_log` (`id`, `user_id`, `event`, `messege`, `event_time`) VALUES
(1, 'ทนงค์', 'ADD', 'เรื่องร้องเรียน ร้องทุกข์  เรื่อง :[object Object]', '2021-12-29 08:56:06'),
(2, 'ทนงค์', 'ADD', 'เรื่องร้องเรียน ร้องทุกข์  เรื่อง :zsfvzsv', '2021-12-29 08:59:02'),
(3, 'ทนงค์', 'ADD', 'เรื่องร้องเรียน ร้องทุกข์  เรื่อง :ไฟดับ', '2021-12-29 09:02:53'),
(4, 'ทนงค์', 'ADD', 'เรื่องร้องเรียน ร้องทุกข์  เรื่อง :ftyjhrtfyj', '2021-12-29 09:04:56'),
(5, 'ทนงค์', 'DELETE', 'เรื่องร้องเรียน ร้องทุกข์  เรื่อง :ftyjhrtfyj', '2021-12-29 09:05:30'),
(6, 'ทนงค์', 'LOGOUT', '', '2021-12-29 09:07:07'),
(7, 'ทนงค์', 'LOGIN', '', '2021-12-29 09:07:33'),
(8, 'ทนงค์', 'เข้าmenuUserManager', '', '2021-12-29 09:07:56'),
(9, 'ทนงค์', 'เข้า-menu', 'DocAcceptList', '2021-12-29 09:09:35'),
(10, 'ทนงค์', 'เข้า-menu', 'InternalMemoList', '2021-12-29 09:09:38'),
(11, 'ทนงค์', 'เข้า-menu', 'ExpireList', '2021-12-29 09:09:43'),
(12, 'ทนงค์', 'ADD', 'เรื่องร้องเรียน ร้องทุกข์  เรื่อง :undefined', '2021-12-29 09:23:08'),
(13, 'ทนงค์', 'ADD', 'ระเบียบคำสั่ง  เรื่อง :ฟไดำฟไำด', '2021-12-29 09:24:27'),
(14, 'ทนงค์', 'DELETE ระเบียบคำสั่ง ฟไดำฟไำด', '', '2021-12-29 09:25:26'),
(15, 'ทนงค์', 'DELETE', 'ระเบียบคำสั่ง สปร 5', '2021-12-29 09:25:59'),
(16, 'ทนงค์', 'DELETE', 'หนังสือขาออก เรื่อง :TEST', '2021-12-29 09:31:34'),
(17, 'ทนงค์', 'DELETE', 'หนังสือขาเข้า เรื่อง :ระดับน้ำ', '2021-12-29 09:31:59'),
(18, 'ทนงค์', 'LOGOUT', '', '2021-12-29 09:34:20'),
(19, 'สุกัญญา', 'LOGIN', '', '2021-12-29 09:34:34'),
(20, 'สุกัญญา', 'LOGOUT', '', '2021-12-29 09:34:45'),
(21, 'ทนงค์', 'LOGIN', '', '2021-12-30 02:51:23'),
(22, 'ทนงค์', 'เข้า-menu', 'UserManager', '2021-12-30 02:51:43'),
(23, 'ทนงค์', 'เข้า-menu', 'DocumentOfficialOutList', '2021-12-30 02:57:24'),
(24, 'ทนงค์', 'Click-menu', 'DocumentOfficialOutList', '2021-12-30 02:58:28'),
(25, 'ทนงค์', 'Click-menu', 'DocumentOfficialInList', '2021-12-30 02:58:31'),
(26, 'ทนงค์ บุญเ', 'Click-menu', 'DocumentOfficialOutList', '2021-12-30 03:00:48'),
(27, 'ทนงค์ บุญเ', 'Click-menu', 'DocumentOfficialInList', '2021-12-30 03:00:49'),
(28, 'ทนงค์', 'LOGOUT', '', '2021-12-30 03:04:19'),
(29, 'ทนงค์', 'LOGIN', '', '2021-12-30 03:04:21'),
(30, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2021-12-30 03:04:47'),
(31, 'admin', 'Click-menu', 'DocumentOfficialInList', '2021-12-30 03:04:49'),
(32, 'ทนงค์', 'LOGOUT', '', '2021-12-30 03:19:50'),
(33, 'ทนงค์', 'LOGIN', '', '2021-12-30 03:19:57'),
(34, 'admin', 'เข้า-menu', 'UserManager', '2021-12-30 03:20:00'),
(35, 'admin', 'Update', 'เรื่องร้องเรียน ร้องทุกข์  เรื่อง :ท่อระบายน้ำอุดตัน', '2021-12-30 03:25:41'),
(36, 'admin', 'Update', 'เรื่องร้องเรียน ร้องทุกข์  เรื่อง :ท่อระบายน้ำอุดตัน และน้ำเจิ่งนอง', '2021-12-30 03:27:02'),
(37, 'admin', 'Click-menu', 'DocMgrList', '2021-12-30 06:38:06'),
(38, 'admin', 'Click-menu', 'ComplianList', '2021-12-30 06:38:08'),
(39, 'admin', 'Click-menu', 'RegulationList', '2021-12-30 06:38:09'),
(40, 'admin', 'Click-menu', 'Asset-System', '2021-12-30 06:38:10'),
(41, 'admin', 'Click-menu', 'Information', '2021-12-30 06:38:10'),
(42, 'admin', 'Click-menu', 'Search', '2021-12-30 06:41:41'),
(43, 'admin', 'Click-menu', 'Report', '2021-12-30 06:41:41'),
(44, 'ทนงค์', 'LOGOUT', '', '2021-12-30 06:41:44'),
(45, 'สุกัญญา', 'LOGIN', '', '2021-12-30 06:42:01'),
(46, 'aumaim', 'Click-menu', 'ImportContrac', '2021-12-30 06:42:06'),
(47, 'aumaim', 'Click-menu', 'RegulationList', '2021-12-30 06:42:07'),
(48, 'aumaim', 'Click-menu', 'Asset-System', '2021-12-30 06:42:08'),
(49, 'aumaim', 'Click-menu', 'DocMgrList', '2021-12-30 06:42:10'),
(50, 'aumaim', 'Update', 'ระเบียบ คำสั่ง เรื่อง :จบเกม', '2021-12-30 07:12:16'),
(51, 'aumaim', 'Update', 'ระเบียบ คำสั่ง เรื่อง :นานโน', '2021-12-30 07:13:02'),
(52, 'aumaim', 'Click-menu', 'Asset-System', '2021-12-30 07:13:32'),
(53, 'ทนงค์', 'LOGIN', '', '2022-01-04 03:29:54'),
(54, 'admin', 'เข้า-menu', 'UserManager', '2022-01-04 03:37:38'),
(55, 'admin', 'Click-menu', 'DocumentOfficialInList', '2022-01-04 03:38:07'),
(56, 'admin', 'Click-menu', 'DocMgrList', '2022-01-04 03:38:11'),
(57, 'admin', 'Click-menu', 'RegulationList', '2022-01-04 03:38:12'),
(58, 'admin', 'Click-menu', 'Information', '2022-01-04 03:38:20'),
(59, 'admin', 'Click-menu', 'RegulationList', '2022-01-04 03:42:12'),
(60, 'admin', 'Click-menu', 'ImportContrac', '2022-01-04 03:42:14'),
(61, 'admin', 'Click-menu', 'ImportContrac', '2022-01-04 03:42:17'),
(62, 'admin', 'Click-menu', 'ImportAcceptance', '2022-01-04 03:42:20'),
(63, 'admin', 'Click-menu', 'Search', '2022-01-04 03:42:27'),
(64, 'admin', 'Click-menu', 'Report', '2022-01-04 03:42:29'),
(65, 'admin', 'Click-menu', 'map', '2022-01-04 03:42:32'),
(66, 'admin', 'Click-menu', 'Information', '2022-01-04 03:42:36'),
(67, 'ทนงค์', 'LOGOUT', '', '2022-01-04 03:46:40'),
(68, 'ทนงค์', 'LOGIN', '', '2022-01-04 03:46:54'),
(69, 'admin', 'Click-menu', 'Information', '2022-01-04 03:50:04'),
(70, 'admin', 'Click-menu', 'Information', '2022-01-04 03:50:08'),
(71, 'admin', 'Click-menu', 'Information', '2022-01-04 03:50:12'),
(72, 'admin', 'Click-menu', 'Information', '2022-01-04 03:50:54'),
(73, 'admin', 'Click-menu', 'RegulationList', '2022-01-04 04:19:22'),
(74, 'admin', 'Click-menu', 'Information', '2022-01-04 04:19:26'),
(75, 'ทนงค์', 'LOGIN', '', '2022-01-05 02:42:12'),
(76, 'admin', 'Click-menu', 'Asset-System', '2022-01-05 02:44:59'),
(77, 'admin', 'Click-menu', 'Information', '2022-01-05 02:45:04'),
(78, 'admin', 'Click-menu', 'Information', '2022-01-05 02:46:46'),
(79, 'admin', 'Click-menu', 'Report', '2022-01-05 05:20:11'),
(80, 'admin', 'Click-menu', 'Report', '2022-01-05 05:20:24'),
(81, 'admin', 'Click-menu', 'Search', '2022-01-05 05:20:25'),
(82, 'admin', 'Click-menu', 'Report', '2022-01-05 05:20:26'),
(83, 'admin', 'Click-menu', 'Information', '2022-01-05 07:13:18'),
(84, 'admin', 'Click-menu', 'Information', '2022-01-05 08:57:08'),
(85, 'ทนงค์', 'LOGOUT', '', '2022-01-05 09:13:32'),
(86, 'ทนงค์', 'LOGIN', '', '2022-01-05 09:13:35'),
(87, 'admin', 'Click-menu', 'Information', '2022-01-05 09:13:40'),
(88, 'ทนงค์', 'LOGIN', '', '2022-01-06 02:15:00'),
(89, 'admin', 'Click-menu', 'Information', '2022-01-06 02:15:04'),
(90, 'ทนงค์', 'LOGIN', '', '2022-01-07 01:43:54'),
(91, 'admin', 'Click-menu', 'Information', '2022-01-07 01:44:06'),
(92, 'ทนงค์', 'LOGIN', '', '2022-02-03 03:55:24'),
(93, 'ทนงค์', 'LOGIN', '', '2022-02-03 04:07:18'),
(94, 'ทนงค์', 'LOGIN', '', '2022-02-07 03:25:56'),
(95, 'ทนงค์', 'LOGIN', '', '2022-03-14 04:48:17'),
(96, 'admin', 'Click-menu', 'DocumentOfficialInList', '2022-03-14 04:48:36'),
(97, 'admin', 'Click-menu', 'DocMgrList', '2022-03-14 05:42:48'),
(98, 'admin', 'Click-menu', 'ComplianList', '2022-03-14 05:42:50'),
(99, 'admin', 'Click-menu', 'RegulationList', '2022-03-14 05:42:51'),
(100, 'admin', 'Click-menu', 'Asset-System', '2022-03-14 05:42:52'),
(101, 'admin', 'Click-menu', 'Information', '2022-03-14 05:42:54'),
(102, 'ทนงค์', 'LOGIN', '', '2022-03-14 05:43:18'),
(103, 'admin', 'Click-menu', 'ComplianList', '2022-03-14 05:47:16'),
(104, 'admin', 'Click-menu', 'ComplianList', '2022-03-14 05:51:00'),
(105, 'admin', 'Click-menu', 'DocMgrList', '2022-03-14 05:51:02'),
(106, 'admin', 'Click-menu', 'RegulationList', '2022-03-14 05:51:04'),
(107, 'admin', 'Update', 'ระเบียบ คำสั่ง เรื่อง :ประกาศ สบค', '2022-03-14 05:51:32'),
(108, 'ทนงค์', 'LOGIN', '', '2022-08-24 08:34:04'),
(109, 'admin', 'Click-menu', 'DocMgrList', '2022-08-24 08:34:09'),
(110, 'admin', 'Click-menu', 'map', '2022-08-24 08:34:20'),
(111, 'admin', 'Click-menu', 'Asset-System', '2022-08-24 08:34:37'),
(112, 'admin', 'Click-menu', 'Asset-System', '2022-08-24 08:34:42'),
(113, 'admin', 'Click-menu', 'DocMgrList', '2022-08-24 08:34:46'),
(114, 'admin', 'Click-menu', 'Report', '2022-08-24 08:34:53'),
(115, 'ทนงค์', 'LOGIN', '', '2023-02-09 08:25:49'),
(116, 'admin', 'click-menu', 'DocAcceptList', '2023-02-09 08:26:00'),
(117, 'admin', 'click-menu', 'InternalMemoList', '2023-02-09 08:26:04'),
(118, 'admin', 'click-menu', 'UserManager', '2023-02-09 08:26:19'),
(119, 'ทนงค์', 'LOGIN', '', '2023-02-20 07:53:17'),
(120, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-02-20 07:53:30'),
(121, 'admin', 'Click-menu', 'DocMgrList', '2023-02-20 07:53:44'),
(122, 'admin', 'Click-menu', 'ComplianList', '2023-02-20 07:53:46'),
(123, 'admin', 'Click-menu', 'RegulationList', '2023-02-20 07:53:48'),
(124, 'admin', 'Click-menu', 'Asset-System', '2023-02-20 07:53:49'),
(125, 'admin', 'Click-menu', 'Information', '2023-02-20 07:53:52'),
(126, 'admin', 'Click-menu', 'Report', '2023-02-20 07:53:56'),
(127, 'admin', 'Click-menu', 'map', '2023-02-20 07:53:58'),
(128, 'admin', 'Click-menu', 'Report', '2023-02-20 07:54:00'),
(129, 'admin', 'Click-menu', 'map', '2023-02-20 07:54:01'),
(130, 'admin', 'Click-menu', 'map', '2023-02-20 07:54:09'),
(131, 'admin', 'Click-menu', 'ComplianList', '2023-02-20 07:54:15'),
(132, 'admin', 'Click-menu', 'DocMgrList', '2023-02-20 07:54:31'),
(133, 'admin', 'Click-menu', 'ComplianList', '2023-02-20 07:54:33'),
(134, 'admin', 'Click-menu', 'RegulationList', '2023-02-20 07:54:36'),
(135, 'admin', 'Click-menu', 'ImportContrac', '2023-02-20 09:53:07'),
(136, 'ทนงค์', 'LOGIN', '', '2023-03-09 08:42:30'),
(137, 'ทนงค์', 'LOGIN', '', '2023-03-31 07:44:29'),
(138, 'ทนงค์', 'LOGOUT', '', '2023-03-31 07:44:49'),
(139, 'ทนงค์', 'LOGIN', '', '2023-03-31 07:45:16'),
(140, 'ทนงค์', 'LOGOUT', '', '2023-03-31 07:46:22'),
(141, 'สมปอง', 'LOGIN', '', '2023-03-31 07:46:37'),
(142, 'สมปอง', 'LOGOUT', '', '2023-03-31 07:47:10'),
(143, 'tha', 'LOGIN', '', '2023-03-31 07:47:17'),
(144, 'ทนงค์', 'LOGIN', '', '2023-04-03 02:52:51'),
(145, 'admin', 'Click-menu', 'Asset-System', '2023-04-03 03:00:51'),
(146, 'admin', 'Click-menu', 'Asset-System', '2023-04-03 03:00:53'),
(147, 'admin', 'Click-menu', 'Asset-System', '2023-04-03 03:00:57'),
(148, 'admin', 'Click-menu', 'Information', '2023-04-03 03:02:25'),
(149, 'admin', 'Click-menu', 'Information', '2023-04-03 03:02:34'),
(150, 'admin', 'Click-menu', 'Information', '2023-04-03 03:48:36'),
(151, 'admin', 'Click-menu', 'Information', '2023-04-03 03:48:43'),
(152, 'admin', 'Click-menu', 'Asset-System', '2023-04-03 03:48:43'),
(153, 'admin', 'Click-menu', 'RegulationList', '2023-04-03 03:48:46'),
(154, 'admin', 'Click-menu', 'Asset-System', '2023-04-03 03:48:50'),
(155, 'ทนงค์', 'LOGOUT', '', '2023-04-03 04:05:23'),
(156, 'ทนงค์', 'LOGIN', '', '2023-04-03 05:24:05'),
(157, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-04-03 05:54:36'),
(158, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-04-03 06:14:26'),
(159, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-04-03 06:17:46'),
(160, 'admin', 'Click-menu', 'DocumentOfficialInList', '2023-04-03 06:17:56'),
(161, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-04-03 06:18:08'),
(162, 'admin', 'Click-menu', 'DocumentOfficialInList', '2023-04-03 06:18:17'),
(163, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-04-03 06:19:01'),
(164, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-04-03 06:19:24'),
(165, 'admin', 'Click-menu', 'DocumentOfficialInList', '2023-04-03 06:20:20'),
(166, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-04-03 06:21:50'),
(167, 'admin', 'Click-menu', 'DocMgrList', '2023-04-03 06:59:16'),
(168, 'ทนงค์', 'LOGIN', '', '2023-04-07 07:59:59'),
(169, 'admin', 'click-menu', 'UserManager', '2023-04-07 08:00:02'),
(170, 'ทนงค์', 'LOGOUT', '', '2023-04-07 08:01:48'),
(171, 'สมปอง', 'LOGIN', '', '2023-04-07 08:02:02'),
(172, 'sompong', 'click-menu', 'UserManager', '2023-04-07 08:02:05'),
(173, 'ทนงค์', 'LOGOUT', '', '2023-10-24 12:16:07'),
(174, 'admin', 'Click-menu', 'DocMgrList', '2023-10-24 12:33:13'),
(175, 'admin', 'Click-menu', 'ComplianList', '2023-10-24 12:33:16'),
(176, 'admin', 'Click-menu', 'RegulationList', '2023-10-24 12:33:20'),
(177, 'admin', 'Click-menu', 'Asset-System', '2023-10-24 12:33:24'),
(178, 'admin', 'Click-menu', 'DocMgrList', '2023-10-24 18:02:53'),
(179, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-10-24 18:25:18'),
(180, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-10-24 18:25:22'),
(181, 'ทนงค์', 'LOGOUT', '', '2023-11-06 04:59:10'),
(182, 'ทนงค์', 'LOGOUT', '', '2023-11-06 06:14:36'),
(183, 'ทนงค์', 'LOGOUT', '', '2023-11-06 07:57:19'),
(184, 'ทนงค์', 'LOGOUT', '', '2023-11-06 08:18:05'),
(185, 'ทนงค์', 'LOGOUT', '', '2023-11-06 09:38:55'),
(186, 'admin', 'Click-menu', 'Information', '2023-11-15 01:44:58'),
(187, 'admin', 'Click-menu', 'Information', '2023-11-15 01:45:06'),
(188, 'ทนงค์', 'LOGOUT', '', '2023-11-21 08:43:48'),
(189, 'admin', 'Click-menu', 'Information', '2023-11-22 03:39:20'),
(190, 'admin', 'Click-menu', 'map', '2023-11-22 03:39:23'),
(191, 'admin', 'Click-menu', 'Report', '2023-11-22 03:39:25'),
(192, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-11-22 03:39:28'),
(193, 'admin', 'Click-menu', 'Search', '2023-11-22 03:39:31'),
(194, 'admin', 'Click-menu', 'DocumentOfficialOutList', '2023-11-22 03:39:34'),
(195, 'admin', 'Click-menu', 'Information', '2023-11-22 03:39:36'),
(196, 'admin', 'Click-menu', 'Information', '2023-11-22 04:15:31'),
(197, 'admin', 'Click-menu', 'ImportContrac', '2023-11-22 04:15:35'),
(198, 'admin', 'Click-menu', 'ImportAcceptance', '2023-11-22 04:15:37'),
(199, 'admin', 'Click-menu', 'ImportAcceptance', '2023-11-22 04:15:39'),
(200, 'admin', 'Click-menu', 'ImportContrac', '2023-11-22 04:15:41'),
(201, 'admin', 'Click-menu', 'ImportAsset', '2023-11-22 04:15:43'),
(202, 'admin', 'Click-menu', 'Import-treasury', '2023-11-22 04:15:45'),
(203, 'admin', 'Click-menu', 'ImportContrac', '2023-11-22 09:39:06'),
(204, 'admin', 'Click-menu', 'ImportAcceptance', '2023-11-22 09:39:08'),
(205, 'admin', 'Click-menu', 'ImportAsset', '2023-11-22 09:39:10'),
(206, 'admin', 'Click-menu', 'Import-treasury', '2023-11-22 09:39:13'),
(207, 'admin', 'Click-menu', 'ImportAsset', '2023-11-22 09:39:16'),
(208, 'admin', 'Click-menu', 'ImportAcceptance', '2023-11-22 09:39:19'),
(209, 'admin', 'Click-menu', 'Information', '2023-11-23 03:03:59'),
(210, 'admin', 'Click-menu', 'Information', '2023-11-23 03:04:02'),
(211, 'admin', 'Click-menu', 'Information', '2023-11-23 03:38:57'),
(212, 'admin', 'Click-menu', 'Information', '2023-11-23 03:39:25'),
(213, 'admin', 'Click-menu', 'Information', '2023-11-23 03:39:41'),
(214, 'ทนงค์', 'LOGOUT', '', '2023-11-23 03:51:31'),
(215, 'ทนงค์', 'LOGOUT', '', '2023-11-30 10:02:59'),
(216, 'ทนงค์', 'LOGOUT', '', '2023-11-30 10:05:01'),
(217, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(218, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(219, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(220, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(221, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(222, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(223, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(224, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(225, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(226, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(227, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(228, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(229, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(230, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(231, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(232, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(233, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(234, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(235, '', 'LOGOUT', '', '2023-11-30 10:05:01'),
(236, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(237, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(238, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(239, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(240, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(241, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(242, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(243, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(244, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(245, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(246, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(247, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(248, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(249, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(250, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(251, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(252, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(253, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(254, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(255, '', 'LOGOUT', '', '2023-11-30 10:05:02'),
(256, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(257, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(258, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(259, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(260, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(261, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(262, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(263, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(264, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(265, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(266, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(267, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(268, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(269, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(270, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(271, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(272, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(273, '', 'LOGOUT', '', '2023-11-30 10:05:07'),
(274, '', 'LOGOUT', '', '2023-11-30 10:05:08'),
(275, '', 'LOGOUT', '', '2023-11-30 10:05:08'),
(276, '', 'LOGOUT', '', '2023-11-30 10:05:26'),
(277, 'ทนงค์', 'LOGOUT', '', '2023-11-30 10:05:34'),
(278, 'ทนงค์', 'LOGOUT', '', '2023-11-30 11:01:27'),
(279, 'ทนงค์', 'LOGOUT', '', '2023-11-30 11:02:21'),
(280, 'ทนงค์', 'LOGOUT', '', '2023-11-30 11:03:57'),
(281, 'ทนงค์', 'LOGOUT', '', '2023-11-30 11:23:54'),
(282, 'ทดสอบ', 'LOGOUT', '', '2023-11-30 11:32:12'),
(283, 'ทนงค์', 'LOGOUT', '', '2023-11-30 11:32:44'),
(284, 'ทดสอบ', 'LOGOUT', '', '2023-11-30 11:33:50'),
(285, 'ทดสอบ', 'LOGOUT', '', '2023-11-30 11:37:48'),
(286, 'ทดสอบ', 'LOGOUT', '', '2023-11-30 11:44:37'),
(287, 'ทนงค์', 'LOGOUT', '', '2023-11-30 11:45:24'),
(288, 'ทดสอบ', 'LOGOUT', '', '2023-11-30 11:54:25'),
(289, 'ทดสอบ', 'LOGOUT', '', '2023-11-30 11:54:25'),
(290, 'ทดสอบ', 'LOGOUT', '', '2023-11-30 11:57:17'),
(291, 'ทนงค์', 'LOGOUT', '', '2023-11-30 11:58:00'),
(292, 'ทดสอบ', 'LOGOUT', '', '2023-11-30 12:08:16'),
(293, 'ทนงค์', 'LOGOUT', '', '2023-11-30 12:11:11'),
(294, 'ทนงค์', 'LOGOUT', '', '2023-11-30 12:12:35'),
(295, 'ทนงค์', 'LOGOUT', '', '2023-11-30 12:26:20'),
(296, 'ทดสอบ', 'LOGOUT', '', '2023-11-30 12:30:23');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_division`
--

CREATE TABLE `tbl_division` (
  `division_id` int(3) NOT NULL COMMENT 'รหัส',
  `division_code` varchar(50) NOT NULL COMMENT 'รหัสสำนัก/กอง',
  `division_name` varchar(100) NOT NULL COMMENT 'ชื่อสำนัก/กอง',
  `division_initials` varchar(5) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tbl_division`
--

INSERT INTO `tbl_division` (`division_id`, `division_code`, `division_name`, `division_initials`) VALUES
(1, '0100', 'สำนักปลัด', 'สป.'),
(2, '0200', 'สำนักการศึกษา', 'สศ.'),
(3, '0300', 'สำนักช่าง', 'สช.'),
(4, '0400', 'สำนักคลัง', 'สค.'),
(5, '0500', 'กองสาธารณสุขและสิ่งแวดล้อม', 'กสส.'),
(6, '0600', 'กองสวัสดิการสังคม', 'กสค.'),
(7, '0700', 'กองการเจ้าหน้าที่', 'กจ.'),
(8, '0800', 'กองยุทธศาสตร์และงบประมาณ', 'กย.'),
(9, '0900', 'หน่วยตรวจสอบภายใน', 'นต.');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_location`
--

CREATE TABLE `tbl_location` (
  `id` int(11) NOT NULL,
  `location_code` varchar(10) NOT NULL,
  `location_name` varchar(255) NOT NULL,
  `location_detail` varchar(255) NOT NULL,
  `LAT` varchar(10) NOT NULL,
  `LNG` varchar(10) NOT NULL,
  `division_ref` varchar(10) NOT NULL,
  `part_ref` varchar(10) NOT NULL,
  `subdivision_ref` varchar(10) NOT NULL,
  `section_ref` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tbl_location`
--

INSERT INTO `tbl_location` (`id`, `location_code`, `location_name`, `location_detail`, `LAT`, `LNG`, `division_ref`, `part_ref`, `subdivision_ref`, `section_ref`) VALUES
(1, 'LC01', 'สำนักงาน', 'อาคารสำนักงาน เทศบาลนครรังสิต', '13.986915', '100.609675', '53603', 'P003', 'SD01', 'W01'),
(2, 'LC06', 'สถานีสูบน้ำ รน.38', 'N A', '222', '333', '53603', 'P002', 'SD05', 'W08'),
(3, 'LC06', 'สถานีสูบน้ำ รน.38', 'N A', '222', '333', '53603', 'P002', 'SD05', 'W08'),
(4, 'LC06', 'สถานีสูบน้ำ รน.38', 'N A', '222', '333', '53603', 'P002', 'SD05', 'W08'),
(5, 'LC07', 'สถานีสูบน้ำ รป 15', 'N A', '44444', '555555', '53603', 'P002', 'SD05', 'W08');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_mat`
--

CREATE TABLE `tbl_mat` (
  `id` int(11) NOT NULL,
  `mat_code` varchar(5) NOT NULL,
  `mat_name` varchar(100) NOT NULL,
  `price` double(10,2) NOT NULL,
  `unit` varchar(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tbl_mat`
--

INSERT INTO `tbl_mat` (`id`, `mat_code`, `mat_name`, `price`, `unit`) VALUES
(1, 'c01', 'ปากกา', 5.00, 'u001'),
(2, 'c02', 'ดินสอ', 3.00, 'u001'),
(3, 'c03', 'ยางลบ', 2.00, 'u001'),
(4, 'c04', 'ลิขวิดเปเปอร์', 25.00, ''),
(5, 'c06', 'กระดาษ A4', 250.00, ''),
(6, 'C07', 'กระดาษ A3', 350.00, '');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_part`
--

CREATE TABLE `tbl_part` (
  `part_id` int(11) NOT NULL,
  `part_code` varchar(5) NOT NULL,
  `part_name` varchar(100) NOT NULL,
  `division_ref` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci COMMENT='ส่วนงาน';

--
-- Dumping data for table `tbl_part`
--

INSERT INTO `tbl_part` (`part_id`, `part_code`, `part_name`, `division_ref`) VALUES
(1, '0110', '-- ไม่มีส่วน --', '0100'),
(2, '0201', 'ส่วนบริหารการศึกษา', '0200'),
(3, '0202', 'ส่วนส่งเสริมการศึกษา ศาสนาและวัฒนธรรม', '0200'),
(4, '0203', '-- ไม่มีส่วน --', '0200'),
(5, '0301', '-- ไม่มีส่วน --', '0300'),
(6, '0410', 'ส่วนบริหารงานคลัง', '0400'),
(7, '0420', 'ส่วนพัฒนารายได้', '0400'),
(8, '0403', '-- ไม่มีส่วน --', '0400'),
(9, '0510', '-- ไม่มีส่วน --', '0500'),
(10, '0610', '-- ไม่มีส่วน --', '0600'),
(11, '0710', '-- ไม่มีส่วน --', '0700'),
(12, '0810', '-- ไม่มีส่วน --', '0800'),
(13, '0910', '-- ไม่มีส่วน --', '0900');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_positions`
--

CREATE TABLE `tbl_positions` (
  `position_id` int(11) NOT NULL,
  `position_code` varchar(5) NOT NULL,
  `position_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tbl_positions`
--

INSERT INTO `tbl_positions` (`position_id`, `position_code`, `position_name`) VALUES
(1, 'S0001', 'ปลัดเทศบาล'),
(2, 'S0002', 'รองปลัดเทศบาล'),
(3, 'M0001', 'ผู้อำนวยการสำหนัก/กอง'),
(4, 'M0002', 'ผู้อำนวยการส่วน'),
(5, 'M0003', 'หัวหน้าฝ่าย'),
(6, 'K0001', 'นักจัดการงานทั่วไป'),
(7, 'K0002', 'นักวิเครำะห์นโยบำยและแผน'),
(8, 'K0003', 'นิติกร'),
(9, 'K0004', 'นักทรัพยากรบุคคล'),
(10, 'K0005', 'นักส่งเสริมกำรปกครองท้องถิ่น'),
(11, 'K0006', 'นักวิชาการศึกษา'),
(12, 'K0007', 'นักวิชาการคลัง'),
(13, 'K0008', 'นักวิชาการตรวจสอบภายใน'),
(14, 'K0009', 'นักวิชาการเงินและบัญชี'),
(15, 'K0010', 'นักวิชาการพัสดุ'),
(16, 'K0011', 'นักวิชาการคอมพิวเตอร์'),
(17, 'K0012', 'วิศวกรโยธา'),
(18, 'K0013', 'วิศวกรไฟฟ้า'),
(19, 'K0014', 'สถาปนิก'),
(20, 'K0015', 'นักผังเมือง'),
(21, 'O0001', 'เจ้าพนักงานธุรการ'),
(22, 'O0002', 'เจ้านายช่างศิลป์'),
(23, 'O0003', 'เจ้าพนักงานสุขาภิบาล'),
(24, 'O0004', 'นายช่างโยธา'),
(25, 'O0005', 'นายช่างไฟฟ้า'),
(26, 'O0006', 'นายช่างเครื่องกล'),
(27, 'O0007', 'นายช่างเครื่องยนต์');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_request`
--

CREATE TABLE `tbl_request` (
  `id` int(11) NOT NULL,
  `mat` varchar(10) NOT NULL,
  `qty` int(11) NOT NULL,
  `user` varchar(10) NOT NULL,
  `timp` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `tbl_stock`
--

CREATE TABLE `tbl_stock` (
  `id` int(11) NOT NULL,
  `mat_code` varchar(5) NOT NULL,
  `qty` int(11) NOT NULL,
  `unit_code` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tbl_stock`
--

INSERT INTO `tbl_stock` (`id`, `mat_code`, `qty`, `unit_code`) VALUES
(1, 'c06', 25, 'u003'),
(2, 'C07', 60, 'u003'),
(3, 'c01', 284, 'u006');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_subdivision`
--

CREATE TABLE `tbl_subdivision` (
  `subdivision_id` int(11) NOT NULL COMMENT 'รหัส',
  `subdivision_code` varchar(4) NOT NULL COMMENT 'รหัสฝ่าย',
  `subdivision_name` varchar(100) NOT NULL COMMENT 'ชื่อฝ่าย',
  `part_ref` varchar(11) NOT NULL COMMENT 'ส่วน',
  `division_ref` varchar(11) NOT NULL COMMENT 'รหัสสำนัก/กอง'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tbl_subdivision`
--

INSERT INTO `tbl_subdivision` (`subdivision_id`, `subdivision_code`, `subdivision_name`, `part_ref`, `division_ref`) VALUES
(1, '0111', 'ฝ่ายบริหารงทั่วไป', '0110', '0100'),
(2, '0112', 'ฝ่ายทะเบียนราษฎร', '0110', '0100'),
(3, '0113', 'ฝ่ายนิติการ', '0110', '0100'),
(4, '0114', 'ฝ่ายรักษาความสงบ', '0110', '0100'),
(5, '0115', 'ฝ่ายส่งเสริมการท่องเที่ยว', '0110', '0100'),
(6, '0116', 'งานป้องกันและบรรเทาสาธารณภัย', '0110', '0100'),
(7, '0211', 'ฝ่ายการเจ้าหน้าที่', '0201', '0200'),
(8, '0212', 'ฝ่ายกิจการโครงเรียน', '0201', '0200'),
(9, '0213', 'ฝ่ายการศึกษานอกระบบและอัธยาศัย', '0202', '0200'),
(10, '0214', 'ฝ่ายส่งเสริมศาสนาศิลปะและวัฒนธรรม', '0202', '0200'),
(11, '0215', 'หน่วยศึกษานิเทศก์', '0203', '0200'),
(12, '0216', 'โรงเรียน', '0203', '0200'),
(13, '0217', 'ศูนย์พัฒนาเด็กเล็ก', '0203', '0200'),
(14, '0311', 'ฝ่ายบริหารงานทั่วไป', '0301', '0300'),
(15, '0312', 'ฝ่ายสวนสาธารณะ', '0301', '0300'),
(16, '0313', 'ฝ่ายช่างสุขาภิบาล', '0301', '0300'),
(17, '0314', 'ฝ่ายควบคุมอาคารและผังเมือง – เฉพาะงบบุคลากร', '0301', '0300'),
(18, '0315', 'ฝ่ายสาธารณูปโภค', '0301', '0300'),
(19, '0316', 'ฝ่ายควบคุมการก่อสร้าง', '0301', '0300'),
(20, '0411', 'ฝ่ายพัสดุและทรัพย์สิน', '0410', '0400'),
(21, '0412', 'ฝ่ายการเงินและบัญชี', '0410', '0400'),
(22, '0413', 'ฝ่ายสถิติการคลัง', '0410', '0400'),
(23, '0421', 'ฝ่ายแผนที่และทะเบียนทรัพย์สิน', '0420', '0400'),
(24, '0422', 'ฝ่ายพัฒนารายได้', '0420', '0400'),
(25, '0423', 'ฝ่ายผลประโยชน์และกิจการพาณิชย์', '0420', '0400'),
(26, '0511', 'ฝ่ายบริหารงานทั่วไป', '0510', '0500'),
(27, '0512', 'ฝ่ายบริการสาธารณสุข', '0510', '0500'),
(28, '0513', 'ฝ่ายบริหารงานสาธารณสุข', '0510', '0500'),
(29, '0611', 'ฝ่ายบริหารงานทั่วไป ', '0610', '0600'),
(30, '0711', 'ฝ่ายบริหารงานทั่วไป', '0710', '0700'),
(31, '0811', 'ฝ่ายบริหารงานทั่วไป', '0810', '0800'),
(32, '0911', 'งานควบคุมภายในและการตรวจสอบภายใน', '0910', '0900');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_treasury`
--

CREATE TABLE `tbl_treasury` (
  `id` int(11) NOT NULL,
  `regis_date` varchar(255) NOT NULL,
  `contract_no` varchar(255) NOT NULL,
  `contractor` varchar(255) NOT NULL,
  `garanty_type` varchar(255) NOT NULL,
  `cost_budget` varchar(255) NOT NULL,
  `project_name` varchar(255) NOT NULL,
  `status` varchar(20) NOT NULL,
  `garanty_end` varchar(255) NOT NULL,
  `owner` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tbl_treasury`
--

INSERT INTO `tbl_treasury` (`id`, `regis_date`, `contract_no`, `contractor`, `garanty_type`, `cost_budget`, `project_name`, `status`, `garanty_end`, `owner`) VALUES
(1, '20/4/2561', 'CNTR-0970/61', 'ห้างหุ้นส่วนจำกัด ศิริศรพาณิชย์ 2011', 'หนังสือค้ำประกันเลขที่ 100017518555 / 2 ปี ', '26,000.00', 'ก่อสร้างถนน คสล. หนา 0.15 เมตร ผิวจราจรกว้างไม่น้อยกว่า 6.00 เมตร ความยาวประมาณไม่น้อยกว่า 191 เมตร', 'ยังไม่คืน', '5/6/2563', 'สำนักการช่าง'),
(2, '11/5/2561', 'CNTR-968/61', 'ห้างหุ้นส่วนจำกัด ศิริศรพาณิชย์ 2011', 'หนังสือค้ำประกันเลขที่ 100017518679 / 2 ปี ', '35,650.00', 'จ้างก่อสร้างโครงการขยายผิวจราจร คสล.ถนนเลียบคลองรังสิต-ประยูรศักดิ์ ช่วงโค้งผู้ใหญ่ลีถึงท่าเรือจ้างตลาดใน', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(3, '11/6/2561', 'CNTR-1268/61', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', 'เงินสด  / 3 เดือน ', '9,095.00', 'จ้างซ่อมแซมตู้บรรทุกขยะ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(4, '13/6/2561', 'CNTR-1163/61', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'หนังสือค้ำประกันเลขที่ ค.47690234806000 / 2 ปี ', '282,000.00', 'โครงการก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ หมู่บ้านธารารินทร์ ซอย 2 (ช่วงที่ 1)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(5, '1/8/2561', 'CNTR-1611/61', 'บริษัท นิมิต 317 จำกัด', 'หนังสือค้ำประกันเลขที่ 100019403364 / 2 ปี ', '187,500.00', 'โครงการก่อสร้างรั้วโรงเก็บพัสดุเทศบาลนครรังสิต ซอยรังสิต-นครนายก 56', 'ยังไม่คืน', '1/2/2564', 'สำนักการช่าง'),
(6, '20/8/2561', 'CNTR-1750/61', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', 'เงินสด  / 3 เดือน ', '6,926.00', 'จ้างซ่อม จำนวน 3 รายการ (ตู้บรรทุกขยะ เบอร์ 16,เครื่องเติมอากาศ, เครื่องย่อยกิ่งไม้)', 'ยังไม่คืน', '4/12/2561', 'สำนักการช่าง'),
(7, '23/8/2561', 'CNTR-1783/61', 'บริษัท ธนกรเมตัลเวอร์คโปรดิวเซอร์ จำกัด', 'เงินสด  / 2 ปี ', '25,000.00', 'จ้างเหมาปรับปรุงเมรุเผาศพ บริเวณวัดแสงสรรค์ ', 'ยังไม่คืน', '22/11/2563', 'สำนักการช่าง'),
(8, '3/9/2561', 'CNTR-1853/61', 'บริษัท เอสทีพี อินตริเกต จำกัด', 'หนังสือค้ำประกันเลขที่ 100019911297 / 1 ปี ', '3,000.00', 'ซื้อเครื่องจ่ายกระแสไฟฟ้าชุดประชุม', 'ยังไม่คืน', '4/9/2562', 'สำนักการช่าง'),
(9, '10/9/2561', 'CNTR-1901/61', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัดชั่น', 'เงินสด  / 1 ปี ', '6,400.00', 'จ้างปรับปรุงพื้นคอนกรีตพร้อมวางท่อระบายน้ำและบ่อพัก บริเวณลานแอโรบิคหน้าศูนย์การเรียนรู้ฯ', 'ยังไม่คืน', '13/10/2562', 'สำนักการช่าง'),
(10, '12/9/2561', 'CNTR-1915/61', 'บริษัท เซิท คอนแทรคเตอร์ จำกัด', 'เงินสด  / 1 ปี ', '24,900.00', 'โครงการติดตั้งป้ายชื่อซอยตามอัตลักษณ์เมือง', 'ยังไม่คืน', '11/11/2562', 'สำนักการช่าง'),
(11, '14/9/2561', 'CNTR-1949/61', 'บริษัท กรีนเวิร์ค แอสโซซิเอท จำกัด', 'เงินสด  / 1 ปี ', '24,200.00', 'จ้างปรับปรุงถนนแอสฟัลท์ติกคอนกรีต สะพาน ไหล่ทาง ภายในเขตเทศบาล ', 'ยังไม่คืน', '16/10/2562', 'สำนักการช่าง'),
(12, '18/9/2561', 'CNTR-1988/61', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัดชั่น', 'เงินสด  / 1 ปี ', '24,750.00', 'จ้างปรับปรุงไหล่ทาง ซอยรังสิต-นครนายก ๕๖', 'ยังไม่คืน', '16/10/2562', 'สำนักการช่าง'),
(13, '19/9/2561', 'CNTR-1987/61', 'ห้างหุ้นส่วนจำกัด เอ็น.เค.สถาปัตย์', 'หนังสือค้ำประกันเลขที่ 100020076946 / 2 ปี ', '1,677,500.00', 'จ้างก่อสร้างอาคารเรียนโรงเรียนนครรังสิต รัตนโกสินทร์ ', 'ยังไม่คืน', '29/10/2564', 'สำนักการช่าง'),
(14, '21/9/2561', 'CNTR-2025/61', 'บริษัท กรีนเวิร์ค แอสโซซิเอท จำกัด', 'เงินสด  / 2 ปี ', '24,000.00', 'จ้างเหมาปรับปรุงถนนแอสฟัลท์ติกคอนกรีตภายในเขตเทศบาล ', 'ยังไม่คืน', '23/10/2563', 'สำนักการช่าง'),
(15, '25/9/2561', 'CNTR-2040/61', 'บริษัท เทสโก้ จำกัด', 'หนังสือค้ำประกันเลขที่ 0435000195 QCMPG174966 / 1 ปี 4 เดือน 21 วัน ', '744,500.00', 'โครงการว่าจ้างที่ปรึกษาวางและปรับปรุงผังเมืองรวมเมืองท่าโขลง-รังสิต (ปรับปรุงครั้งที่ 2)', 'ยังไม่คืน', '1 ปี 4 เดือน 21 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(16, '26/9/2561', 'CNTR-2045/61', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '19,900.00', 'จ้างเหมาค่าแรงก่อสร้างหลังคาโรงเก็บพัสดุ ซอยรังสิต-นครนายก ๕๖ หลังวัดจันทร์สุข)', 'ยังไม่คืน', '27/9/2563', 'สำนักการช่าง'),
(17, '27/9/2561', 'CNTR-2048/61', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '8,900.00', 'จ้างเหมาปรับปรุงพื้นที่ติดตั้งตู้คอนเทรนเนอร์สวนสาธารณะ ซอยรังสิต-ปทุมธานี ๑๔ ซอย ๑๖', 'ยังไม่คืน', '27/10/2563', 'สำนักการช่าง'),
(18, '13/9/2562', 'CNTR-1732/61', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'หนังสือค้ำประกันเลขที่ 100019649967 / 2 ปี ', '124,500.00', 'โครงการก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิต-ปทุมธานี 14 ระหว่างซอย 4 ถึงซอย 5 (ทางหนีไฟ)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(19, '14/1/2562', 'CNTR-394/62', 'บริษัท วรัญญาภรณ์ คอนสตรัคชั่น จำกัด', 'หนังสือค้ำประกันเลขที่ 0034-0010/2561 / 2 ปี ', '134,000.00', 'โครงการก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ คสล.ถนนซอย พหลโยธิน 111 ชุมชนกรุงเทพเมืองใหม่', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(20, '18/4/2562', 'CNTR-838/62', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'หนังสือค้ำประกันเลขที่ ค.47690265185000 / 2 ปี ', '239,000.00', 'โครงการปรับปรุงถนนซอยรังสิต-นครนายก 54', 'ยังไม่คืน', '2/7/2564', 'สำนักการช่าง'),
(21, '3/5/2562', 'CNTR-921/62', 'บริษัท เซิท คอนแทรคเตอร์ จำกัด', 'เงินสด  / 1 ปี ', '23,985.00', 'โครงการติดตั้งป้ายชื่อซอยตามอัตลักษณ์เมือง', 'ยังไม่คืน', '3/7/2563', 'สำนักการช่าง'),
(22, '25/7/2562', 'CNTR-1533/62', 'ห้างหุ้นส่วนจำกัด นพเลิศ', 'เงินสด  / 30 วัน ', '15,301.00', 'เครื่องตีอากาศบนผิวน้ำ พร้อมติดตั้ง', 'ยังไม่คืน', '24/8/2563', 'สำนักการช่างงานกำจัดขยะมูลฝอยและสิ่งปฏิกูล'),
(23, '19/8/2562', 'CNTR-1681/62', 'บริษัท ฟูโซ่ ทรัค (ประเทศไทย) จำกัด', 'เงินสด  / 1 ปี ', '84,450.00', 'ซื้อรถบรรทุกหกล้อ', 'ยังไม่คืน', '26/10/2563', 'งานไฟฟ้าถนน'),
(24, '23/8/2562', 'CNTR-1702/62', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', 'เงินสด  / 1 ปี ', '10,280.00', 'จ้างซ่อมรถบรรทุกขยะอัดท้าย ทะเบียน 82-4562', 'ยังไม่คืน', '10/12/2562', 'สำนักการช่าง'),
(25, '4/9/2562', 'CNTR-1742/62', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '12,015.00', 'โครงการปรับปรุงประตูระบายน้ำบริเวณหน้าประตูน้ำจุฬา', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(26, '5/9/2562', 'CNTR-1751/62', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '11,400.00', 'จ้างเหมาลอกลำรางสาธารณะ ช่วงที่ 1 บริเวณหลังหมู่บ้านคาซ่าวิลล์ ถึง หมู่บ้านนฐดา ช่วงที่ 2 หลังหมู่บ้านพฤกษาวิลล์ 106 ถึง หมู่บ้านชมฟ้าวรางกูล', 'ยังไม่คืน', '26/10/2562', 'สำนักการช่าง'),
(27, '12/9/2562', 'CNTR-1680/62', 'บริษัท บราโว คิดส์ จำกัด', 'เงินสด  / 1 ปี ', '24,500.00', 'ซื้อเครื่องเล่นสนามกลางแจ้ง พร้อมติดตั้ง', 'ยังไม่คืน', '26/9/2563', 'สำนักการช่าง'),
(28, '13/9/2562', 'CNTR-1817/62', 'บริษัท กรีนเวิร์ค แอสโซซิเอท จำกัด', 'หนังสือค้ำประกันเลขที่ 233819000126 / 1 ปี ', '24,600.00', 'จ้างเหมาซ่อมแซมถนนลาดยางแอสฟัสท์ติกคอนกรีต ที่ชำรุดภายในเขตเทศบาลนครรังสิต', 'ยังไม่คืน', '2/10/2563', 'สำนักการช่าง'),
(29, '13/9/2562', 'CNTR-1818/62', 'บริษัท กรีนเวิร์ค แอสโซซิเอท จำกัด', 'เงินสด  / 1 ปี ', '24,750.00', 'จ้างเหมาซ่อมแซมถนนแอสฟัลติกคอนกรีต ในความรับผิดชอบของเทศมบาลนครรังสิต', 'ยังไม่คืน', '2/10/2563', 'สำนักการช่าง'),
(30, '13/9/2562', 'CNTR-1827/62', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', 'เงินสด  / 1 ปี ', '9,220.00', 'จ้างซ่อมรถเกษตรอีแต๋น ทะเบียน 026 50 000', 'ยังไม่คืน', '27/12/2562', 'สำนักการช่าง'),
(31, '17/9/2562', 'CNTR-1840/62', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', 'หนังสือค้ำประกันเลขที่ ค.00019/200209/0045/62 / 1 ปี ', '5,900.00', 'จ้างซ่อมรถบรรทุกซานต่ำ ทะเบียน 82-3255', 'ยังไม่คืน', '24/12/2562', 'งานไฟฟ้าถนน'),
(32, '18/9/2562', 'CNTR-1844/62', 'บริษัท เรเซอร์การไฟฟ้า (ประเทศไทย) จำกัด', 'เงินสด  / 3 เดือน ', '24,075.00', 'ซื้อโคมไฟถนน LED', 'ยังไม่คืน', '2/10/2563', 'งานไฟฟ้าถนน'),
(33, '18/9/2562', 'CNTR-1845/62', 'บริษัท ส.สิงห์อยู่ สปอร์ต จำกัด', 'หนังสือค้ำประกันเลขที่ 0105-0005/2562 / 2 ปี ', '24,940.00', 'ซื้อเครื่องออกกำลังกายกลางแจ้งสแตนเลสพร้อมติดตั้ง', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'งานไฟฟ้าถนน'),
(34, '19/9/2562', 'CNTR-1859/62', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '24,235.00', 'จ้างเหมาซ่อมแซมถนนคอนกรีตเสริมเหล็ก (ซ.รังสิต-นครนายก 46 และ ซ.รังสิต-นครนายก 2)', 'ยังไม่คืน', '19/1/2563', 'งานไฟฟ้าถนน'),
(35, '25/9/2562', 'CNTR-1889/62', 'บริษัท เจ ซอฟท์ จำกัด', 'เงินสด  / 3 เดือน ', '4,641.00', 'ซื้อเครื่องเสียง', 'ยังไม่คืน', '26/11/2563', 'งานไฟฟ้าถนน'),
(36, '27/9/2562', 'CNTR-1892/62', 'บริษัท ธนกุลดีไซน์ แอนด์ เดคคอร์ จำกัด', 'เช็คเลขที่ 00512289 / 1 ปี ', '24,300.00', 'โครงการติดตั้งไฟฟ้าส่องสว่างบริเวณทางแยกสาธารณะถนนภายในเขตเทศบาล', 'ยังไม่คืน', '18/2/2564', 'งานไฟฟ้าถนน'),
(37, '1/10/2562', 'CNTR-9/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัดชั่น', 'เงินสด  / 1 ปี ', '135,000.00', 'การจ้างเหมาดูแลบำรุงรักษาต้นไม้และสวนหย่อมภายในเขตเทศบาล', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'งานสวนสาธารณะสำนักการช่าง'),
(38, '5/11/2562', 'CNTR-106/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '19,350.00', 'โครงการปรับปรุงห้องชมรมผู้สูงอายุ ซอยรังสิต-ปทุมธานี 14 ซอย 11', 'ยังไม่คืน', '7/1/2564', 'สำนักการช่าง'),
(39, '12/12/2562', 'CNTR-264/63', 'บริษัท สุทธิพงษ์ ไลท์ติ้ง จำกัด', 'เงินสด  / 1 ปี ', '34,000.00', 'ซื้อโคมไฟฟ้าถนนครุภัณฑ์ไฟฟ้าและวิทยุ', 'ยังไม่คืน', '6/2/2564', 'งานไฟฟ้าถนน'),
(40, '8/1/2563', 'CNTR-407/63', 'ห้างหุ้นส่วนจำกัด ปทุมธานีวัสดุภัณฑ์', 'เงินสด  / 1 ปี ', '3,125.00', 'ซื้อเก้าอี้โครงเหล็กบุนวม', 'ยังไม่คืน', '6/2/2564', 'สำนักการช่าง'),
(41, '14/1/2563', 'CNTR-292/63', 'บริษัท วรัญญาภรณ์ คอนสตรัคชั่น จำกัด', 'หนังสือค้ำประกันเลขที่ 0102-0006/2562 / 2 ปี ', '44,200.00', 'โครงการก่อสร้างถนน คสล. ซอยรังสิต-นครนายก 26 (ช่วงท้ายซอย) (ข้างโลตัส)', 'ยังไม่คืน', '15/4/2565', 'สำนักการช่าง'),
(42, '14/1/2563', 'CNTR-293/63', 'บริษัท วรัญญาภรณ์ คอนสตรัคชั่น จำกัด', 'หนังสือค้ำประกันเลขที่ 0102-0007/2562 / 2 ปี ', '70,000.00', 'โครงการก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิต-นครนายก 10 (ยกระดับผิวจราจรเดิม)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(43, '14/1/2563', 'CNTR-294/63', 'บริษัท วรัญญาภรณ์ คอนสตรัคชั่น จำกัด', 'หนังสือค้ำประกันเลขที่ 0102-0008/2562 / 2 ปี ', '49,000.00', 'โครงการก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิต-ปทุมธานี 8 (หมู่บ้านแก้วกาญจน์ ซอย 3)', 'ยังไม่คืน', '18/4/2565', 'สำนักการช่าง'),
(44, '14/1/2563', 'CNTR-318/63', 'บริษัท วรัญญาภรณ์ คอนสตรัคชั่น จำกัด', 'หนังสือค้ำประกันเลขที่ 0102-0009/2562 / 2 ปี ', '45,400.00', 'โครงการก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิต-นครนายก 13 ซอย 13/1', 'ยังไม่คืน', '4/4/2565', 'สำนักการช่าง'),
(45, '16/1/2563', 'CNTR-446/63', 'บริษัท บราโว คิดส์ จำกัด', 'หนังสือค้ำประกันเลขที่ 233820000011 / 2 ปี ', '14,635.00', 'จ้างเหมาโครงการปูพื้นยางพาราบริเวณเครื่องเล่นปากซอยรังสิต-นครนายก 4', 'ยังไม่คืน', '7/2/2565', 'สำนักการช่าง'),
(46, '17/1/2563', 'CNTR-452/63', 'บริษัท เซิท คอนแทรคเตอร์ จำกัด', 'หนังสือค้ำประกันเลขที่ 100029703420 / 2 ปี ', '23,485.00', 'จ้างเหมาโครงการติดตั้งป้ายชื่อซอยตามอัตลักษณ์เมือง        จำนวน 15 ป้าย', 'ยังไม่คืน', '14/3/2565', 'สำนักการช่าง'),
(47, '20/1/2563', 'CNTR-462/63', 'บริษัท แพลนนิ่ง แอนด์ รีเสิร์ช คอนซัลแทนต์ จำกัด', 'หนังสือค้ำประกันเลขที่ ๐๐๐๑๙/๒๐๐๐๓๙/๐๐๐๓/๖๓ / 4 เดือน ', '36,000.00', 'ออกแบบสะพาน คสล.ข้าม', 'ยังไม่คืน', '4 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(48, '22/1/2563', 'CNTR-479/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '7,400.00', 'โครงการติดตั้งสวนแบบแนวตั้งบริเวณศาลาพักผู้โดยสารบริเวณหมู่บ้านมัณฑนา 2', 'ยังไม่คืน', '25/2/2565', 'สำนักการช่าง'),
(49, '22/1/2563', 'CNTR-480/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '5,000.00', 'โครงการติดตั้งสวนแบบแนวตั้งบริเวณด้านข้างกำแพงทางออกสำนักงานเทศบาลนครรังสิต', 'ยังไม่คืน', '6/3/2565', 'สำนักการช่าง'),
(50, '28/1/2563', 'CNTR-504/63', 'ห้างหุ้นส่วนจำกัด มัลติ ซัพพลาย อีควิปเมนท์ 1998', 'เงินสด  / 1 ปี ', '1,750.00', 'ซื้อโพเดียมไม้', 'ยังไม่คืน', '28/2/2564', 'สำนักการช่าง'),
(51, '28/1/2563', 'CNTR-505/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '5,575.00', 'จ้างเหมาซ่อมแซมขอบฟุตบาททางเท้า บริเวณศาลเจ้าไต่ฮงกง', 'ยังไม่คืน', '20/2/2564', 'สำนักการช่าง'),
(52, '31/1/2563', 'CNTR-515/63', 'ห้างหุ้นส่วนจำกัด ภักดีพรรณ์ คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '57,750.00', 'โครงการก่อสร้างถนน คสล. ซอยรังสิต-นครนายก 26 ซอย 4 (ด้านท้ายซอย) (ซอยป้าแฟง)', 'ยังไม่คืน', '9/5/2565', 'สำนักการช่าง'),
(53, '4/2/2563', 'CNTR-527/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '24,700.00', ' จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 24 ', 'ยังไม่คืน', '19/2/2565', 'สำนักการช่าง'),
(54, '6/2/2563', 'CNTR-550/63', 'บริษัท วิรุฬห์ แอนด์ เกวนเนส จำกัด', 'หนังสือค้ำประกันเลขที่ 100029997017 / 1 ปี ', '127,000.00', 'ซื้อดำเนินการโครงการติดตั้งเครื่องสูบน้ำสถานีสูบน้ำ ซอยรังสิต-ปทุมธานี 15 (ท้ายซอย)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(55, '7/2/2563', 'CNTR-559/63', 'บริษัท โตวันทรานสปอร์ต จำกัด', 'หนังสือค้ำประกันเลขที่ 02239201000024 / 2 ปี ', '221,250.00', 'จ้างก่อสร้างก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ คสล.ซอยพหลโยธิน 105 (กรุงเทพเมืองใหม่)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(56, '17/2/2563', 'CNTR-593/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,000.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก บริเวณซอยรังสิต-นครนายก 59', 'ยังไม่คืน', '4/3/2565', 'สำนักการช่าง'),
(57, '17/2/2563', 'CNTR-596/63', 'ห้างหุ้นส่วนจำกัด มัลติ ซัพพลาย อีควิปเมนท์ 1998', 'เงินสด  / 7 วัน ', '1,260.00', 'ซื้อเครื่องฉีดน้ำแรงดันสูง พร้อมอุปกรณ์ จำนวน ๑ เครื่อง', 'ยังไม่คืน', '7 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(58, '18/2/2563', 'CNTR-605/63', 'บริษัท เอ็นจินีโอ จำกัด', 'เงินสด  / 2 ปี ', '24,370.00', 'จ้างเหมาโครงการปรับปรุงระบบไฟฟ้าส่องสว่างศาลารอรถโดยสารโดยใช้พลังงานทดแทน ศาลารอรถโดยสารบริเวณหมู่บ้านสีวลี 1 ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(59, '20/2/2563', 'CNTR-628/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '7,510.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก บริเวณท้ายซอยหมู่บ้านพฤกษาวิลล์ ', 'ยังไม่คืน', '6/3/2565', 'สำนักการช่าง'),
(60, '27/2/2563', 'CNTR-672/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '8,450.00', 'จ้างเหมาโครงการปรับปรุงอาคารอเนกประสงค์ ซอยรังสิต-นครนายก ๒๖ ', 'ยังไม่คืน', '24/4/2565', 'สำนักการช่าง'),
(61, '9/3/2563', 'CNTR-739/63', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '23,830.00', 'จ้างเหมาซ่อมแซมถนนแอสฟัลติกคอนกรีต ซอยรังสิต-นครนายก 46 และ ซอยรังสิต-ปทุมธานี 29 (งานไพร์โค๊ต)', 'ยังไม่คืน', '14/3/2564', 'งานไฟฟ้าถนน'),
(62, '10/3/2563', 'CNTR-744/63', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '24,390.00', 'จ้างซ่อมเปลี่ยนสายไฟเบอร์ออฟติกภายในเขตเทศบาลนครรังสิต', 'ยังไม่คืน', '10/4/2564', 'งานไฟฟ้าถนน'),
(63, '12/3/2563', 'CNTR-757/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '24,700.00', 'จ้างเหมาติดตั้งโคมไฟฟ้าถนน หลอด LED Tube 2 x 18 วัตต์ 470 ชุด', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(64, '13/3/2563', 'CNTR-759/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '24,700.00', 'โครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 4', 'ยังไม่คืน', '31/3/2565', 'สำนักการช่าง'),
(65, '13/3/2563', 'CNTR-766/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '10,420.00', 'จ้างเหมาซ่อมแซมห้องน้ำ ทาสีเวทีกิจกรรม ทาสีเสาไฟและติดตั้งตาข่าย บริเวณสวนสาธารณะ ซอยรังสิต-ปทุมธานี 14 ซอย 11', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(66, '16/3/2563', 'CNTR-769/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '11,300.00', 'โครงการปรับปรุงฝาบ่อพัก เลียบคลองรังสิตประยูรศักดิ์ ช่วงระหว่างซอยรังสิต-นครนายก 16 ถึงซอยรังสิต-นครนายก 18', 'ยังไม่คืน', '31/3/2565', 'สำนักการช่าง'),
(67, '16/3/2563', 'CNTR-773/63', 'ห้างหุ้นส่วนจำกัด ธนยังวนิชเศรษฐ', 'เงินสด  / 2 ปี ', '92,000.00', 'โครงการก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิต-นครนายก 45 (ส่วนที่เหลือ)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(68, '17/3/2563', 'CNTR-580/63', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'หนังสือค้ำประกันเลขที่ 100029980920 / 2 ปี ', '112,000.00', 'จ้างก่อสร้างโครงการปรับปรุงบริเวณทางแยกปากซอยรังสิต-นครนายก 30 ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(69, '17/3/2563', 'CNTR-582/63', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'หนังสือค้ำประกันเลขที่ 100029987127 / 2 ปี ', '73,500.00', 'จ้างก่อสร้างก่อสร้างถนนผิวจราจรแอสฟัลท์ติกคอนกรีตถนนเลียบคลองรังสิตประยูรศักดิ์ ช่วงระหว่างถนนพหลโยธิน ถึง ซอยรังสิต-นครนายก 2', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(70, '17/3/2563', 'CNTR-775/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '24,925.00', 'จ้างเหมาซ่อมแซมฟุตบาททางเท้า บริเวณหมู่บ้านเอื้ออาทรรังสิต', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(71, '18/3/2563', 'CNTR-784/63', 'บริษัท พรวิเศษ วิศว์ จำกัด', 'เงินสด  / 4 เดือน ', '32,717.00', 'จ้างออกแบบออกแบบงานภูมิทัศน์บริเวณที่ดินเทศบาล ซอยรังสิต-นครนายก 30 (ซอยโรงสี)', 'ยังไม่คืน', '4 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(72, '20/3/2563', 'CNTR-798/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,030.00', 'จ้างซ่อมเครื่องเติมอากาศ  (๖๓๓ ๕๙ ๐๐๐๖)', 'ยังไม่คืน', '2/4/2565', 'สำนักการช่าง'),
(73, '30/3/2563', 'CNTR-847/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '24,700.00', ' จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 12 ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(74, '31/3/2563', 'CNTR-859/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 3 เดือน ', '5,590.00', 'จ้างเหมาซ่อมแซมป้ายประชาสัมพันธ์บอกเส้นทางภายในเขตเทศบาลนครรังสิต ', 'ยังไม่คืน', '8/7/2563', 'สำนักการช่าง'),
(75, '2/4/2563', 'CNTR-872/63', 'บริษัท แอดวานซ์ ดิจิตอล ซินเนอร์ยี จำกัด', 'เงินสด  / 1 ปี ', '7,360.00', 'ซ่อมแซมลานแอโรบิค', 'ยังไม่คืน', '20/5/2564', 'สำนักการช่าง'),
(76, '3/4/2563', 'CNTR-875/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '23,700.00', 'จ้างเหมาซ่อมแซมฝาบ่อพัก บริเวณซอยรังสิต-นครนายก 31', 'ยังไม่คืน', '15/4/2564', 'สำนักการช่าง'),
(77, '7/4/2563', 'CNTR-890/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '9,000.00', 'จ้างเหมาซ่อมแซมฟุตบาททางเท้า บริเวณปากซอยรังสิต-นครนายก 36', 'ยังไม่คืน', '15/4/2564', 'สำนักการช่าง'),
(78, '8/4/2563', 'CNTR-900/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '9,710.00', 'จ้างเหมาซ่อมแซมฟุตบาททางเท้า บริเวณปากซอยรังสิต-นครนายก 36', 'ยังไม่คืน', '29/4/2564', 'สำนักการช่าง'),
(79, '17/4/2563', 'CNTR-954/63', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '475', 'ซื้อครุภัณฑ์งานบ้านงานครัว (เครื่องตัดหญ้าแบบข้อแข็ง) จำนวน ๑ เครื่อง', 'ยังไม่คืน', '28/4/2564', 'สำนักการช่าง'),
(80, '17/4/2563', 'CNTR-955/63', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '3,040.00', 'ซื้อครุภัณฑ์โรงงาน (เครื่องเจีย,เครื่องตัดเหล็ก และเลื่อยวงเดือนไฟฟ้า) จำนวน ๑ งาน ', 'ยังไม่คืน', '16/5/2564', 'สำนักการช่าง'),
(81, '21/4/2563', 'CNTR-961/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '12,200.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่าง บริเวณเครื่องออกกำลังกาย ปากซอยรังสิต-นครนายก 4 ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(82, '21/4/2563', 'CNTR-964/63', 'ห้างหุ้นส่วนจำกัด เดชปภัช คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '37,000.00', 'จ้างก่อสร้างโครงการก่อสร้างบ่อพัก คสล.ปากซอยรังสิต-นครนายก 6 ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(83, '30/4/2563', 'CNTR-1021/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '7,965.00', 'จ้างเหมาซ่อมแซมพื้นคอนกรีตลานเครื่องอัดขยะมูลฝอยในสถานีขนถ่ายขยะมูลฝอย', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(84, '7/5/2563', 'CNTR-1028/63', 'ห้างหุ้นส่วนจำกัด สหผลวัฒนาโยธาการ', 'หนังสือค้ำประกันเลขที่ ค.47690297651000 / 2 ปี ', '215,000.00', 'จ้างก่อสร้างก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ คสล.ถนนเลียบคลองรังสิตประยูรศักดิ์ฝั่งใต้ ช่วงหมู่บ้านสีวลี 2 ถึงหมู่บ้านมัณฑนา 2', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(85, '13/5/2563', 'CNTR-1036/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 3 เดือน ', '12,100.00', 'จ้างเหมาซ่อมแซมระบบสปริงเกอร์รดน้ำต้นไม้สวนสาธารณะ ภายในเขตเทศบาลนครรังสิต ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(86, '18/5/2563', 'CNTR-1069/63', 'บริษัท พรประเสริฐ การโยธา จำกัด', 'หนังสือค้ำประกันเลขที่ 02237201000231 / 2 ปี ', '389,500.00', 'จ้างก่อสร้างก่อสร้างถนนคอนกรีตเสริมเหล็ก รหัสทางหลวงท้องถิ่น ปท.ถ6-0060 สายซอยรังสิต-นครนายก 42 ชุมชนคุ้มเกล้าอยู่เจริญ 2', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(87, '19/5/2563', 'CNTR-1074/63', 'บริษัท วันชัย 1992 จำกัด', 'หนังสือค้ำประกันเลขที่ 00019/201269/0019/63 / 5 ปี ', '360,000.00', 'จ้างก่อสร้างก่อสร้างถนนคอนกรีตเสริมเหล็กพร้อมวางท่อระบายน้ำคอนกรีตเสริมเหล็ก รหัสทางหลวงท้องถิ่น สายซอยรังสิต-นครนายก 56 (ช่วง 2) ชุมชนหมู่บ้านธารารินทร์ (วัดจันทรสุข)', 'ยังไม่คืน', '5 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(88, '20/5/2563', 'CNTR-1083/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '11,500.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพักเลียบคลองรังสิตประยูรศักดิ์ ช่วงระหว่าง ซอยรังสิต-นครนายก 18 ถึง ซอยรังสิต-นครนายก 22 ', 'ยังไม่คืน', '28/5/2565', 'สำนักการช่าง'),
(89, '20/5/2563', 'CNTR-1086/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 ปี ', '24,235.00', 'จ้างเหมาซ่อมแซมถนนคอนกรีตเสริมเหล็ก ซอยรังสิต-ปทุมธานี 31', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(90, '20/5/2563', 'CNTR-1087/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '14,600.00', ' จ้างเหมาโครงการปรับปรุงประตูระบายน้ำบริเวณหน้าปากซอยรังสิต-นครนายก 32 ', 'ยังไม่คืน', '20/6/2565', 'สำนักการช่าง'),
(91, '25/5/2563', 'CNTR-1097/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '17,100.00', 'จ้างติดตั้งไฟฟ้าส่องสว่างทางสาธารณะบริเวณซอยรังสิต-นครนายก 28', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(92, '25/5/2563', 'CNTR-1098/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,400.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-ปทุมธานี 17 ช่วงกลางซอย (ช่วง 1)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(93, '11/6/2563', 'CNTR-1164/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,300.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพักช่วงหมู่บ้านลุมพินีถึงปากซอยรังสิต-นครนายก 26 ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(94, '22/6/2563', 'CNTR-1182/63', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', 'เงินสด  / 3 เดือน ', '7,000.00', 'จ้างซ่อมรถแบคโฮ ตค ๖๕', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(95, '1/7/2563', 'CNTR-1228/63', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '9,600.00', 'จ้างซ่อมรถดูดสิ่งปฏิกูล ทะเบียน ๘๒-๐๗๗๕ (๐๐๙ ๔๘ ๐๐๐๒) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(96, '1/7/2563', 'CNTR-1230/63', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '8,300.00', 'จ้างซ่อมรถดูดสิ่งปฏิกูล ทะเบียน 82-0776', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(97, '8/7/2563', 'CNTR-1246/63', 'ห้างหุ้นส่วนจำกัด เอทีเอส ซัพพลาย', 'เงินสด  / 1 ปี ', '33,438.00', 'ซื้อครุภัณฑ์ไฟฟ้า (โคมไฟฟ้าถนน) ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(98, '10/7/2563', 'CNTR-1261/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '23,510.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่าง บริเวณสวนสาธารณะ ซอยรังสิต-ปทุมธานี 14 ซอย 16', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(99, '13/7/2563', 'CNTR-1266/63', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', 'เงินสด  / 3 เดือน ', '7,900.00', 'จ้างซ่อมตู้บรรทุกขยะ เบอร์๘ (๐๒๘ ๕๑ ๐๐๑๑) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(100, '17/7/2563', 'CNTR-1294/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '23,600.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 6 ช่วง 3 ท้ายซอย', 'ยังไม่คืน', '1/8/2565', 'สำนักการช่าง'),
(101, '21/7/2563', 'CNTR-1317/63', 'นางสาวนภาพรรณ กลิ่นเกลี้ยง', 'เงินสด  / 15 วัน ', '9,580.00', 'จ้างเหมาลอกท่อระบายน้ำภายในเขตเทศบาลนครรังสิต', 'ยังไม่คืน', '15 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(102, '29/7/2563', 'CNTR-1339/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '13,100.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าจุดตัดแยกสะพานข้ามคลองหน้าหมู่บ้านฟ้าลากูล ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(103, '3/8/2563', 'CNTR-1360/63', 'ห้างหุ้นส่วนจำกัด เกรียงไกร เทคนิค', 'เงินสด  / 3 เดือน ', '9,000.00', 'จ้างซ่อมรถยนต์ทะเบียน ๘๒-๓๒๕๔ (เลขครุภัณฑ์ ๐๖-๕๐-๐๐๐๑) จำนวน ๑ งาน', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(104, '4/8/2563', 'CNTR-1370/63', 'บริษัท ธนกุลดีไซน์ แอนด์ เดคคอร์ จำกัด', 'หนังสือค้ำประกันเลขที่ 02120201000147 / 2 ปี ', '24,300.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่างทางแยกท้ายซอยรังสิต-ปทุมธานี 15', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(105, '21/8/2563', 'CNTR-1452/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '22,210.00', 'จ้างซ่อมรถตักหน้า-ขุดหลัง JCB ทะเบียน ต-๐๓๔๖ ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(106, '25/8/2563', 'CNTR-1482/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 3 เดือน ', '6,120.00', 'จ้างเหมาซ่อมแซมประตูระบายน้ำบริเวณหน้าปากซอยรังสิต-นครนายก 38 ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(107, '28/8/2563', 'CNTR-1494/63', 'บริษัท วิรุฬห์ แอนด์ เกวนเนส จำกัด', 'หนังสือค้ำประกันเลขที่ 100033706140 / 3 เดือน ', '16,237.25', 'จ้างซ่อมเครื่องสูบน้ำ เลขครุภัณฑ์ ๐๕๕ ๖๑ ๐๔๔๕', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(108, '28/8/2563', 'CNTR-1495/63', 'บริษัท วิรุฬห์ แอนด์ เกวนเนส จำกัด', 'หนังสือค้ำประกันเลขที่ 100033706078 / 3 เดือน ', '24,631.40', 'จ้างซ่อมเครื่องสูบน้ำ (๐๕๕ ๕๗ ๐๓๖๗) ,ตู้ควบคุมเครื่องสูบน้ำ (๒๐๒ ๕๗ ๐๐๐๖) และเครื่องเก็บขยะอัติโนมัติ (๖๓๕ ๕๗ ๐๐๐๓) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(109, '31/8/2563', 'CNTR-1510/63', 'ห้างหุ้นส่วนจำกัด พี.ที.สถาปัตย์', 'หนังสือค้ำประกันเลขที่ 00019/200460/0045/63 / 2 ปี ', '247,500.00', 'จ้างก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ คสล.ซอยรังสิต-นครนายก 56 ซอย 2 (หมู่บ้านธารารินทร์)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(110, '31/8/2563', 'CNTR-1512/63', 'บริษัท พรประเสริฐ การโยธา จำกัด', 'หนังสือค้ำประกันเลขที่ 02237201000398 / 2 ปี ', '97,500.00', 'จ้างก่อสร้างโครงการก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ คสล.ซอยรังสิต-นครนายก 57 (ซอยเจ้าจอม)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(111, '2/9/2563', 'CNTR-1535/63', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '5,000.00', ' ซื้อครุภัณฑ์สำรวจ เครื่องหาพิกัดด้วยสัญญาณดาวเทียมแบบพกพา', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(112, '3/9/2563', 'CNTR-1552/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '13,800.00', 'จ้างเหมาโครงการก่อสร้างขยายผิวจราจรถนนเลียบคลองรังสิตประยูรศักดิ์ ปากซอยรังสิต-นครนายก 56', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(113, '14/9/2563', 'CNTR-1568/63', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 3 เดือน ', '23,350.00', 'จ้างเหมาซ่อมแซมถนนแอสฟัลติกคอนกรีต สะพาน ในความรับผิดชอบของเทศบาลนครรังสิต', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(114, '15/9/2563', 'CNTR-1584/63', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '10,000.00', 'ซื้อครุภัณฑ์ก่อสร้าง รถดั้มเปอร์โม่ปูน ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(115, '16/9/2563', 'CNTR-1168/63', 'บริษัท อาควา นิชิฮาร่า คอร์ปอเรชั่น จำกัด', 'หนังสือค้ำประกันเลขที่ 02194201000165 / 1 ปี ', '22,470.00', 'ซ่อมระบบบำบัดน้ำเสีย จำนวน 1 งาน', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(116, '16/9/2563', 'CNTR-1600/63', 'ห้างหุ้นส่วนจำกัดอมรเทพ วิศวกรรม', 'เงินสด ', '14,300.00', 'จ้างเหมาเอกชนกำจัดขยะมูลฝอยภายในเขตเทศบาลนครรังสิต ตั้งแต่วันที่ 17-30 กันยายน 2563 ', 'ยังไม่คืน', '2/10/2563', 'สำนักการช่าง'),
(117, '17/9/2563', 'CNTR-1604/63', 'ห้างหุ้นส่วนจำกัดอมรเทพ วิศวกรรม', 'เงินสด ', '393,250.00', 'จ้างจ้างเหมาเอกชนกำจัดขยะมูลฝอยในเขตเทศบาล', 'ยังไม่คืน', '1/10/2564', 'สำนักการช่าง'),
(118, '17/9/2563', 'CNTR-1612/63', 'บริษัท เฮอร์ริเทจ อินเตอร์เนชั่ลแนล โพร์วายเดอร์ จำกัด', 'เงินสด  / 1 ปี ', '1,000.00', 'ซื้อครุภัณฑ์สำนักงาน (ตู้ไม้เข้าผนัง)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(119, '17/9/2563', 'CNTR-1613/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '19,000.00', 'จ้างเหมาก่อสร้างเวทีผู้นำออกกำลังกาย พร้อมติดตั้ง   ให้แก่กองการศึกษา', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(120, '21/9/2563', 'CNTR-1625/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '24,640.00', 'จ้างเหมาติดตั้งโคมไฟถนน หลอด LED Tube 2 x 18 วัตต์', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(121, '22/9/2563', 'CNTR-1631/63', 'ห้างหุ้นส่วนจำกัด ราไชศวรรย์', 'หนังสือค้ำประกันเลขที่ 02071201000118 / 2 ปี ', '82,000.00', 'โครงการปรับปรุงสะพานโรงเรียนทองพูนอุทิศ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(122, '22/9/2563', 'CNTR-1638/63', 'นางสาวนภาพรรณ กลิ่นเกลี้ยง', 'เงินสด  / 15 วัน ', '20,340.00', 'จ้างเหมาปรับปรุงภูมิทัศน์ บริเวณเกาะกลางถนนริมเขื่อนโรงเรียนประชาธิปัตย์ ', 'ยังไม่คืน', '15 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(123, '22/9/2563', 'CNTR-1643/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 3 เดือน ', '23,450.00', 'จ้างเหมาซ่อมแซมลานวางตู้คอนเทนเนอร์และรางระบายน้ำสถานีขนถ่ายขยะมูลฝอย', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(124, '23/9/2563', 'CNTR-1645/63', 'บริษัท พี ซี คอนกรีตปทุมธานี จำกัด', 'หนังสือค้ำประกันเลขที่ ค.47690308443000 / 2 ปี ', '24,100.00', 'จ้างเหมาซ่อมแซมลานวางตู้คอนเทนเนอร์และรางระบายน้ำสถานีขนถ่ายขยะมูลฝอย', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(125, '23/9/2563', 'CNTR-1647/63', 'ห้างหุ้นส่วนจำกัด สหผลวัฒนาโยธาการ', 'หนังสือค้ำประกันเลขที่ ค.47690308445000 / 2 ปี ', '24,000.00', 'จ้างเหมาโครงการปรับปรุงระบบจราจร บริเวณซอยรังสิต-นครนายก 46 (ถนนเสมา-ฟ้าคราม) ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(126, '23/9/2563', 'CNTR-1649/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 3 เดือน ', '6,100.00', 'จ้างซ่อมแซมอาคารหอประชุม ๑๐๐ ปี เมืองธัญญบูรี จำนวน ๑ งาน', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(127, '24/9/2563', 'CNTR-1651/63', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,345.00', 'จ้างเหมาซ่อมแซมฝาบ่อพัก บริเวณซอยรังสิต-นครนายก 59 (ช่วงที่ 2 กลางซอย)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(128, '24/9/2563', 'CNTR-1655/63', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '5,000.00', 'ซื้อปั๊มชักมอเตอร์ไฟฟ้า', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'งานไฟฟ้าถนน'),
(129, '25/9/2563', 'CNTR-1658/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 3 เดือน ', '24,350.00', 'จ้างเหมาซ่อมแซมทางเดินเท้าแบบอิฐตัวหนอน บริเวณริมถนนรังสิต-นครนายก (ฝั่งเหนือ)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(130, '25/9/2563', 'CNTR-1663/63', 'กิจการร่วมค้า เอส.เอ็ม.ซี.', 'หนังสือค้ำประกันเลขที่ 800351053896 / 2 ปี ', '127,232.00', 'างก่อสร้างรั้ว คสล. ศูนย์พึ่งพิงสุนัขจรจัดคลองสิบสอง (ตั้งจ่ายรายการใหม่ 2561)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(131, '29/9/2563', 'CNTR-1688/63', 'บริษัท รักษาความปลอดภัย พิทักษ์ชน การ์ด เซอร์วิส จำกัด', 'เงินสด  / 15 วัน ', '52,002.00', 'จ้างเหมารักษาความปลอดภัยสถานีขนถ่ายขยะมูลฝอย ฝั่งตะวันออก (ซอยรังสิต-นครนายก 17)', 'ยังไม่คืน', '15 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(132, '29/9/2563', 'CNTR-1689/63', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 15 วัน ', '142,500.00', 'จ้างเหมาดูแลบำรุงรักษาต้นไม้และสวนหย่อมภายในเขตเทศบาล', 'ยังไม่คืน', '15 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(133, '29/9/2563', 'CNTR-1690/63', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยาการโยธา', 'หนังสือค้ำประกันเลขที่ 100034236024 / 2 ปี ', '242,500.00', 'จ้างก่อสร้างปรับปรุงผิวจราจรพาราแอสฟัลท์ติกคอนกรีต ซอยรังสิต-นครนายก 58', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(134, '30/9/2563', 'CNTR-1691/63', 'บริษัท เมืองสะอาด จำกัด', 'หนังสือค้ำประกันเลขที่ ค.47690309110000', '5,894,933.00', 'จ้างเอกชนจัดเก็บขยะมูลฝอยในเขตเทศบาลนครรังสิต ปีงบประมาณ พ.ศ.2564-2568', 'ยังไม่คืน', '1/10/2568', 'สำนักการช่าง'),
(135, '7/12/2563', 'CNTR-1693/63', 'บริษัท รักษาความปลอดภัย เอ็ม.วาย.เซอร์วิส จำกัด', 'หนังสือค้ำประกันเลขที่ 02192201000592 / 15 วัน ', '36,000.00', 'จ้างเหมารักษาความปลอดภัยอาคารโรงเก็บพัสดุ หลังวัดจันทรสุข (ซอยรังสิต-นครนายก 56)', 'ยังไม่คืน', '15 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(136, '7/10/2563', 'CNTR-24/64', 'นางศิริทิพย์  จันทร์เพ็ญ', 'เงินสด ', '5,087.00', 'จ้างเหมาดูแลสวนเฉลิมพระเกียรติภักดีราชา ซอยรังสิต-นครนายก 45', 'ยังไม่คืน', '2/10/2564', 'สำนักการช่าง'),
(137, '21/10/2563', 'CNTR-56/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 3 เดือน ', '18,731.00', 'จ้างเหมาซ่อมแซมเครื่องออกกำลังกายและเครื่องเล่นสนาม', 'ยังไม่คืน', '3/2/2564', 'สำนักการช่าง'),
(138, '26/10/2563', 'CNTR-71/64', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '10,465.00', 'จ้างซ่อมรถแบคโฮ ทะเบียน ตค ๖๕', 'ยังไม่คืน', '16/9/2564', 'สำนักการช่าง'),
(139, '29/10/2563', 'CNTR-95/64', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '7,656.00', 'จ้างเหมาซ่อมแซมเครื่องอัดขยะมูลฝอย ๒ เครื่อง (เลขครุภัณฑ์ ๓๒๙ ๕๑ ๐๐๐๑ และ ๓๒๙ ๕๔ ๐๐๐๒)', 'ยังไม่คืน', '15 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(140, '18/11/2563', 'CNTR-183/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '17,980.00', ' จ้างซ่อมเครื่องอัดขยะมูลฝอยเครื่องที่๒ (๓๒๙ ๕๔ ๐๐๐๒)', 'ยังไม่คืน', '24/2/2564', 'สำนักการช่าง'),
(141, '18/11/2563', 'CNTR-184/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '6,030.00', 'จ้างซ่อมแซมรถแบคโฮ ตค ๒๑๗', 'ยังไม่คืน', '28/2/2564', 'สำนักการช่าง'),
(142, '18/11/2563', 'CNTR-185/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '6,560.00', 'จ้างซ่อมรถแบคโฮ ทะเบียน ตค ๒๑๖', 'ยังไม่คืน', '18/12/2563', 'สำนักการช่าง'),
(143, '25/11/2563', 'CNTR-200/64', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 15 วัน ', '21,030.00', 'จ้างเหมาลอกลำรางสาธารณะ บริเวณหลังหมู่บ้านณัฐวรรณ', 'ยังไม่คืน', '3/3/2564', 'สำนักการช่าง'),
(144, '27/11/2563', 'CNTR-215/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '13,655.00', ' จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์ ๒ (๐๒๘ ๕๑ ๐๐๐๖) และเบอร์ ๔ (๐๒๘ ๕๑ ๐๐๐๘)', 'ยังไม่คืน', '8/12/2564', 'สำนักการช่าง'),
(145, '27/11/2563', 'CNTR-216/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '10,481.00', 'จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์ ๑๑ (๐๒๘ ๕๔ ๐๐๑๕)', 'ยังไม่คืน', '8/3/2564', 'สำนักการช่าง'),
(146, '27/11/2563', 'CNTR-219/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '23,800.00', 'จ้างซ่อมแซมฝาบ่อพัก บริเวณปากซอยรังสิต-นครนายก 31', 'ยังไม่คืน', '5/3/2564', 'สำนักการช่าง'),
(147, '27/11/2563', 'CNTR-223/64', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '13,429.00', 'จ้างซ่อมรถบรรทุก ๑๐ ล้อ ทะเบียน ๘๑-๖๘๒๒', 'ยังไม่คืน', '15/3/2564', 'สำนักการช่าง'),
(148, '27/11/2563', 'CNTR-225/64', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '8,132.00', 'จ้างซ่อมรถดูดโคลนเลน ทะเบียน บง-๒๔๗', 'ยังไม่คืน', '10/3/2564', 'สำนักการช่าง'),
(149, '30/11/2563', 'CNTR-231/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '24,645.00', 'ซื้อครุภัณฑ์อื่น (เวทีกิจกรรม แบบถอดประกอบได้ ขนาด 6.00 x 10.00 x 8.00 เมตร จำนวน 1 ชุด) ', 'ยังไม่คืน', '8/3/2564', 'สำนักการช่าง'),
(150, '30/11/2563', 'CNTR-233/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '22,500.00', 'จ้างเหมาซ่อมแซมฝาบ่อพัก บริเวณปากซอยรังสิต-นครนายก 6 จำนวน 10 บ่อพัก', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(151, '3/12/2563', 'CNTR-251/64', 'บริษัทเคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '8,650.00', 'จ้างซ่อมรถขยะคอนเทนเนอร์ ๖ ล้อ ทะเบียน บ-๓๘๓๐ (เลขครุภัณฑ์ ๐๑๑ ๓๘ ๐๐๑๕)', 'ยังไม่คืน', '15/3/2564', 'สำนักการช่าง'),
(152, '3/12/2563', 'CNTR-252/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '6,610.00', 'จ้างซ่อมรถแบคโฮ ทะเบียน ตค-๖๕ (เลขครุภัณฑ์ ๐๑๘ ๔๒ ๐๐๐๔)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(153, '3/12/2563', 'CNTR-253/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '8,944.00', 'จ้างซ่อมรถตักหน้าขุดหลัง JCB ทะเบียน ต-๐๓๔๖ (เลขครุภัณฑ์ ๐๑๘ ๓๗ ๐๐๐๒) ', 'ยังไม่คืน', '15/12/2564', 'สำนักการช่าง'),
(154, '4/12/2563', 'CNTR-271/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '20,923.00', 'จ้างซ่อมตู้บรรทุกขยะ ๒ ตู้เบอร์ ๑๙ (๐๒๘ ๕๔ ๐๐๒๓)และเบอร์ ๒๐ (๐๒๘ ๕๔ ๐๐๒๔)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(155, '4/12/2563', 'CNTR-272/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '15,213.00', 'จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์ ๖ (๐๒๘ ๕๑ ๐๐๑๐) ', 'ยังไม่คืน', '22/3/2564', 'สำนักการช่าง'),
(156, '7/12/2563', 'CNTR-280/64', 'กิจการร่วมค้า เอส.เอ็ม.ซี.', 'หนังสือค้ำประกันเลขที่ 800353554268 / 2 ปี ', '130,633.00', 'จ้างก่อสร้างรั้ว คสล. ศูนย์พึ่งพิงสุนัขจรดจัดคลองสิบสอง (งบประมาณรายจ่ายประจำปี 2562)', 'ยังไม่คืน', '18/3/2564', 'สำนักการช่าง'),
(157, '7/12/2563', 'CNTR-281/64', 'บริษัท วันชัย 1992 จำกัด', 'หนังสือค้ำประกันเลขที่ 00019/201036/0010/63 / 2 ปี ', '177,500.00', 'จ้างก่อสร้างก่อสร้างวางท่อระบายน้ำ คสล.ซอยรังสิต-นครนายก 27 ซอย 3', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(158, '8/12/2563', 'CNTR-284/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '18,910.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่างทางสาธารณะ บริเวณสะพานศาลเจ้าคลองหนึ่ง', 'ยังไม่คืน', '26/12/2564', 'สำนักการช่าง'),
(159, '9/12/2563', 'CNTR-291/64', 'บริษัท พี.เจ.แอนด์ แอล. ก่อสร้าง จำกัด', 'หนังสือค้ำประกันเลขที่ 100034120506 / 2 ปี ', '1,000,000.00', 'จ้างก่อสร้างซ่อมแซมสะพานไม้ข้ามคลองบริเวณคลองรังสิตประยูรศักดิ์ (โรงเรียนศิริศึกษา)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(160, '14/12/2563', 'CNTR-304/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 1 ปี ', '4,200.00', 'ซื้อครุภัณฑ์โรงงาน (ถังเติมน้ำมันเกียร์ จำนวน 2 เครื่อง และ ถังอัดจารบี จำนวน 1 เครื่อง)', 'ยังไม่คืน', '29/3/2564', 'สำนักการช่าง'),
(161, '15/12/2563', 'CNTR-307/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,100.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่างทางสาธารณะ บริเวณซอยรังสิต-ปทุมธานี 27 ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(162, '16/12/2563', 'CNTR-320/64', 'บริษัท เฮอร์ริเทจ อินเตอร์เนชั่ลแนล โพร์วายเดอร์ จำกัด', 'เงินสด  / 1 ปี ', '525', 'จ้างซ่อมเครื่องสูบน้ำ ๕ เครื่อง ', 'ยังไม่คืน', '1 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(163, '21/12/2563', 'CNTR-334/64', 'บริษัท โอลี่ กรุ๊ป จำกัด', 'หนังสือค้ำประกันเลขที่ 00019/200130/0069/63 / 1 ปี ', '24,900.00', 'จ้างเหมาซ่อมแซมสะพานเฉลิมพระเกียรติ หน้าหมู่บ้านรัตนโกสินทร์ 200', 'ยังไม่คืน', '30/12/2564', 'สำนักการช่าง'),
(164, '23/12/2563', 'CNTR-343/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 1 ปี ', '22,900.00', 'ซื้อครุภัณฑ์สนาม (ชุดหลังคาทรงโค้ง และผ้าใบเต็นท์)', 'ยังไม่คืน', '15 วัน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(165, '25/12/2563', 'CNTR-358/64', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 1 เดือน ', '21,172.00', 'จ้างเหมาปลูกต้นพุทธรักษา พร้อมดูแล บริเวณริมคลองรังสิตประยูรศักดิ์ (ฝั่งใต้) ช่วงสะพานหน้าหมู่บ้านเปรมปรีดิ์ ถึง สะพานหน้าหมู่บ้านธงชัย', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(166, '25/12/2563', 'CNTR-360/64', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 15 วัน ', '18,750.00', 'จ้างเหมาลอกลำรางสาธารณะ บริเวณซอยรังสิต-นครนายก 27', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(167, '25/12/2563', 'CNTR-363/64', 'ห้างหุ้นส่วนจำกัด ศรีอยุธยา การโยธา', 'หนังสือค้ำประกันเลขที่ ค.47690315831000 / 2 ปี ', '241,000.00', 'จ้างก่อสร้างยกระดับผิวจราจร คสล.ซอยรังสิต-นครนายก 24 (ด้านท้ายซอย) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(168, '7/1/2564', 'CNTR-394/64', 'บริษัท แพลนนิ่ง แอนด์ รีเสิร์ช คอนซัลแทนต์ จำกัด', 'หนังสือค้ำประกันเลขที่ 100036058980', '49,500.00', 'จ้างออกแบบออกแบบการจราจรและการระบายน้ำฯช่วงระหว่างซอยรังสิต-นครนายก 27 ถึง ซอยรังสิต-นครนายก 31', 'ยังไม่คืน', '20/3/2565', 'สำนักการช่าง'),
(169, '8/1/2564', 'CNTR-401/64', 'ห้างหุ้นส่วนจำกัด ปทุมธานีวัสดุภัณฑ์', 'เงินสด  / 1 ปี ', '18,750.00', 'ซื้อครุภัณฑ์ไฟฟ้าและวิทยุ (โคมไฟฟ้าสนาม LED ขนาด 400 W จำนวน 50 ชุด) ', 'ยังไม่คืน', '6/4/2565', 'สำนักการช่าง'),
(170, '8/1/2564', 'CNTR-402/64', 'ห้างหุ้นส่วนจำกัด ปทุมธานีวัสดุภัณฑ์', 'เงินสด  / 1 ปี ', '3,250.00', 'ซื้อครุภัณฑ์สำนักงาน (เก้าอี้โครงเหล็กบุนวม พร้อมสกรีนหลัง เทศบาลนครรังสิต จำนวน 100 ตัว)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(171, '8/1/2564', 'CNTR-404/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '21,400.00', ' จ้างซ่อมรถยนต์และเครื่องสูบน้ำ (๐๕๕ ๕๓ ๐๒๒๔,๘๒-๓๒๕๒,ถข ๑,๘๑-๖๒๙๗,๘๒-๓๒๕๕,บท ๔๕๘๑,บต-๓๘๔๗)', 'ยังไม่คืน', '11/2/2565', 'สำนักการช่าง'),
(172, '11/1/2564', 'CNTR-415/64', 'บริษัท โตโยต้าเภตรา จำกัด', 'เช็คเลขที่ 17256598 / 1 ปี ', '68,200.00', 'ซื้อครุภัณฑ์ยานพาหนะและขนส่ง รถโดยสารขนาด 12 ที่นั่ง (ดีเซล) จำนวน 1 คัน (สำนักการช่าง)', 'ยังไม่คืน', '14/1/2565', 'สำนักการช่าง'),
(173, '12/1/2564', 'CNTR-419/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '23,330.00', 'จ้างเหมาโครงการติดตั้งระบบสปริงเกอร์รดน้ำต้นไม้ บริเวณเกาะกลางถนน บริเวณซอยพหลโยธิน 127 ', 'ยังไม่คืน', '26/2/2565', 'สำนักการช่าง'),
(174, '13/1/2564', 'CNTR-436/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '23,850.00', 'โครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-ปทุมธานี 24 ช่วงที่ 2 กลางซอย', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(175, '14/1/2564', 'CNTR-441/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '7,070.00', 'จ้างเหมาโครงการติดตั้งตู้ควบคุมไฟสวนสาธารณะ ซอยรังสิต-ปทุมธานี 14 ซอย 11', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(176, '15/1/2564', 'CNTR-454/64', 'บริษัท พัชรี เฮฟวี่ แมชชีนเนอรี่ จำกัด', 'หนังสือค้ำประกันเลขที่ 02256211000001 / 1 ปี ', '169,950.00', 'ซื้อครุภัณฑ์ก่อสร้าง (จัดซื้อรถตักหน้าขุดหลัง แบบขับเคลื่อนสี่ล้อ จำนวน 1 คัน) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(177, '15/1/2564', 'CNTR-455/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '6,265.00', 'จ้างซ่อมรถดูดสิ่งปฏิกูล ทะเบียน 82-0775', 'ยังไม่คืน', '3/2/2566', 'สำนักการช่าง'),
(178, '15/1/2564', 'CNTR-457/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '18,600.00', 'จ้างเหมาโครงการติดตั้งตู้ควบคุมการเปิด-ปิดไฟทางอัตโนมัติ บริเวณชุมชนในเขตเทศบาลนครรังสิต (จำนวน 16 จุด)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(179, '15/1/2564', 'CNTR-460/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '23,900.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 12 ช่วงกลางซอย ', 'ยังไม่คืน', '19/2/2565', 'สำนักการช่าง'),
(180, '18/1/2564', 'CNTR-467/64', 'บริษัท ดับบลิวอีสิบเก้าเอ็นจิเนียริ่ง จำกัด', 'หนังสือค้ำประกันเลขที่ 100036170977 / 2 ปี ', '188,500.00', 'จ้างก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ คสล.ซอยรังสิต-ปทุมธานี 10 ซอย 12 ', 'ยังไม่คืน', '10/2/2565', 'สำนักการช่าง'),
(181, '18/1/2564', 'CNTR-473/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,700.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 67', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(182, '19/1/2564', 'CNTR-477/64', 'บริษัท แสงชัย ไลท์ติ้ง จำกัด', 'เงินสด  / 1 ปี ', '67,500.00', 'ซื้อครุภัณฑ์ไฟฟ้าและวิทยุ (โคมไฟฟ้าถนน)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(183, '20/1/2564', 'CNTR-483/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,500.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 26', 'ยังไม่คืน', '26/2/2565', 'สำนักการช่าง'),
(184, '20/1/2564', 'CNTR-498/64', 'บริษัท วันชัย 1992 จำกัด', 'หนังสือค้ำประกันเลขที่ 00019/201036/0003/64 / 2 ปี ', '280,000.00', 'จ้างก่อสร้างก่อสร้างขยายผิวจราจรบริเวณปากซอยรังสิต-นครนายก 31 ', 'ยังไม่คืน', '2/2/2565', 'สำนักการช่าง'),
(185, '22/1/2564', 'CNTR-508/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,500.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-ปทุมธานี 17 (ช่วง 2)', 'ยังไม่คืน', '30/4/2564', 'สำนักการช่าง'),
(186, '26/1/2564', 'CNTR-527/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '12,500.00', 'จ้างซ่อมรถ ๒ คัน (ทะเบียน ๘๑-๗๒๘๑ และ บฉ-๖๙๔๐)', 'ยังไม่คืน', '12/2/2565', 'สำนักการช่าง'),
(187, '27/1/2564', 'CNTR-533/64', 'บริษัท ส.สิงห์อยู่ สปอร์ต จำกัด', 'เงินสด  / 1 ปี ', '24,980.00', 'ซื้อครุภัณฑ์กีฬา (เครื่องออกกำลังกายกลางแจ้งสแตนเลส พร้อมติดตั้ง) ', 'ยังไม่คืน', '19/3/2565', 'สำนักการช่าง'),
(188, '28/1/2564', 'CNTR-539/64', 'บริษัท น่ำเฮงพรชัย จำกัด', 'เงินสด  / 1 ปี ', '9,630.00', 'ซื้อครุภัณฑ์โรงงาน (เครื่องผสมปุ๋ยแบบแนวนอนติดมอเตอร์10แรง) สำนักการช่าง', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(189, '28/1/2564', 'CNTR-542/64', 'บริษัท เก้า-ห้า โปร จำกัด', 'เงินสด  / 1 ปี ', '2,600.00', 'ซื้อครุภัณฑ์สำนักงาน (ถังน้ำพลาสติก ขนาด 3,000 ลิตร จำนวน 4 ใบ)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(190, '29/1/2564', 'CNTR-547/64', 'บริษัท เรเซอร์การไฟฟ้า (ประเทศไทย) จำกัด', 'หนังสือค้ำประกันเลขที่ ค.47690320409000 / 1 ปี ', '24,075.00', 'ซื้อครุภัณฑ์ไฟฟ้าและวิทยุ (โคมไฟฟ้าถนน LED)', 'ยังไม่คืน', '26/3/2565', 'สำนักการช่าง'),
(191, '29/1/2564', 'CNTR-551/64', 'บริษัท นาราธร 14 คอร์ปอเรชั่น จำกัด', 'เงินสด ', '11,250.00', 'ออกแบบสวนสาธารณะชุมชนวรุณพร', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(192, '1/2/2564', 'CNTR-565/64', 'บริษัท บราโว คิดส์ จำกัด', 'หนังสือค้ำประกันเลขที่ 233821000055 / 1 ปี ', '24,750.00', 'ซื้อเครื่องเล่นสนามกลางแจ้ง', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(193, '2/2/2564', 'CNTR-582/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 3 เดือน ', '5,300.00', 'จ้างก่อสร้างก่อสร้างถนนผิวจราจรแอสฟัลท์ติกคอนกรีตถนนเลียบคลองรังสิตประยูรศักดิ์ ช่วงระหว่างถนนพหลโยธิน ถึง ซอยรังสิต-นครนายก 2 ', 'ยังไม่คืน', '19/2/2565', 'สำนักการช่าง'),
(194, '2/2/2564', 'CNTR-583/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 3 เดือน ', '21,400.00', ' จ้างเหมาซ่อมแซมเครื่องออกกำลังกาย ภายในเขตเทศบาลนครรังสิต', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(195, '3/2/2564', 'CNTR-592/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '19,784.00', 'จ้างซ่อมรถ ๓ คันทะเบียน บ-๓๘๓๐, ตค-๖๕ และ ตค-๑๔๕', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(196, '3/2/2564', 'CNTR-593/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '6,530.00', 'จ้างซ่อมรถยนต์ ๒ คันทะเบียน ตค-๒ (๐๑๙ ๔๐ ๐๐๐๓) และทะเบียน ตค-๑๒๗ (๐๑๘ ๔๖ ๐๐๕) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(197, '3/2/2564', 'CNTR-594/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '18,846.00', ' จ้างซ่อมรถแมคโคร ทะเบียน ต-๐๓๔๕ (เลขครุภัณฑ์ ๐๑๙ ๓๗ ๐๐๐๑)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(198, '3/2/2564', 'CNTR-595/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '6,802.00', 'จ้างซ่อมแซมรถแบคโฮ ทะเบียน ตค-๖๕ (เลขครุภัณฑ์ ๐๑๘ ๔๒ ๐๐๐๔)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(199, '3/2/2564', 'CNTR-597/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '7,100.00', ' จ้างซ่อมรถบรรทุก ๑๐ ล้อ ทะเบียน ๘๑-๖๘๒๓ (เลขครุภัณฑ์ ๐๑๓ ๔๔ ๐๐๐๘) ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(200, '4/2/2564', 'CNTR-607/64', 'ห้างหุ้นส่วนจำกัด ผดุง เอ็นจิเนียริ่ง แอนด์ คอนสตรัคชั่น', 'เงินสด  / 2 ปี ', '16,830.00', 'จ้างเหมาโครงการปรับปรุงประตูระบายน้ำ บริเวณหน้าหมู่บ้านชวนชื่น ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(201, '4/2/2564', 'CNTR-608/64', 'บริษัท พรวิเศษ วิศว์ จำกัด', 'เงินสด ', '17,500.00', 'จ้างออกแบบออกแบบปรับปรุงสะพานคอนกรีตเสริมเหล็ก ข้ามคลองรังสิตประยูรศักดิ์ (บริเวณทางเข้าหมู่บ้านชมฟ้า-วรางกูล) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(202, '5/2/2564', 'CNTR-610/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '22,900.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก บริเวณซอยรังสิต-นครนายก 33 ซอย 1', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(203, '5/2/2564', 'CNTR-611/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '8,152.00', 'จ้างซ่อมรถแมคโคร ทะเบียน ตค-๕๐ เลขครุภัณฑ์ ๐๑๘ ๔๑ ๐๐๐๓ ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(204, '8/2/2564', 'CNTR-617/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '6,140.00', 'จ้างซ่อมรถดูดสิ่งปฏิกูล ทะเบียน 82-0775 ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(205, '8/2/2564', 'CNTR-618/64', 'ห้างหุ้นส่วนจำกัด สหผลวัฒนาโยธาการ', 'หนังสือค้ำประกันเลขที่ ค.47690321401000 / 2 ปี ', '24,750.00', 'จ้างเหมาโครงการปรับปรุงผิวจราจรบริเวณถนนซอยรังสิต-นครนายก 2 (ช่วงตั้งแต่ปากซอยถึงท้ายซอยข้างวัดคลองหนึ่ง)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(206, '8/2/2564', 'CNTR-621/64', 'ห้างหุ้นส่วนจำกัด สหผลวัฒนาโยธาการ', 'หนังสือค้ำประกันเลขที่ ค.47690321399000 / 2 ปี ', '17,650.00', 'จ้างเหมาโครงการปรับปรุงระบบจราจรบริเวณถนนซอยรังสิต-นครนายก 56 (ซอยวัดจันทรสุข) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(207, '8/2/2564', 'CNTR-623/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '10,620.00', ' จ้างซ่อมรถยนต์ จำนวน ๒ คัน ทะเบียน ตค-๑๓๔ และทะเบียน ๘๑-๗๒๘๑ ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(208, '10/2/2564', 'CNTR-638/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '10,484.00', 'จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์๘ (๐๒๘ ๕๑ ๐๐๑๒)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(209, '10/2/2564', 'CNTR-639/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '18,434.00', 'จ้างซ่อมแซมตู้บรรทุกขยะเบอร์ ๑๓ (๐๒๘ ๕๔ ๐๐๑๗)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง');
INSERT INTO `tbl_treasury` (`id`, `regis_date`, `contract_no`, `contractor`, `garanty_type`, `cost_budget`, `project_name`, `status`, `garanty_end`, `owner`) VALUES
(210, '11/2/2564', 'CNTR-641/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '23,800.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 67 ช่วงที่ 1', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(211, '11/2/2564', 'CNTR-645/64', 'บริษัท ดับบลิวอีสิบเก้าเอ็นจิเนียริ่ง จำกัด', 'หนังสือค้ำประกันเลขที่ 100036671666 / 2 ปี ', '87,850.00', 'จ้างก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ คสล.ซอยรังสิต-ปทุมธานี 11 (ต่อจากโครงการเดิม) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(212, '15/2/2564', 'CNTR-649/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '8,500.00', 'จ้างซ่อมรถขยะคอนเทนเนอร์ ๖ ล้อ ทะเบียน บ-๓๘๓๐', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(213, '16/2/2564', 'CNTR-659/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '23,900.00', ' จ้างเหมาโครงการปรับปรุงฝาบ่อ ซอยรังสิต-นครนายก 4 ช่วงที่ 2 กลางซอย ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(214, '16/2/2564', 'CNTR-661/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '7,500.00', 'จ้างซ่อมแซมรถดูดโคลนเลน ทะเบียน ๘๓-๑๓๐๖ (เลขครุภัณฑ์ ๐๓๕ ๐๙ ๐๐๐๓)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(215, '16/2/2564', 'CNTR-662/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '12,500.00', 'จ้างซ่อมรถขยะคอนเทนเนอร์ ๖ ล้อ ทะเบียน บง-๖๕๓๘', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(216, '16/2/2564', 'CNTR-663/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '13,598.00', 'จ้างซ่อมรถขุดตักหน้าขุดหลัง ทะเบียน ต-๐๓๔๖ (เลขครุภัณฑ์ ๐๑๘ ๓๗ ๐๐๐๒) ', 'ยังไม่คืน', '26/3/2565', 'สำนักการช่าง'),
(217, '17/2/2564', 'CNTR-670/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '12,075.00', 'จ้างซ่อมรถกวาดดูดฝุ่น ทะเบียน 82-2974 ', 'ยังไม่คืน', '20/4/2565', 'สำนักการช่าง'),
(218, '17/2/2564', 'CNTR-673/64', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '3,328.00', 'ซื้อครุภัณฑ์การเกษตร (มอเตอร์ไฟฟ้า) จำนวน ๒ ตัว', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(219, '18/2/2564', 'CNTR-680/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '24,950.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-นครนายก 33 ซอย 3 (ใน)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(220, '19/2/2564', 'CNTR-692/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '12,600.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่างทางสาธารณะ บริเวณสะพานข้างโรงงานกรีนสปอร์ต', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(221, '19/2/2564', 'CNTR-693/64', 'ห้างหุ้นส่วนจำกัด แอคคิวเรท พลัส', 'เงินสด  / 1 ปี ', '290', 'ซื้อครุภัณฑ์ (เครื่องวัดอุณหภูมิร่างกายแบบไม่สัมผัสระบบอินฟาเรดพร้อมขาตั้ง) ตามโครงการป้องกันการแพร่ระบาดเชื้อไวรัสโคโรน่า2019 จำนวน 2 เครื่อง', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(222, '19/2/2564', 'CNTR-696/64', 'ห้างหุ้นส่วนจำกัดมาอิ่มรวย2555', 'เงินสด  / 1 ปี ', '9,650.00', 'ซื้อครุภัณฑ์สำนักงาน (พัดลมตั้งพื้น ขนาด 26 นิ้ว และ พัดลมไอน้ำ ขนาด 24 นิ้ว)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(223, '22/2/2564', 'CNTR-699/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '23,450.00', 'จ้างเหมาโครงการปรับปรุงฝาบ่อพัก ซอยรังสิต-ปทุมธานี ๙', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(224, '23/2/2564', 'CNTR-701/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '5,431.00', 'จ้างซ่อมแซมรถตักล้อยาง ทะเบียน ต-๐๓๐๓ (เลขครุภัณฑ์ ๐๑๘ ๓๔ ๐๐๐๑)', 'ยังไม่คืน', '9/3/2565', 'สำนักการช่าง'),
(225, '23/2/2564', 'CNTR-702/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '13,252.00', 'จ้างซ่อมรถขยะคอนเทนเนอร์ ๖ ล้อ ทะเบียน บง-๖๕๓๙', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(226, '23/2/2564', 'CNTR-703/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '8,280.00', 'จ้างซ่อมรถแมคโคร ทะเบียน ต-๐๓๔๘ (หมายเลขครุภัณฑ์ ๐๑๙ ๓๗ ๐๐๐๒) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(227, '23/2/2564', 'CNTR-704/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '15,800.00', 'จ้างซ่อมรถบรรทุกซานต่ำ ทะเบียน ๘๒-๓๒๕๕ เลขครุภัณฑ์ ๐๐๒ ๕๐ ๐๐๐๘', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(228, '24/2/2564', 'CNTR-711/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '5,040.00', 'จ้างซ่อมรถบรรทุกขยะอัดท้าย ทะเบียน 82-4563 ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(229, '24/2/2564', 'CNTR-714/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '6,600.00', 'จ้างซ่อมรถบรรทุกขยะอัดท้าย ทะเบียน 82-2961', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(230, '1/3/2564', 'CNTR-724/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '15,000.00', 'จ้างซ่อมรถบรรทุก ๑๐ ล้อ ทะเบียน ๘๑-๖๘๒๑ (ครุภัณฑ์ ๐๑๓ ๔๔ ๐๐๐๙)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(231, '2/3/2564', 'CNTR-735/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '5,350.00', 'จ้างซ่อมรถแบคโฮ ทะเบียน ตค-๒๑๗ (เลขครุภัณฑ์ ๐๑๘ ๕๑ ๐๐๐๘) ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(232, '2/3/2564', 'CNTR-736/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '11,010.00', 'จ้างซ่อมรถบรรทุก ๑๐ ล้อ ทะเบียน ๘๑-๕๔๐๕ (๐๑๓ ๔๒ ๐๐๐๑) ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(233, '2/3/2564', 'CNTR-737/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '8,070.00', 'จ้างซ่อมรถบรรทุก ๑๐ ล้อทะเบียน ๘๑-๕๔๐๖ (เลขครุภัณฑ์ ๐๑๓ ๔๒ ๐๐๐๒)', 'ยังไม่คืน', '11/3/2565', 'สำนักการช่าง'),
(234, '2/3/2564', 'CNTR-738/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '18,350.00', 'จ้างซ่อมรถ ๒ คันทะเบียน บง-๖๕๓๙ และทะเบียน บ-๓๘๓๐', 'ยังไม่คืน', '30/3/2565', 'สำนักการช่าง'),
(235, '3/3/2564', 'CNTR-743/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '5,650.00', 'จ้างซ่อมรถบรรทุก ๑๐ ล้อ ทะเบียน น-๔๓๔๐', 'ยังไม่คืน', '30/3/2565', 'สำนักการช่าง'),
(236, '4/3/2564', 'CNTR-745/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '24,300.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่างทางสาธารณะ บริเวณซอยรังสิต-นครนายก 67 ช่วงท้ายซอย ', 'ยังไม่คืน', '11/3/2565', 'สำนักการช่าง'),
(237, '4/3/2564', 'CNTR-746/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '9,300.00', ' จ้างซ่อมรถแมคโคร ทะเบยน ตค-๑๒๗ เลขครุภัณฑ์ ๐๑๘ ๔๖ ๐๐๐๕ ', 'ยังไม่คืน', '12/3/2565', 'สำนักการช่าง'),
(238, '4/3/2564', 'CNTR-747/64', 'ห้างหุ้นส่วนจำกัด นวภูมิ การโยธา', 'หนังสือค้ำประกันเลขที่ 02073211000042 / 2 ปี ', '417,500.00', 'จ้างก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ คสล.ซอยรังสิต-นครนายก 56 (ช่วงที่ 1) ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(239, '4/3/2564', 'CNTR-750/64', 'ห้างหุ้นส่วนจำกัด นวภูมิ การโยธา', 'หนังสือค้ำประกันเลขที่ 02073211000041 / 2 ปี ', '212,000.00', 'จ้างก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ ซอยรังสิต-นครนายก 27 ซอย 4 (สหกรณ์รัตนปทุม)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(240, '5/3/2564', 'CNTR-754/64', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '2,600.00', 'ซื้อครุภัณฑ์ไฟฟ้าและวิทยุ (เครื่องกำเนิดไฟฟ้า) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(241, '5/3/2564', 'CNTR-756/64', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '2,375.00', 'ซื้อครุภัณฑ์งานบ้านงานครัว (จัดซื้อเครื่องตัดหญ้าจำนวน 5 เครื่อง) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(242, '5/3/2564', 'CNTR-757/64', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '2,885.00', ' ซื้อครุภัณฑ์งานบ้านงานครัว(เครื่องตัดแต่งพุ่มไม้ ขนาด ๒๒ นิ้ว ๑ เครื่องและเครื่องตัดหญ้าแบบข้อแข็ง ๕ เครื่อง)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(243, '8/3/2564', 'CNTR-763/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '20,486.00', 'จ้างซ่อมรถ ๒ คันทะเบียน บง-๒๓๑๒ และทะเบียน ต-๐๓๔๘', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(244, '9/3/2564', 'CNTR-769/64', 'ห้างหุ้นส่วนจำกัด  นาคนิกร', 'เงินสด  / 3 เดือน ', '6,880.00', 'จ้างซ่อมรถบรรทุกขยะอัดท้าย ทะเบียน 82-4722', 'ยังไม่คืน', '24/4/2564', 'สำนักการช่าง'),
(245, '9/3/2564', 'CNTR-771/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '15,000.00', 'จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์ ๑๖ (๐๒๘ ๕๔ ๐๐๒๐)', 'ยังไม่คืน', '31/3/2565', 'สำนักการช่าง'),
(246, '15/3/2564', 'CNTR-793/64', 'บริษัท ท็อปเบสท์ มอเตอร์ เซลส์ จำกัด', 'หนังสือค้ำประกันเลขที่ ค.47690324220000 / 1 ปี ', '93,500.00', 'ซื้อครุภัณฑ์ยานพาหนะและขนส่ง (รถบรรทุกมูลฝอยแบบอัดท้าย (ดีเซล) ขนาด ๖ ตัน ๖ ล้อ)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(247, '16/3/2564', 'CNTR-798/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '14,800.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่างทางสาธารณะ บริเวณสะพานหน้าซอยรังสิต-นครนายก 46 ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(248, '16/3/2564', 'CNTR-800/64', 'ห้างหุ้นส่วนจำกัด เดชปภัช คอนสตรัคชั่น', 'เช็คเลขที่ 16512241 / 2 ปี ', '186,000.00', 'จ้างก่อสร้างถนน คสล.ซอยรังสิต-ปทุมธานี 15 (ซอยแสงรัตน์) ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(249, '22/3/2564', 'CNTR-818/64', 'บริษัท พกฤษ จำกัด', 'เงินสด  / 2 ปี ', '15,400.00', 'จ้างเหมาโครงการติดตั้งไฟฟ้าส่องสว่างบริเวณฟุตบาทริมคลองรังสิตประยูรศักดิ์และบริเวณป้ายรถประจำทางสะพานฟ้า ', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(250, '25/3/2564', 'CNTR-848/64', 'บริษัท เอ็นจินีโอ จำกัด', 'เงินสด  / 2 ปี ', '24,800.00', 'จ้างเหมาโครงการปรับปรุงระบบไฟฟ้าสปริงเกอร์รดน้ำต้นไม้โดยใช้พลังงานทดแทน บริเวณสวนเกาะกลางถนนเลียบคลองรังสิตประยูรศักดิ์ ช่วงระหว่างสะพานแก้วถึงโรงเรียนชุมชนประชาธิปัตย์ (ช่วง 1)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(251, '30/3/2564', 'CNTR-862/64', 'บริษัท วิรุฬห์ แอนด์ เกวนเนส จำกัด', 'หนังสือค้ำประกันเลขที่ 100038159954 / 2 ปี ', '125,000.00', 'จ้างติดตั้งเครื่องสูบน้ำสถานีสูบน้ำ เมน 1 หมู่บ้านรัตนโกสินทร์ 200 ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(252, '31/3/2564', 'CNTR-799/64', 'บริษัท วิรุฬห์ แอนด์ เกวนเนส จำกัด', 'หนังสือค้ำประกันเลขที่ 100037651685 / 2 ปี ', '99,000.00', 'จ้างก่อสร้างบ่อระบบสูบน้ำโรงเรียนนครรังสิต เทพธัญญะอุปถัมภ์ พร้อมระบบสูบน้ำอัตโนมัติ ', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(253, '7/4/2564', 'CNTR-895/64', 'บริษัท จุไลยะจักร คอนโซลิเดต จำกัด', 'หนังสือค้ำประกันเลขที่ 100038363306 / 2 ปี ', '181,900.00', 'จ้างก่อสร้างถนน คสล.พร้อมวางท่อระบายน้ำ HDPE ซอยพหลโยธิน 87 ซอย 10 แยก 6', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(254, '7/4/2564', 'CNTR-0896/64', 'บริษัท วันชัย 1992 จำกัด', 'หนังสือค้ำประกันเลขที่ 00019/201036/0001/64 / 2 ปี ', '305,000.00', 'จ้างก่อสร้างถนนคอนกรีตเสริมเหล็ก รหัสทางหลวงท้องถิ่น ปท ถ.6-0047 สายซอยรังสิต - นครนายก 12 (ด้านท้ายซอย)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(255, '26/4/2564', 'CNTR-926/64', 'บริษัท ไฮไลท์ อิเล็กทรอนิกส์ จำกัด', 'หนังสือค้ำประกันเลขที่ 100038727243 / 2 ปี ', '48,300.00', 'จ้างก่อสร้างติดตั้งไฟฟ้าส่องสว่างทางสาธารณะ ถนนซอยรังสิต-นครนายก 29 ซอย 1', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(256, '27/4/2564', 'CNTR-934/64', 'บริษัท พรประเสริฐ การโยธา จำกัด', 'หนังสือค้ำประกันเลขที่ 02237211000224 / 2 ปี ', '102,800.00', 'จ้างก่อสร้างก่อสร้างถนน คสล.ซอยพหลโยธิน 87 แยก 6 (ทางเข้าโรงเรียนสายปัญญา)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(257, '25/5/2564', 'CNTR-0978/64', 'บริษัท วันชัย 1992 จำกัด', 'หนังสือค้ำประกันเลขที่ 00019/201036/0002/64 / 2 ปี ', '350,000.00', 'จ้างก่อสร้างถนนคอนกรีตเสริมเหล็ก รหัสทางหลวงท้องถิ่น ปท.ถ.6-0038 สายซอยรังสิต- นครนายก 57 (ด้านท้ายซอย) ชุมชนเจ้าจอม', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(258, '27/5/2564', 'CNTR-981/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '19,905.00', 'จ้างซ่อมรถแบคโฮ ทะเบียน ตค-๒๑๗ (๐๑๘ ๕๑ ๐๐๐๘)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(259, '27/5/2564', 'CNTR-982/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '12,343.00', 'จ้างซ่อมรถดูดโคลนเลน ทะเบียน บง-๒๔๗ (๐๓๕ ๔๐ ๐๐๐๑)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(260, '27/5/2564', 'CNTR-984/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '14,617.00', 'จ้างซ่อมรถบรรทุก ๑๐ ล้อ ทะเบียน ๘๑-๖๘๒๓ (๐๑๓ ๔๔ ๐๐๐๘)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(261, '27/5/2564', 'CNTR-985/64', 'บริษัท เคลฟเวอร์ เซอร์วิส จำกัด', 'เงินสด  / 3 เดือน ', '8,674.00', 'จ้างซ่อมรถตักล้อยาง ทะเบียน ต-๐๓๐๓ (๐๑๘ ๓๔ ๐๐๐๑)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(262, '28/5/2564', 'CNTR-994/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '6,273.00', 'จ้างซ่อมตู้บรรทุกขยะ เบอร์ ๒๓ (๐๒๘ ๖๑ ๐๐๑๙) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(263, '28/5/2564', 'CNTR-995/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '11,140.00', 'จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์ ๑ (๐๒๘ ๕๑ ๐๐๐๕) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(264, '28/5/2564', 'CNTR-996/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '14,578.00', 'จ้างซ่อมแซมตู้บรรทุกขยะ เบอร์ ๓ (๐๒๘ ๕๑ ๐๐๐๗) ', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(265, '28/5/2564', 'CNTR-997/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '20,330.00', 'จ้างซ่อมแซมเครื่องอัดขยะมูลฝอยเครื่องที่ ๒ (๓๒๙ ๕๔ ๐๐๐๒)', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(266, '31/5/2564', 'CNTR-1010/64', 'บริษัท พี ซี คอนกรีตปทุมธานี จำกัด', 'หนังสือค้ำประกันเลขที่ ค.47690330893000 / 2 ปี ', '24,250.00', 'จ้างเหมาโครงการปรับปรุงระบบจราจร บริเวณซอยรังสิต-นครนายก 67', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(267, '31/5/2564', 'CNTR-1013/64', 'บริษัท อ.นวรัตน์ จำกัด', 'เงินสด  / 1 ปี ', '9,359.00', 'ซื้อครุภัณฑ์สำนักงาน (โต๊ะพับเอนกประสงค์ จำนวน 50 ตัว)', 'ยังไม่คืน', '1 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(268, '23/6/2564', 'CNTR-1045/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '6,273.00', 'ค่าบำรุงรักษาและซ่อมแซม', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(269, '23/6/2564', 'CNTR-1046/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '20,330.00', 'ค่าบำรุงรักษาและซ่อมแซม', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(270, '23/6/2564', 'CNTR-1047/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '11,140.00', 'ค่าบำรุงรักษาและซ่อมแซม', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(271, '23/6/2564', 'CNTR-1048/64', 'บริษัท มาร์เก็ตติ้ง ฟอร์เวิร์ด จำกัด', 'เงินสด  / 3 เดือน ', '14,578.00', 'ค่าบำรุงรักษาและซ่อมแซม', 'ยังไม่คืน', '3 เดือน นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(272, '24/6/2564', 'CNTR-1030/64', 'บริษัท ไฮไลท์ อิเล็กทรอนิกส์ จำกัด', 'หนังสือค้ำประกันเลขที่ 1000400598518 / 2 ปี ', '79,000.00', 'จ้างเหมาโครงการปรับปรุงสะพานคลองหนึ่ง', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง'),
(273, '24/6/2564', 'CNTR-1049/64', 'บริษัท พรประเสริฐ การโยธา จำกัด', 'หนังสือค้ำประกันเลขที่ 02237211000329 / 2 ปี ', '164,000.00', 'จ้าเหมาโครงการก่อสร้างถนน คสล. พร้อมวางท่อระบายน้ำ คสล. ซอยรังสิต-นครนายก 57 (ช่วงที่ 2)', 'ยังไม่คืน', '2 ปี นับถัดจากวันที่ส่งมอบงานงวดสุดท้าย', 'สำนักการช่าง');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_unit`
--

CREATE TABLE `tbl_unit` (
  `unit_id` int(11) NOT NULL,
  `unit_code` varchar(4) NOT NULL,
  `unit_name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tbl_unit`
--

INSERT INTO `tbl_unit` (`unit_id`, `unit_code`, `unit_name`) VALUES
(1, 'u001', 'ชิ้น'),
(2, 'u002', 'อัน'),
(3, 'u003', 'รีม'),
(4, 'u004', 'กล่อง'),
(5, 'u005', 'ถุง'),
(6, 'u006', 'ด้าม');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_user`
--

CREATE TABLE `tbl_user` (
  `user_id` int(11) NOT NULL,
  `username` varchar(200) NOT NULL COMMENT 'รหัสผู้ใช้',
  `user_pass` varchar(200) NOT NULL COMMENT 'รหัสผ่าน hash',
  `user_prefix` varchar(20) NOT NULL COMMENT 'คำนำหน้าชื่อ',
  `user_fname` varchar(200) NOT NULL COMMENT 'ชื่อ',
  `user_lname` varchar(200) NOT NULL COMMENT 'สกุล',
  `user_tel` varchar(20) NOT NULL,
  `user_email` varchar(100) NOT NULL COMMENT 'email',
  `user_division_id` int(11) NOT NULL COMMENT 'รหัสสำนัก/กอง',
  `user_subdivision_id` int(11) NOT NULL COMMENT 'รหัสฝ่าย',
  `user_section_id` int(11) NOT NULL COMMENT 'รหัสแผนก',
  `user_position` varchar(100) NOT NULL COMMENT 'ตำแหน่ง',
  `user_status` enum('N','Y') NOT NULL,
  `user_stat` enum('ADMIN','STAFF','BOSS','EWPLOYES','GENERAL') NOT NULL,
  `profile_img` varchar(255) NOT NULL DEFAULT 'avatar_2x.png',
  `creation_date` date NOT NULL COMMENT 'วันที่สร้าง',
  `update_date` date NOT NULL COMMENT 'วันที่อัพเดต',
  `creation_by` int(10) NOT NULL COMMENT 'รหัสสผู้ใช้งานที่ทำการสร้าง',
  `update_by` int(10) NOT NULL COMMENT 'รหัสสผู้ใช้งานที่ทำการแก้ไข'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tbl_user`
--

INSERT INTO `tbl_user` (`user_id`, `username`, `user_pass`, `user_prefix`, `user_fname`, `user_lname`, `user_tel`, `user_email`, `user_division_id`, `user_subdivision_id`, `user_section_id`, `user_position`, `user_status`, `user_stat`, `profile_img`, `creation_date`, `update_date`, `creation_by`, `update_by`) VALUES
(71, 'maxmumi99', '7c4a8d09ca3762af61e59520943dc26494f8941b', 'นาย', 'ปฐวีกานต์', 'ศรีคราม', '0981051534', 'maxmumi99@gmail..com', 1, 4, 1, 'นักวิชาการคอมพิวเตอร์ปฏิบัติการ', 'Y', 'ADMIN', 'user_5fb6a43bac4f8.png', '2020-11-14', '2020-12-06', 71, 71),
(76, 'publich_p', '$2y$10$y8cWV7wYgovJL4ag.7farOv58hucbujfndAdERlSqXi61BEGkkUfi', 'นาง', 'พิมพร', 'เทียนถาวร', ' 0898167254', 'publich_p@rangsit.com', 1, 3, 8, 'พยาบาลวิชาชีพชำนาญการ', 'Y', 'STAFF', 'user_5fa7ffe2a8a15.png', '2020-11-22', '2020-12-09', 71, 71),
(133, '0867756863', '$2y$10$WxDx2cArCmWBm.qhGdNCrOFeJgBUwDREMYetFQiyepWNu9D1PfKBm', 'นาง', 'ฉลวย', 'พินดิษฐ์', '0867756863', '', 1, 4, 1, 'ผู้ช่วยนักจัดการงานทั่วไป', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-02', '2020-12-02', 71, 71),
(134, 's01', '$2y$10$SqaXt8.x0300d.IXiklVteFxzKQzRQYn3/P.g8kLDhyxSdaIkceAC', 'นาง', 'ทัศนีย์', 'เจริญอัศวสุข', '0850460870', '', 0, 3, 10, 'พยาบาลวิชาชีพชำนาญการ', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-09', '2020-12-09', 71, 71),
(135, 's03', '$2y$10$.At1OhLawIjgvQ5iozDfn.tgSIOto37mxBwDcpQZmHFoXkrRbbm0.', 'นาง', 'วรรณ์มนธัญ', 'ปลื้มชัย', '0890681992', '', 0, 3, 10, 'พยาบาลวิชาชีพชำนาญการ', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-09', '2020-12-09', 71, 71),
(136, 's04', '$2y$10$FkuIt0fYbHW2yjWHLpxl6OXe5GJcZNd1FhDCPhL7clHOua4XNytZK', 'นาง', 'พิมประภา', 'พลเธียร', '0831889907', '', 1, 3, 10, 'พยาบาลวิชาชีพชำนาญการ', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-09', '0000-00-00', 71, 0),
(137, 's02', '$2y$10$9xe7ovO9EFCuUfXl8zxdJOWcsA30cXjBlXG6LxRpcUmc/SIGdclFq', 'นางสาว', 'ศุฐินันท์', 'เลื้อนแป้น', '0860896911', '', 0, 3, 10, 'พยาบาลวิชาชีพบชำนาญการ', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-09', '2020-12-09', 71, 71),
(138, 's05', '$2y$10$IyRtOOy4mP5sTezNN5IvR.gi6Tn4p4l7pcXTfX6lg25MnC4r0YDaS', 'นางสาว', 'จริญา', 'พัดทอง', '0830325314', '', 0, 3, 10, 'พยาบลวิชาชีพชำนาญการ', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-09', '2020-12-09', 71, 71),
(139, 'at2c', '$2y$10$Fu68ljhU.8kUG6RRbH.d0O2sK3W.FXh1jgRP2kewWvyR9gqW31Nxm', 'นาย', 'ภัทรพล', 'ภูคุ้มจันอัด', '0948629159', '', 0, 3, 10, 'นักกายภาพบำบัดปฏิบัติการ', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-09', '2020-12-09', 71, 71),
(140, 'pah01', '$2y$10$DE8xOTNkhjOQvoCttIYowenGwbx1IbMbYAmxqA0jv6h1TLI1aTILC', 'นางสาว', 'ชุลีวรรณ', 'มาดเจือ', '0981051534', 'Chuleewan@gmail.com', 0, 1, 2, 'ผู้ช่วยเจ้าพนักงานธุรการ', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-09', '2020-12-09', 71, 71),
(141, 'pha2', '$2y$10$vSunX.7IUkgXYFHVVirdIuSkywxIVPkilFhzjrbzMjOTR32ek4Qla', 'นาย', 'ศักดา', 'เหมาะหมาย', '0981051534', 'Sakda12345555@gmail.com', 0, 2, 7, 'ผู้ช่วยเจ้าพนักงานงานธุรการ', 'Y', 'STAFF', 'avatar_2x.png', '2020-12-09', '2020-12-09', 71, 71);

-- --------------------------------------------------------

--
-- Table structure for table `tbl_withdraw`
--

CREATE TABLE `tbl_withdraw` (
  `id` int(11) NOT NULL,
  `withdraw_id` varchar(20) NOT NULL,
  `user` varchar(100) NOT NULL,
  `time` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tbl_withdraw`
--

INSERT INTO `tbl_withdraw` (`id`, `withdraw_id`, `user`, `time`) VALUES
(1, 'w2023-11-30_0851am', 'ทนงค์ บุญเติม', '2023-11-30 07:51:48'),
(2, 'w2023-11-30_0907am', 'ทนงค์ บุญเติม', '2023-11-30 08:07:25'),
(3, 'w2023-11-30_0908am', 'ทนงค์ บุญเติม', '2023-11-30 08:08:09'),
(4, 'w2023-11-30_0933am', 'ทนงค์ บุญเติม', '2023-11-30 08:33:47'),
(5, 'w2023-11-30_0945am', 'ทนงค์ บุญเติม', '2023-11-30 08:45:51'),
(6, 'w2023-11-30_0956am', 'ทนงค์ บุญเติม', '2023-11-30 08:56:47'),
(7, 'w2023-11-30_1004am', 'ทนงค์ บุญเติม', '2023-11-30 09:04:57'),
(8, 'w2023-11-30_1005am', 'ทนงค์ บุญเติม', '2023-11-30 09:05:14'),
(9, 'w2023-11-30_1005am', 'ทนงค์ บุญเติม', '2023-11-30 09:05:30'),
(10, 'w2023-11-30_1241pm', 'ทดสอบ ทดสอบ', '2023-11-30 11:41:10'),
(11, 'w2023-11-30_1258pm', 'ทดสอบ ทดสอบ', '2023-11-30 11:58:31'),
(12, 'w2023-12-01_0527am', 'ทดสอบ ทดสอบ', '2023-12-01 04:27:12'),
(13, 'w2023-12-01_0529am', 'ทดสอบ ทดสอบ', '2023-12-01 04:29:41'),
(14, 'w2023-12-01_0530am', 'ทดสอบ ทดสอบ', '2023-12-01 04:30:08'),
(15, 'w2023-12-01_0759am', 'ทดสอบ ทดสอบ', '2023-12-01 06:59:27'),
(16, 'w2023-12-01_0800am', 'ทดสอบ ทดสอบ', '2023-12-01 07:00:01'),
(17, 'w2023-12-01_0801am', 'ทดสอบ ทดสอบ', '2023-12-01 07:01:24'),
(18, 'w2023-12-01_0801am', 'ทดสอบ ทดสอบ', '2023-12-01 07:01:38');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_withdraw_log`
--

CREATE TABLE `tbl_withdraw_log` (
  `id` int(11) NOT NULL,
  `withdraw_id` varchar(20) NOT NULL,
  `withdraw_mat` varchar(10) NOT NULL,
  `withdraw_qty` int(11) NOT NULL,
  `withdraw_time` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `status` varchar(1) NOT NULL,
  `user` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tbl_withdraw_log`
--

INSERT INTO `tbl_withdraw_log` (`id`, `withdraw_id`, `withdraw_mat`, `withdraw_qty`, `withdraw_time`, `status`, `user`) VALUES
(1, 'w2023-11-30_0851am', 'c01', 1, '2023-11-30 07:52:16', '3', 'ทนงค์ บุญเติม'),
(2, 'w2023-11-30_0851am', 'c02', 1, '2023-11-30 07:52:21', '2', 'ทนงค์ บุญเติม'),
(3, 'w2023-11-30_0851am', 'c03', 1, '2023-11-30 08:32:47', '3', 'ทนงค์ บุญเติม'),
(4, 'w2023-11-30_0907am', 'c01', 1, '2023-11-30 08:32:58', '3', 'ทนงค์ บุญเติม'),
(5, 'w2023-11-30_0907am', 'c03', 1, '2023-11-30 08:42:14', '3', 'ทนงค์ บุญเติม'),
(6, 'w2023-11-30_0908am', 'c01', 1, '2023-11-30 08:34:06', '3', 'ทนงค์ บุญเติม'),
(7, 'w2023-11-30_0908am', 'c02', 1, '2023-11-30 08:42:21', '3', 'ทนงค์ บุญเติม'),
(8, 'w2023-11-30_0908am', 'c03', 1, '2023-11-30 08:44:15', '3', 'ทนงค์ บุญเติม'),
(9, 'w2023-11-30_0933am', 'c01', 1, '2023-11-30 08:45:23', '3', 'ทนงค์ บุญเติม'),
(10, 'w2023-11-30_0945am', 'c01', 1, '2023-11-30 08:46:04', '3', 'ทนงค์ บุญเติม'),
(11, 'w2023-11-30_0945am', 'c02', 1, '2023-11-30 08:46:39', '3', 'ทนงค์ บุญเติม'),
(12, 'w2023-11-30_0956am', 'c01', 1, '2023-11-30 08:57:45', '3', 'ทนงค์ บุญเติม'),
(13, 'w2023-11-30_0956am', 'c02', 1, '2023-11-30 09:56:58', '3', 'ทนงค์ บุญเติม'),
(14, 'w2023-11-30_0956am', 'c03', 1, '2023-11-30 12:17:43', '3', 'ทนงค์ บุญเติม'),
(15, 'w2023-11-30_1004am', 'c01', 1, '2023-11-30 09:05:52', '3', 'ทนงค์ บุญเติม'),
(16, 'w2023-11-30_1004am', 'c02', 1, '2023-11-30 09:57:05', '3', 'ทนงค์ บุญเติม'),
(17, 'w2023-11-30_1004am', 'c03', 1, '2023-11-30 12:17:48', '3', 'ทนงค์ บุญเติม'),
(18, 'w2023-11-30_1005am', 'c01', 1, '2023-11-30 09:05:59', '3', 'ทนงค์ บุญเติม'),
(19, 'w2023-11-30_1005am', 'c02', 1, '2023-11-30 12:18:02', '3', 'ทนงค์ บุญเติม'),
(20, 'w2023-11-30_1005am', 'c03', 1, '2023-11-30 12:17:53', '3', 'ทนงค์ บุญเติม'),
(21, 'w2023-11-30_1005am', 'c01', 1, '2023-12-01 04:27:55', '3', 'ทนงค์ บุญเติม'),
(22, 'w2023-11-30_1005am', 'c02', 1, '2023-12-01 04:28:01', '3', 'ทนงค์ บุญเติม'),
(23, 'w2023-11-30_1005am', 'c03', 1, '2023-12-01 04:28:07', '3', 'ทนงค์ บุญเติม'),
(24, 'w2023-11-30_1241pm', 'c01', 1, '2023-12-01 04:28:11', '3', 'ทดสอบ ทดสอบ'),
(25, 'w2023-11-30_1241pm', 'c02', 1, '2023-12-01 04:28:14', '3', 'ทดสอบ ทดสอบ'),
(26, 'w2023-11-30_1258pm', 'c01', 1, '2023-12-01 04:28:18', '3', 'ทดสอบ ทดสอบ'),
(27, 'w2023-11-30_1258pm', 'c03', 1, '2023-12-01 04:28:22', '3', 'ทดสอบ ทดสอบ'),
(28, 'w2023-12-01_0527am', 'c01', 10, '2023-12-01 04:28:26', '3', 'ทดสอบ ทดสอบ'),
(29, 'w2023-12-01_0527am', 'c02', 5, '2023-12-01 04:30:37', '3', 'ทดสอบ ทดสอบ'),
(30, 'w2023-12-01_0529am', 'c01', 1, '2023-12-01 10:24:32', '3', 'ทดสอบ ทดสอบ'),
(31, 'w2023-12-01_0530am', 'c02', 20, '2023-12-01 04:30:27', '3', 'ทดสอบ ทดสอบ'),
(32, 'w2023-12-01_0759am', 'c01', 4, '2023-12-01 10:24:37', '3', 'ทดสอบ ทดสอบ'),
(33, 'w2023-12-01_0800am', 'c02', 11, '2023-12-01 07:00:01', '1', 'ทดสอบ ทดสอบ'),
(34, 'w2023-12-01_0800am', 'c03', 12, '2023-12-01 07:00:01', '1', 'ทดสอบ ทดสอบ'),
(35, 'w2023-12-01_0800am', 'c01', 10, '2023-12-01 10:38:38', '3', 'ทดสอบ ทดสอบ'),
(36, 'w2023-12-01_0801am', 'c01', 1, '2023-12-01 10:53:05', '3', 'ทดสอบ ทดสอบ'),
(37, 'w2023-12-01_0801am', 'c01', 4, '2023-12-01 10:28:08', '2', 'ทดสอบ ทดสอบ');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_work`
--

CREATE TABLE `tbl_work` (
  `work_id` int(11) NOT NULL,
  `work_code` varchar(10) NOT NULL,
  `work_name` varchar(100) NOT NULL,
  `division_ref` varchar(10) NOT NULL,
  `part_ref` varchar(11) NOT NULL,
  `subdivision_ref` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci COMMENT='งานย่อยในแต่ละฝ่าย';

--
-- Dumping data for table `tbl_work`
--

INSERT INTO `tbl_work` (`work_id`, `work_code`, `work_name`, `division_ref`, `part_ref`, `subdivision_ref`) VALUES
(1, '0111', 'งานธุการ', '0100', '0110', '0111'),
(2, '0112', 'งานธุรการสภา', '0100', '0110', '0111');

-- --------------------------------------------------------

--
-- Table structure for table `tb_complain`
--

CREATE TABLE `tb_complain` (
  `id` int(11) NOT NULL,
  `req_date` date NOT NULL,
  `topic` varchar(255) NOT NULL,
  `complainant` varchar(255) NOT NULL,
  `complainant_type` varchar(100) NOT NULL,
  `address` varchar(255) NOT NULL,
  `tel` varchar(10) NOT NULL,
  `email` varchar(255) NOT NULL,
  `detail` varchar(255) NOT NULL,
  `receive_id` varchar(10) NOT NULL,
  `receive_date` datetime NOT NULL,
  `department` varchar(255) NOT NULL,
  `work_result` varchar(255) NOT NULL,
  `responsible_person` varchar(100) NOT NULL,
  `file_name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `tb_complain`
--

INSERT INTO `tb_complain` (`id`, `req_date`, `topic`, `complainant`, `complainant_type`, `address`, `tel`, `email`, `detail`, `receive_id`, `receive_date`, `department`, `work_result`, `responsible_person`, `file_name`) VALUES
(8, '2564-12-08', 'ท่อระบายน้ำอุดตัน และน้ำเจิ่งนอง', 'test', 'นิติบุคคล', '25/222', '099', 'th@gg.com', 'mmm', 'rfeg', '2564-12-29 00:00:00', 'sdgrs', 'sefgs', 'sdeges', 'แบบโรงงานขยะ-Model.pdf'),
(9, '2564-12-29', 'พรบ คอม', 'noo', 'นิติบุคคล', 'ืืnbb', '000', 'sdgvsvg', 'sds', 'sd', '2564-12-29 00:00:00', 'sdvfsdv', 'sdfvds', 'sdfvdsv', 'พรบ_คอม.PDF'),
(10, '2564-12-29', 'asefwaw', 'asfawfewa', 'นิติบุคคล', 'sfewawe', 'sfaw', 'sfs', 'sfas', 'sfsae', '2564-12-23 00:00:00', 'sefra', 'asfas', 'sfaerf', 'สปร.5.pdf'),
(11, '2564-12-23', 'zsfvzsv', 'scSAD', 'บุคคลธรรมดา', 'sZcf', 'zscvzs', 'zsdcvzs', 'zscvzscv', 'sZcvS', '2564-11-30 00:00:00', 'sVszv', 'zsvzsvd', 'zsvaz', 'AdminLTE 3  DataTables.pdf'),
(12, '2564-12-08', 'ไฟดับ', 'ฟำดฟไ', 'นิติบุคคล', 'ฟไดฟไ', 'ฟหดฟ', 'ฟไดฟ', 'หเอหกอิหก', 'กหเอกหอ', '2564-11-26 00:00:00', 'เดำหเอห', 'หดเกหพดเอห', 'ฟดฟหำพเ', 'ภาค ก ท้องถิ่น(กฎหมาย).pdf');

-- --------------------------------------------------------

--
-- Table structure for table `user_login`
--

CREATE TABLE `user_login` (
  `id` int(11) NOT NULL,
  `prefix` varchar(10) NOT NULL,
  `firstname` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `lastname` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `username` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `tel` varchar(10) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `position` varchar(255) NOT NULL,
  `division` varchar(100) NOT NULL,
  `part` varchar(100) NOT NULL,
  `subdivision` varchar(100) NOT NULL,
  `section` varchar(10) NOT NULL,
  `img` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `user_login`
--

INSERT INTO `user_login` (`id`, `prefix`, `firstname`, `lastname`, `username`, `password`, `email`, `tel`, `position`, `division`, `part`, `subdivision`, `section`, `img`) VALUES
(1, 'นาย', 'ทดสอบ', 'ทดสอบ', 'user1', 'user1', 'thanongb42@gmail.com', '0910109174', 'เจ้าหน้าที่ทั่วไป', '', '', '', '', 'thanong.jpg');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `activity_log`
--
ALTER TABLE `activity_log`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `admin_login`
--
ALTER TABLE `admin_login`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `event_log`
--
ALTER TABLE `event_log`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbl_division`
--
ALTER TABLE `tbl_division`
  ADD PRIMARY KEY (`division_id`);

--
-- Indexes for table `tbl_location`
--
ALTER TABLE `tbl_location`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbl_mat`
--
ALTER TABLE `tbl_mat`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbl_part`
--
ALTER TABLE `tbl_part`
  ADD PRIMARY KEY (`part_id`);

--
-- Indexes for table `tbl_positions`
--
ALTER TABLE `tbl_positions`
  ADD PRIMARY KEY (`position_id`);

--
-- Indexes for table `tbl_request`
--
ALTER TABLE `tbl_request`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbl_stock`
--
ALTER TABLE `tbl_stock`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbl_subdivision`
--
ALTER TABLE `tbl_subdivision`
  ADD PRIMARY KEY (`subdivision_id`);

--
-- Indexes for table `tbl_treasury`
--
ALTER TABLE `tbl_treasury`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbl_unit`
--
ALTER TABLE `tbl_unit`
  ADD PRIMARY KEY (`unit_id`);

--
-- Indexes for table `tbl_user`
--
ALTER TABLE `tbl_user`
  ADD PRIMARY KEY (`user_id`),
  ADD KEY `user_section_id` (`user_section_id`),
  ADD KEY `user_position_id` (`user_position`);

--
-- Indexes for table `tbl_withdraw`
--
ALTER TABLE `tbl_withdraw`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbl_withdraw_log`
--
ALTER TABLE `tbl_withdraw_log`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbl_work`
--
ALTER TABLE `tbl_work`
  ADD PRIMARY KEY (`work_id`);

--
-- Indexes for table `tb_complain`
--
ALTER TABLE `tb_complain`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user_login`
--
ALTER TABLE `user_login`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `activity_log`
--
ALTER TABLE `activity_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `admin_login`
--
ALTER TABLE `admin_login`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `event_log`
--
ALTER TABLE `event_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=297;

--
-- AUTO_INCREMENT for table `tbl_division`
--
ALTER TABLE `tbl_division`
  MODIFY `division_id` int(3) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `tbl_location`
--
ALTER TABLE `tbl_location`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `tbl_mat`
--
ALTER TABLE `tbl_mat`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `tbl_part`
--
ALTER TABLE `tbl_part`
  MODIFY `part_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `tbl_positions`
--
ALTER TABLE `tbl_positions`
  MODIFY `position_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT for table `tbl_request`
--
ALTER TABLE `tbl_request`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `tbl_stock`
--
ALTER TABLE `tbl_stock`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `tbl_subdivision`
--
ALTER TABLE `tbl_subdivision`
  MODIFY `subdivision_id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'รหัส', AUTO_INCREMENT=33;

--
-- AUTO_INCREMENT for table `tbl_treasury`
--
ALTER TABLE `tbl_treasury`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=274;

--
-- AUTO_INCREMENT for table `tbl_unit`
--
ALTER TABLE `tbl_unit`
  MODIFY `unit_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `tbl_user`
--
ALTER TABLE `tbl_user`
  MODIFY `user_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=142;

--
-- AUTO_INCREMENT for table `tbl_withdraw`
--
ALTER TABLE `tbl_withdraw`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT for table `tbl_withdraw_log`
--
ALTER TABLE `tbl_withdraw_log`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;

--
-- AUTO_INCREMENT for table `tbl_work`
--
ALTER TABLE `tbl_work`
  MODIFY `work_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `tb_complain`
--
ALTER TABLE `tb_complain`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `user_login`
--
ALTER TABLE `user_login`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
